iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
#include <stdint.h>

struct Floating_point_registers_Advanced_SIMD_and_Floating_point_Extension_system_registers_tag
{
  uint32_t FPSID;
  uint8_t res0[4092];

  uint32_t FPSCR;
  uint8_t res1[20476];

  uint32_t MVFR1;
  uint8_t res2[4092];

  uint32_t MVFR0;
  uint8_t res3[4092];

  uint32_t FPEXC;
};

#define Floating_point_registers_Advanced_SIMD_and_Floating_point_Extension_system_registers (*(volatile struct Floating_point_registers_Advanced_SIMD_and_Floating_point_Extension_system_registers_tag *) 0xa0000)

struct MSS_VIM_R5A_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR:6;
      uint64_t CUSTOM:2;
      uint64_t MAJOR:3;
      uint64_t RTL:5;
      uint64_t FUNC:12;
      uint64_t BU:2;
      uint64_t SCHEME:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTERRUPTS:11;
      uint64_t RES1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUM:10;
      uint64_t RES3:6;
      uint64_t PRI:4;
      uint64_t RES2:11;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRIIRQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUM:10;
      uint64_t RES5:6;
      uint64_t PRI:4;
      uint64_t RES4:11;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRIFIQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQGSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIQGSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES21:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQVEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES22:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIQVEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUM:10;
      uint64_t RES7:6;
      uint64_t PRI:4;
      uint64_t RES6:11;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACTIRQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUM:10;
      uint64_t RES9:6;
      uint64_t PRI:4;
      uint64_t RES8:11;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACTFIQ;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES23:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEDVEC;

  uint8_t res1[972];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_EN_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTER_EN_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIQSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_EN_SET_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTER_EN_CLR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQSTS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIQSTS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMAP_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTTYPE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_EN_SET_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTER_EN_CLR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQSTS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIQSTS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMAP_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTTYPE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_EN_SET_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTER_EN_CLR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQSTS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIQSTS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMAP_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTTYPE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_EN_SET_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTER_EN_CLR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQSTS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIQSTS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMAP_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTTYPE_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_EN_SET_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTER_EN_CLR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQSTS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIQSTS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMAP_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTTYPE_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_EN_SET_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTER_EN_CLR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQSTS_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIQSTS_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMAP_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTTYPE_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_EN_SET_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTER_EN_CLR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQSTS_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIQSTS_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTMAP_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTTYPE_7;

  uint8_t res2[2816];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_67;

