iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_104;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_105;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_106;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_108;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_109;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_128;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_129;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_130;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_131;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_132;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_133;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_134;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_135;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_136;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_137;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_138;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_139;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_140;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_141;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_142;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_143;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_144;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_145;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_146;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_147;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_148;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_149;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_150;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_151;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_152;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_153;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_154;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_155;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_156;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_157;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_158;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_159;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_160;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_161;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_162;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_163;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_164;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_165;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_166;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_167;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_168;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_169;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_170;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_171;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_172;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_173;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_174;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_175;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_176;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_177;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_178;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_179;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_180;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_181;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_182;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_183;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_184;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_185;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_186;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_187;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_188;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_189;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_190;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_191;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_192;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_193;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_194;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_195;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_196;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_197;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_198;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_199;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_200;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_201;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_202;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_203;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_204;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_205;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_206;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_207;

