iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_208;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_209;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_210;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_211;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_212;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_213;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_214;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_215;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_216;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_217;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_218;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_219;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_220;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_221;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_222;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_223;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_224;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_225;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_226;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_227;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_228;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_229;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_230;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_231;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_232;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_233;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_234;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_235;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_236;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_237;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_238;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_239;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_240;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_241;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_242;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_243;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_244;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_245;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_246;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_247;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_248;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_249;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_250;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_251;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_252;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_253;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_254;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:4;
      uint64_t RES19:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPRIORITY_255;

