iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_VIM_R5B (*(volatile struct MSS_VIM_R5B_tag *) 0x20a0000)

struct MSS_IOMUX_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAA_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAB_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAC_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAD_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAE_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAF_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAG_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAH_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAI_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAJ_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAK_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAL_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAM_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAN_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAO_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAP_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAQ_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAR_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAS_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAT_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAU_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAV_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAW_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAX_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAY_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADAZ_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBA_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBB_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBC_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBD_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBE_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBF_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBG_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBH_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBI_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBJ_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBK_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBL_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBM_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBN_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBO_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBP_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBQ_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBR_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBS_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBT_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBU_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBV_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBW_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBX_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBY_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADBZ_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCA_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCB_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCC_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCD_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCE_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCF_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCG_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCH_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCI_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCJ_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCK_cfg_reg;

