iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCL_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCM_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCN_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCO_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCP_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCQ_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCR_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCS_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCT_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCU_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCV_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCW_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCX_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCY_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADCZ_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDA_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDB_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDC_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDD_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDE_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDF_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDG_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDH_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDI_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDJ_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDK_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDL_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDM_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDN_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDO_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDP_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDQ_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDR_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDS_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDT_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDU_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDV_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDW_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDX_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDY_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADDZ_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEA_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEB_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEC_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADED_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEE_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEF_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEG_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEH_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEI_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEJ_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEK_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEL_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEM_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEN_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEO_cfg_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t func_sel:4;
      uint64_t ie_override_ctrl:1;
      uint64_t ie_override:1;
      uint64_t oe_override_ctrl:1;
      uint64_t oe_override:1;
      uint64_t pi:1;
      uint64_t pupdsel:1;
      uint64_t sc1:1;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADEP_cfg_reg;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERMODEEN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USERMODEEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADGLBLCFGREG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PADGLBLCFGREG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOCFGKICK0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFGKICK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOCFGKICK1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFGKICK1;

