iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_IOMUX (*(volatile struct MSS_IOMUX_tag *) 0x20c0000)

struct MSS_RCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clr:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RST_CAUSE_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cause:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RST_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t r5a:3;
      uint64_t reservedSpace0:13;
      uint64_t r5b:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSRST_BY_DBG_RST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t common:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RST_ASSERDLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t r5ssa:8;
      uint64_t r5ssb:8;
      uint64_t r5a:8;
      uint64_t r5b:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RST2ASSERTDLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t r5ssa:3;
      uint64_t reservedSpace0:5;
      uint64_t r5ssb:3;
      uint64_t reservedSpace1:5;
      uint64_t r5a:3;
      uint64_t reservedSpace2:5;
      uint64_t r5b:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RST_WFICHECK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCANA_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCANB_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIA_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIB_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIC_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_WDT_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIA_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIB_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_I2C_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCIA_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCIB_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CPTS_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CPSW_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCANA_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCANB_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIA_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIB_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIC_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_WDT_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIA_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIB_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_I2C_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCIA_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCIB_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CPTS_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CPSW_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RGMII_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MII100_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MII10_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCANA_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCANB_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIA_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIB_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIC_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_WDT_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIA_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIB_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_I2C_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCIA_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCIB_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CPTS_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CPSW_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RGMII_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MII100_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MII10_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCANA_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCANB_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIA_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIB_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIC_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_WDT_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIA_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIB_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_I2C_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCIA_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCIB_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CPTS_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CPSW_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RGMII_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MII100_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MII10_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5SS_POR_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5SSA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5SSB_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_VIMA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_VIMB_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CRC_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIB_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RTIC_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_WDT_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_ESM_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DCCA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DCCB_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DCCC_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DCCD_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GIO_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIB_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_PWM1_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_PWM2_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_PWM3_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCANA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCANB_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_I2C_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCIA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCIB_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
      uint64_t reservedSpace0:1;
      uint64_t tpcca_assert:3;
      uint64_t reservedSpace1:1;
      uint64_t tptca0_assert:3;
      uint64_t reservedSpace2:1;
      uint64_t tptca1_assert:3;
      uint64_t reservedSpace3:1;
      uint64_t tpccb_assert:3;
      uint64_t reservedSpace4:5;
      uint64_t tptcb0_assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_EDMA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_INFRA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CPSW_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkgate:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5_COREA_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkgate:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5_COREB_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_BANKA_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_BANKB_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_BANKA_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_BANKB_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREVIOUS_NAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG3;

  uint8_t res0[548];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_RTIA_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_WDT_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_RTC_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_DMTA_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_DMTB_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_RTI_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_WDT_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_RTC_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_DMTA_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdivr:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_DMTB_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_RTI_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_WDT_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_RTC_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_DMTA_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_DMTB_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_RTI_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_WDT_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_RTC_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_DMTA_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSM_DMTB_CLK_STATUS;

  uint8_t res1[2944];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW1;

