iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_wph:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_WPH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rec0:1;
      uint64_t hw_spare_rec1:1;
      uint64_t hw_spare_rec2:1;
      uint64_t hw_spare_rec3:1;
      uint64_t hw_spare_rec4:1;
      uint64_t hw_spare_rec5:1;
      uint64_t hw_spare_rec6:1;
      uint64_t hw_spare_rec7:1;
      uint64_t hw_spare_rec8:1;
      uint64_t hw_spare_rec9:1;
      uint64_t hw_spare_rec10:1;
      uint64_t hw_spare_rec11:1;
      uint64_t hw_spare_rec12:1;
      uint64_t hw_spare_rec13:1;
      uint64_t hw_spare_rec14:1;
      uint64_t hw_spare_rec15:1;
      uint64_t hw_spare_rec16:1;
      uint64_t hw_spare_rec17:1;
      uint64_t hw_spare_rec18:1;
      uint64_t hw_spare_rec19:1;
      uint64_t hw_spare_rec20:1;
      uint64_t hw_spare_rec21:1;
      uint64_t hw_spare_rec22:1;
      uint64_t hw_spare_rec23:1;
      uint64_t hw_spare_rec24:1;
      uint64_t hw_spare_rec25:1;
      uint64_t hw_spare_rec26:1;
      uint64_t hw_spare_rec27:1;
      uint64_t hw_spare_rec28:1;
      uint64_t hw_spare_rec29:1;
      uint64_t hw_spare_rec30:1;
      uint64_t hw_spare_rec31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REC;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_raw_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enabled_status_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eoi;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_type_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b19_8:12;
      uint64_t b31_20:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_attr_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_clear;

};

#define MSS_RCM (*(volatile struct MSS_RCM_tag *) 0x2100000)

struct MSS_CTRL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t pulse:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SW_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t src0:8;
      uint64_t src1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CAPEVNT_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t select:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMA_REQ_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t select:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMA1_REQ_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t select:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_IRQ_REQ_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t trig_spia:2;
      uint64_t reservedSpace0:14;
      uint64_t trig_spib:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPI_TRIG_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem_init:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_ATCM_MEM_INIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem_init_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_ATCM_MEM_INIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_ATCM_MEM_INIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem_init:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BTCM_MEM_INIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem_init_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BTCM_MEM_INIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BTCM_MEM_INIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t partition0:1;
      uint64_t partition1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_MEM_INIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t partition0:1;
      uint64_t partition1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_MEM_INIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t partition0:1;
      uint64_t partition1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_MEM_INIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_init:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MAILBOX_MEM_INIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MAIlBOX_MEM_INIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MAILBOX_MEM_INIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_init:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RETRAM_MEM_INIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RETRAM_MEM_INIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_RETRAM_MEM_INIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_init:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIA_MEM_INIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIA_MEM_INIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIA_MEM_INIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_init:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIB_MEM_INIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIB_MEM_INIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIB_MEM_INIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_meminit_start:1;
      uint64_t reservedSpace0:15;
      uint64_t tpcc_b_meminit_start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_MEMINIT_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_meminit_done:1;
      uint64_t reservedSpace0:15;
      uint64_t tpcc_b_meminit_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_meminit_status:1;
      uint64_t reservedSpace0:15;
      uint64_t tpcc_b_meminit_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_init:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_MEM_INIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_MEM_INIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_MEM_INIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t spiasync2sen:3;
      uint64_t reservedSpace0:5;
      uint64_t spia_cs_trigsrc_en:1;
      uint64_t reservedSpace1:7;
      uint64_t spia_trig_gate_en:1;
      uint64_t reservedSpace2:7;
      uint64_t spia_int_trig_polarity:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIA_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t spibsync2sen:3;
      uint64_t reservedSpace0:5;
      uint64_t spib_cs_trigsrc_en:1;
      uint64_t reservedSpace1:7;
      uint64_t spib_trig_gate_en:1;
      uint64_t reservedSpace2:7;
      uint64_t spib_int_trig_polarity:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SPIB_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t epwm_config:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_EPWM_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gio_config:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GIO_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mcana_fe_select:3;
      uint64_t reservedSpace0:13;
      uint64_t mcanb_fe_select:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCAN_FE_SELECT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mcan_int_clr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCANA_INT_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mcan_int_mask:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCANA_INT_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mcan_int_status:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MCANA_INT_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ccca_errot_status:8;
      uint64_t reservedSpace0:8;
      uint64_t cccb_errot_status:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCC_ERR_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ccca_clk0_sel:3;
      uint64_t ccca_clk1_sel:3;
      uint64_t ccca_disable_clocks:1;
      uint64_t ccca_enable_module:1;
      uint64_t ccca_single_shot_mode:1;
      uint64_t Reserved:7;
      uint64_t ccca_margin_count:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCA_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ccca_cfg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCA_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ccca_cfg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCA_CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ccca_cfg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCA_CFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ccca_cfg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCA_CNTVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCCB_clk0_sel:3;
      uint64_t CCCB_clk1_sel:3;
      uint64_t cccb_disable_clocks:1;
      uint64_t cccb_enable_module:1;
      uint64_t cccb_single_shot_mode:1;
      uint64_t Reserved:7;
      uint64_t cccb_margin_count:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCB_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cccb_cfg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCB_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cccb_cfg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCB_CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cccb_cfg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCB_CFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cccb_cfg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCB_CNTVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t enable_cccb_err_rstn:1;
      uint64_t reservedSpace1:3;
      uint64_t enable_cccb_err_nmi:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCC_DCC_COMMON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t teinit:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5_GLOBAL_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cpu0_ahb_init:3;
      uint64_t reservedSpace0:13;
      uint64_t cpu1_ahb_init:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5_AHB_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ahb_base:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5A_AHB_BASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ahb_size:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5A_AHB_SIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ahb_base:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5B_AHB_BASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ahb_size:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5B_AHB_SIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cpu0_tcm:3;
      uint64_t reservedSpace0:13;
      uint64_t cpu1_tcm:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5_TCM_EXT_ERR_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cpu0_tcm:3;
      uint64_t reservedSpace0:13;
      uint64_t cpu1_tcm:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5_TCM_ERR_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tcma_cpu0:3;
      uint64_t reservedSpace0:1;
      uint64_t tcmb_cpu0:3;
      uint64_t reservedSpace1:1;
      uint64_t lockzram_cpu0:3;
      uint64_t reservedSpace2:1;
      uint64_t tcma_cpu1:3;
      uint64_t reservedSpace3:1;
      uint64_t tcmb_cpu1:3;
      uint64_t reservedSpace4:1;
      uint64_t lockzram_cpu1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5_INIT_TCM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cpu0_tcma_wrenz_en:3;
      uint64_t reservedSpace0:1;
      uint64_t cpu0_tcmb0_wrenz_en:3;
      uint64_t reservedSpace1:1;
      uint64_t cpu0_tcmb1_wrenz_en:3;
      uint64_t reservedSpace2:1;
      uint64_t cpu1_tcma_wrenz_en:3;
      uint64_t reservedSpace3:1;
      uint64_t cpu1_tcmb0_wrenz_en:3;
      uint64_t reservedSpace4:1;
      uint64_t cpu1_tcmb1_wrenz_en:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5_TCM_ECC_WRENZ_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t esm_gating:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESM_GATING0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t esm_gating:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESM_GATING1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t esm_gating:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESM_GATING2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t esm_gating:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESM_GATING3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t esm_gating:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESM_GATING4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t esm_gating:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESM_GATING5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t esm_gating:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESM_GATING6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t esm_gating:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESM_GATING7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_PARITY_ATCM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_PARITY_ATCM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_PARITY_B0TCM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_PARITY_B0TCM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_PARITY_B1TCM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_PARITY_B1TCM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t atcm0_erraddr_clr:3;
      uint64_t reservedSpace0:1;
      uint64_t atcm1_erraddr_clr:3;
      uint64_t reservedSpace1:1;
      uint64_t b0tcm0_erraddr_clr:3;
      uint64_t reservedSpace2:1;
      uint64_t b0cm1_erraddr_clr:3;
      uint64_t reservedSpace3:1;
      uint64_t b1tcm0_erraddr_clr:3;
      uint64_t reservedSpace4:1;
      uint64_t b1tcm1_erraddr_clr:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCM_PARITY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t atcm0:3;
      uint64_t reservedSpace0:1;
      uint64_t atcm1:3;
      uint64_t reservedSpace1:1;
      uint64_t b0tcm0:3;
      uint64_t reservedSpace2:1;
      uint64_t b0tcm1:3;
      uint64_t reservedSpace3:1;
      uint64_t b1tcm0:3;
      uint64_t reservedSpace4:1;
      uint64_t b1tcm1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCM_PARITY_ERRFRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cs_deact:3;
      uint64_t reservedSpace0:5;
      uint64_t cs_pol:3;
      uint64_t reservedSpace1:5;
      uint64_t miso_oen_by_cs:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIA_IO_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cs_deact:3;
      uint64_t reservedSpace0:5;
      uint64_t cs_pol:3;
      uint64_t reservedSpace1:5;
      uint64_t miso_oen_by_cs:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIB_IO_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t host_irq:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_HOST_IRQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tptc_a0:2;
      uint64_t reservedSpace0:2;
      uint64_t tptc_a1:2;
      uint64_t reservedSpace1:2;
      uint64_t tptc_b0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPTC_DBS_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_parity_en:1;
      uint64_t reservedSpace0:3;
      uint64_t tpcc_a_parity_testen:1;
      uint64_t reservedSpace1:3;
      uint64_t tpcc_b_parity_en:1;
      uint64_t reservedSpace2:3;
      uint64_t tpcc_b_parity_testen:1;
      uint64_t reservedSpace3:3;
      uint64_t tpcc_a_parity_err_clr:1;
      uint64_t reservedSpace4:3;
      uint64_t tpcc_b_parity_err_clr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPCC_PARITY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_parity_addr:8;
      uint64_t reservedSpace0:8;
      uint64_t tpcc_b_parity_addr:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPCC_PARITY_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ccca:3;
      uint64_t reservedSpace0:1;
      uint64_t cccb:3;
      uint64_t reservedSpace1:1;
      uint64_t dcca:3;
      uint64_t reservedSpace2:1;
      uint64_t dccb:3;
      uint64_t reservedSpace3:1;
      uint64_t dccc:3;
      uint64_t reservedSpace4:1;
      uint64_t dccd:3;
      uint64_t reservedSpace5:1;
      uint64_t cpsw:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DBG_ACK_CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dcan:3;
      uint64_t reservedSpace0:1;
      uint64_t rti:3;
      uint64_t reservedSpace1:1;
      uint64_t wdt:3;
      uint64_t reservedSpace2:1;
      uint64_t mcrc:3;
      uint64_t reservedSpace3:1;
      uint64_t i2c:3;
      uint64_t reservedSpace4:1;
      uint64_t scia:3;
      uint64_t reservedSpace5:1;
      uint64_t scib:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DBG_ACK_CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t port1_mode_sel:3;
      uint64_t reservedSpace0:5;
      uint64_t rmii_ref_clk_oe_n:1;
      uint64_t reservedSpace1:7;
      uint64_t rgmii1_id_mode:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSW_CONTROL;

