iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_errint:1;
      uint64_t tpcc_a_mpint:1;
      uint64_t tptc_a0_err:1;
      uint64_t tptc_a1_err:1;
      uint64_t tpcc_a_par_err:1;
      uint64_t reservedSpace0:11;
      uint64_t tpcc_a_write_access_error:1;
      uint64_t tptc_a0_write_access_error:1;
      uint64_t tptc_a1_write_access_error:1;
      uint64_t reservedSpace1:5;
      uint64_t tpcc_a_read_access_error:1;
      uint64_t tptc_a0_read_access_error:1;
      uint64_t tptc_a1_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_A_ERRAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_errint:1;
      uint64_t tpcc_a_mpint:1;
      uint64_t tptc_a0_err:1;
      uint64_t tptc_a1_err:1;
      uint64_t tpcc_a_par_err:1;
      uint64_t reservedSpace0:11;
      uint64_t tpcc_a_write_access_error:1;
      uint64_t tptc_a0_write_access_error:1;
      uint64_t tptc_a1_write_access_error:1;
      uint64_t reservedSpace1:5;
      uint64_t tpcc_a_read_access_error:1;
      uint64_t tptc_a0_read_access_error:1;
      uint64_t tptc_a1_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_A_ERRAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_errint:1;
      uint64_t tpcc_a_mpint:1;
      uint64_t tptc_a0_err:1;
      uint64_t tptc_a1_err:1;
      uint64_t tpcc_a_par_err:1;
      uint64_t reservedSpace0:11;
      uint64_t tpcc_a_write_access_error:1;
      uint64_t tptc_a0_write_access_error:1;
      uint64_t tptc_a1_write_access_error:1;
      uint64_t reservedSpace1:5;
      uint64_t tpcc_a_read_access_error:1;
      uint64_t tptc_a0_read_access_error:1;
      uint64_t tptc_a1_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_A_ERRAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_intg:1;
      uint64_t tpcc_a_int0:1;
      uint64_t tpcc_a_int1:1;
      uint64_t tpcc_a_int2:1;
      uint64_t tpcc_a_int3:1;
      uint64_t tpcc_a_int4:1;
      uint64_t tpcc_a_int5:1;
      uint64_t tpcc_a_int6:1;
      uint64_t tpcc_a_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_a0:1;
      uint64_t tptc_a1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_A_INTAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_intg:1;
      uint64_t tpcc_a_int0:1;
      uint64_t tpcc_a_int1:1;
      uint64_t tpcc_a_int2:1;
      uint64_t tpcc_a_int3:1;
      uint64_t tpcc_a_int4:1;
      uint64_t tpcc_a_int5:1;
      uint64_t tpcc_a_int6:1;
      uint64_t tpcc_a_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_a0:1;
      uint64_t tptc_a1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_A_INTAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_intg:1;
      uint64_t tpcc_a_int0:1;
      uint64_t tpcc_a_int1:1;
      uint64_t tpcc_a_int2:1;
      uint64_t tpcc_a_int3:1;
      uint64_t tpcc_a_int4:1;
      uint64_t tpcc_a_int5:1;
      uint64_t tpcc_a_int6:1;
      uint64_t tpcc_a_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_a0:1;
      uint64_t tptc_a1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_A_INTAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_b_errint:1;
      uint64_t tpcc_b_mpint:1;
      uint64_t tptc_b0_err:1;
      uint64_t reservedSpace0:1;
      uint64_t tpcc_b_par_err:1;
      uint64_t reservedSpace1:11;
      uint64_t tpcc_b_write_access_error:1;
      uint64_t tptc_b0_write_access_error:1;
      uint64_t reservedSpace2:6;
      uint64_t tpcc_b_read_access_error:1;
      uint64_t tptc_b0_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_B_ERRAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_b_errint:1;
      uint64_t tpcc_b_mpint:1;
      uint64_t tptc_b0_err:1;
      uint64_t reservedSpace0:1;
      uint64_t tpcc_b_par_err:1;
      uint64_t reservedSpace1:11;
      uint64_t tpcc_b_write_access_error:1;
      uint64_t tptc_b0_write_access_error:1;
      uint64_t reservedSpace2:6;
      uint64_t tpcc_b_read_access_error:1;
      uint64_t tptc_b0_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_B_ERRAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_b_errint:1;
      uint64_t tpcc_b_mpint:1;
      uint64_t tptc_b0_err:1;
      uint64_t reservedSpace0:1;
      uint64_t tpcc_b_par_err:1;
      uint64_t reservedSpace1:11;
      uint64_t tpcc_b_write_access_error:1;
      uint64_t tptc_b0_write_access_error:1;
      uint64_t reservedSpace2:6;
      uint64_t tpcc_b_read_access_error:1;
      uint64_t tptc_b0_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_B_ERRAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_b_intg:1;
      uint64_t tpcc_b_int0:1;
      uint64_t tpcc_b_int1:1;
      uint64_t tpcc_b_int2:1;
      uint64_t tpcc_b_int3:1;
      uint64_t tpcc_b_int4:1;
      uint64_t tpcc_b_int5:1;
      uint64_t tpcc_b_int6:1;
      uint64_t tpcc_b_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_b0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_B_INTAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_b_intg:1;
      uint64_t tpcc_b_int0:1;
      uint64_t tpcc_b_int1:1;
      uint64_t tpcc_b_int2:1;
      uint64_t tpcc_b_int3:1;
      uint64_t tpcc_b_int4:1;
      uint64_t tpcc_b_int5:1;
      uint64_t tpcc_b_int6:1;
      uint64_t tpcc_b_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_b0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_B_INTAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_b_intg:1;
      uint64_t tpcc_b_int0:1;
      uint64_t tpcc_b_int1:1;
      uint64_t tpcc_b_int2:1;
      uint64_t tpcc_b_int3:1;
      uint64_t tpcc_b_int4:1;
      uint64_t tpcc_b_int5:1;
      uint64_t tpcc_b_int6:1;
      uint64_t tpcc_b_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_b0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPCC_B_INTAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_WR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_WR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_WR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_WR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_WR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_WR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_WR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_WR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_WR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_WR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_S_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_S_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_S_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_S_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_S_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_S_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_S_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AXI_S_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_S_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_S_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_S_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_S_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_S_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_S_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_S_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AXI_S_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A0_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A0_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A0_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A0_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A0_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A0_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A1_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A1_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A1_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A1_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A1_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A1_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_B0_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_B0_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_B0_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_B0_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_B0_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_B0_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A0_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A0_WR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A0_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A0_WR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A0_WR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A0_WR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A0_WR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A1_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A1_WR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A1_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_A1_WR_BUS_SAFETY_ERR_STAT_DATA0;

