iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAP_R232_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAP_R232_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAP_R232_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAP_R232_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_A_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_A_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_A_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_A_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_A_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_A_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_A_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_A_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_B_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_B_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_B_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_B_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_B_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_B_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_B_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_L2_B_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MBOX_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MBOX_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MBOX_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MBOX_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MBOX_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MBOX_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MBOX_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_MBOX_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SWBUF_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SWBUF_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SWBUF_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SWBUF_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SWBUF_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SWBUF_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SWBUF_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SWBUF_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_GPADC_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cr5a_rd:1;
      uint64_t cr5b_rd:1;
      uint64_t cr5a_wr:1;
      uint64_t cr5b_wr:1;
      uint64_t cr5a_slv:1;
      uint64_t cr5b_slv:1;
      uint64_t dap_rs232:1;
      uint64_t hsm:1;
      uint64_t cpsw:1;
      uint64_t mss_tptc_A0_rd:1;
      uint64_t mss_tptc_A1_rd:1;
      uint64_t mss_tptc_B1_rd:1;
      uint64_t mss_tptc_A0_wr:1;
      uint64_t mss_tptc_A1_wr:1;
      uint64_t mss_tptc_B1_wr:1;
      uint64_t hsm_tptc_A0_rd:1;
      uint64_t hsm_tptc_A0_wr:1;
      uint64_t hsm_tptc_A1_rd:1;
      uint64_t hsm_tptc_A1_wr:1;
      uint64_t qspi:1;
      uint64_t mcrc:1;
      uint64_t per_pcr:1;
      uint64_t per_pcr2:1;
      uint64_t hsm_s:1;
      uint64_t dthe:1;
      uint64_t l2ram0:1;
      uint64_t l2ram1:1;
      uint64_t mss_mbox:1;
      uint64_t mss_swbuf:1;
      uint64_t gpadc:1;
      uint64_t mss_dmm:1;
      uint64_t mss_dmmslv:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BUS_SAFETY_SEC_ERR_STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t mss_to_mdo:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BUS_SAFETY_SEC_ERR_STAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREVIOUS_NAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_SLV_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_SLV_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_SLV_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_SLV_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_SLV_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_SLV_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_SLV_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_SLV_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TO_MDO_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TO_MDO_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TO_MDO_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TO_MDO_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TO_MDO_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TO_MDO_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TO_MDO_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TO_MDO_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCRP_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCRP_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCRP_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCRP_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCRP_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCRP_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCRP_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_SCRP_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AHB_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AHB_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AHB_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AHB_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AHB_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AHB_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AHB_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_AHB_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AHB_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AHB_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AHB_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AHB_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AHB_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AHB_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AHB_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_AHB_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmm_pad_select:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMM_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t proc_0:1;
      uint64_t reservedSpace0:3;
      uint64_t proc_1:1;
      uint64_t reservedSpace1:3;
      uint64_t proc_2:1;
      uint64_t reservedSpace2:3;
      uint64_t proc_3:1;
      uint64_t reservedSpace3:3;
      uint64_t proc_4:1;
      uint64_t reservedSpace4:3;
      uint64_t proc_5:1;
      uint64_t reservedSpace5:3;
      uint64_t proc_6:1;
      uint64_t reservedSpace6:3;
      uint64_t proc_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_MBOX_WRITE_DONE;

