iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t proc_0:1;
      uint64_t reservedSpace0:3;
      uint64_t proc_1:1;
      uint64_t reservedSpace1:3;
      uint64_t proc_2:1;
      uint64_t reservedSpace2:3;
      uint64_t proc_3:1;
      uint64_t reservedSpace3:3;
      uint64_t proc_4:1;
      uint64_t reservedSpace4:3;
      uint64_t proc_5:1;
      uint64_t reservedSpace5:3;
      uint64_t proc_6:1;
      uint64_t reservedSpace6:3;
      uint64_t proc_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_MBOX_READ_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t proc_0:1;
      uint64_t reservedSpace0:3;
      uint64_t proc_1:1;
      uint64_t reservedSpace1:3;
      uint64_t proc_2:1;
      uint64_t reservedSpace2:3;
      uint64_t proc_3:1;
      uint64_t reservedSpace3:3;
      uint64_t proc_4:1;
      uint64_t reservedSpace4:3;
      uint64_t proc_5:1;
      uint64_t reservedSpace5:3;
      uint64_t proc_6:1;
      uint64_t reservedSpace6:3;
      uint64_t proc_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5A_MBOX_READ_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t proc_0:1;
      uint64_t reservedSpace0:3;
      uint64_t proc_1:1;
      uint64_t reservedSpace1:3;
      uint64_t proc_2:1;
      uint64_t reservedSpace2:3;
      uint64_t proc_3:1;
      uint64_t reservedSpace3:3;
      uint64_t proc_4:1;
      uint64_t reservedSpace4:3;
      uint64_t proc_5:1;
      uint64_t reservedSpace5:3;
      uint64_t proc_6:1;
      uint64_t reservedSpace6:3;
      uint64_t proc_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_MBOX_WRITE_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t proc_0:1;
      uint64_t reservedSpace0:3;
      uint64_t proc_1:1;
      uint64_t reservedSpace1:3;
      uint64_t proc_2:1;
      uint64_t reservedSpace2:3;
      uint64_t proc_3:1;
      uint64_t reservedSpace3:3;
      uint64_t proc_4:1;
      uint64_t reservedSpace4:3;
      uint64_t proc_5:1;
      uint64_t reservedSpace5:3;
      uint64_t proc_6:1;
      uint64_t reservedSpace6:3;
      uint64_t proc_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_MBOX_READ_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t proc_0:1;
      uint64_t reservedSpace0:3;
      uint64_t proc_1:1;
      uint64_t reservedSpace1:3;
      uint64_t proc_2:1;
      uint64_t reservedSpace2:3;
      uint64_t proc_3:1;
      uint64_t reservedSpace3:3;
      uint64_t proc_4:1;
      uint64_t reservedSpace4:3;
      uint64_t proc_5:1;
      uint64_t reservedSpace5:3;
      uint64_t proc_6:1;
      uint64_t reservedSpace6:3;
      uint64_t proc_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5B_MBOX_READ_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t pbist_st_key:4;
      uint64_t pbist_st_rst:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_PBIST_KEY_RST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t pbist_reg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_PBIST_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t pbist_reg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_PBIST_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t pbist_reg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_PBIST_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ext_clk:3;
      uint64_t reservedSpace0:5;
      uint64_t clk_loopback:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cr5_wfi_overide:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_STC_CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t trig8_sel:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CTI_TRIG_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t trig1:8;
      uint64_t trig2:8;
      uint64_t trig3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DBGSS_CTI_TRIG_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t config:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BOOT_INFO_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t config:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BOOT_INFO_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t config:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BOOT_INFO_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t config:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BOOT_INFO_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t config:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BOOT_INFO_REG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t config:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BOOT_INFO_REG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t config:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BOOT_INFO_REG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t config:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_BOOT_INFO_REG7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tptc_A0:1;
      uint64_t tptc_A1:1;
      uint64_t tptc_B0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_ECCAGGR_CLK_CNTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mss_ctrl_rd:1;
      uint64_t mss_ctrl_wr:1;
      uint64_t mss_rcm_rd:1;
      uint64_t mss_rcm_wr:1;
      uint64_t top_ctrl_rd:1;
      uint64_t top_ctrl_wr:1;
      uint64_t top_rcm_rd:1;
      uint64_t top_rcm_wr:1;
      uint64_t top_aurora_rd:1;
      uint64_t top_aurora_wr:1;
      uint64_t hsm_soc_ctrl_rd:1;
      uint64_t hsm_soc_ctrl_wr:1;
      uint64_t hsm_ctrl_rd:1;
      uint64_t hsm_ctrl_wr:1;
      uint64_t dss_ctrl_rd:1;
      uint64_t dss_ctrl_wr:1;
      uint64_t dss_rcm_rd:1;
      uint64_t dss_rcm_wr:1;
      uint64_t dss_cm4_ctrl_rd:1;
      uint64_t dss_cm4_ctrl_wr:1;
      uint64_t hwa_cfg_rd:1;
      uint64_t hwa_cfg_wr:1;
      uint64_t rcss_ctrl_rd:1;
      uint64_t rcss_ctrl_wr:1;
      uint64_t rcss_rcm_rd:1;
      uint64_t rcss_rcm_wr:1;
      uint64_t top_mdo_rd:1;
      uint64_t top_mdo_wr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_PERIPH_ERRAGG_MASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mss_ctrl_rd:1;
      uint64_t mss_ctrl_wr:1;
      uint64_t mss_rcm_rd:1;
      uint64_t mss_rcm_wr:1;
      uint64_t top_ctrl_rd:1;
      uint64_t top_ctrl_wr:1;
      uint64_t top_rcm_rd:1;
      uint64_t top_rcm_wr:1;
      uint64_t top_aurora_rd:1;
      uint64_t top_aurora_wr:1;
      uint64_t hsm_soc_ctrl_rd:1;
      uint64_t hsm_soc_ctrl_wr:1;
      uint64_t hsm_ctrl_rd:1;
      uint64_t hsm_ctrl_wr:1;
      uint64_t dss_ctrl_rd:1;
      uint64_t dss_ctrl_wr:1;
      uint64_t dss_rcm_rd:1;
      uint64_t dss_rcm_wr:1;
      uint64_t dss_cm4_ctrl_rd:1;
      uint64_t dss_cm4_ctrl_wr:1;
      uint64_t hwa_cfg_rd:1;
      uint64_t hwa_cfg_wr:1;
      uint64_t rcss_ctrl_rd:1;
      uint64_t rcss_ctrl_wr:1;
      uint64_t rcss_rcm_rd:1;
      uint64_t rcss_rcm_wr:1;
      uint64_t top_mdo_rd:1;
      uint64_t top_mdo_wr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_PERIPH_ERRAGG_STATUS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mss_ctrl_rd:1;
      uint64_t mss_ctrl_wr:1;
      uint64_t mss_rcm_rd:1;
      uint64_t mss_rcm_wr:1;
      uint64_t top_ctrl_rd:1;
      uint64_t top_ctrl_wr:1;
      uint64_t top_rcm_rd:1;
      uint64_t top_rcm_wr:1;
      uint64_t top_aurora_rd:1;
      uint64_t top_aurora_wr:1;
      uint64_t hsm_soc_ctrl_rd:1;
      uint64_t hsm_soc_ctrl_wr:1;
      uint64_t hsm_ctrl_rd:1;
      uint64_t hsm_ctrl_wr:1;
      uint64_t dss_ctrl_rd:1;
      uint64_t dss_ctrl_wr:1;
      uint64_t dss_rcm_rd:1;
      uint64_t dss_rcm_wr:1;
      uint64_t dss_cm4_ctrl_rd:1;
      uint64_t dss_cm4_ctrl_wr:1;
      uint64_t hwa_cfg_rd:1;
      uint64_t hwa_cfg_wr:1;
      uint64_t rcss_ctrl_rd:1;
      uint64_t rcss_ctrl_wr:1;
      uint64_t rcss_rcm_rd:1;
      uint64_t rcss_rcm_wr:1;
      uint64_t top_mdo_rd:1;
      uint64_t top_mdo_wr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_PERIPH_ERRAGG_STATUS_RAW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mpu_rd_mss_l2_banka:1;
      uint64_t mpu_rd_mss_l2_bankb:1;
      uint64_t mpu_rd_hsm_dthe:1;
      uint64_t mpu_rd_mss_mbox:1;
      uint64_t mpu_rd_mss_pcra:1;
      uint64_t mpu_rd_mss_qspi:1;
      uint64_t mpu_rd_mss_cr5a_axis:1;
      uint64_t mpu_rd_mss_cr5b_axis:1;
      uint64_t mpu_rd_dss_l3_banka:1;
      uint64_t mpu_rd_dss_l3_bankb:1;
      uint64_t mpu_rd_dss_l3_bankc:1;
      uint64_t mpu_rd_dss_l3_bankd:1;
      uint64_t mpu_rd_dss_hwa_dma0:1;
      uint64_t mpu_rd_dss_hwa_dma1:1;
      uint64_t mpu_rd_dss_hwa_proc:1;
      uint64_t mpu_rd_dss_mbox:1;
      uint64_t mpu_rd_hsm:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_PERIPH_ERRAGG_MASK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mpu_rd_mss_l2_banka:1;
      uint64_t mpu_rd_mss_l2_bankb:1;
      uint64_t mpu_rd_hsm_dthe:1;
      uint64_t mpu_rd_mss_mbox:1;
      uint64_t mpu_rd_mss_pcra:1;
      uint64_t mpu_rd_mss_qspi:1;
      uint64_t mpu_rd_mss_cr5a_axis:1;
      uint64_t mpu_rd_mss_cr5b_axis:1;
      uint64_t mpu_rd_dss_l3_banka:1;
      uint64_t mpu_rd_dss_l3_bankb:1;
      uint64_t mpu_rd_dss_l3_bankc:1;
      uint64_t mpu_rd_dss_l3_bankd:1;
      uint64_t mpu_rd_dss_hwa_dma0:1;
      uint64_t mpu_rd_dss_hwa_dma1:1;
      uint64_t mpu_rd_dss_hwa_proc:1;
      uint64_t mpu_rd_dss_mbox:1;
      uint64_t mpu_rd_hsm:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_PERIPH_ERRAGG_STATUS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mpu_rd_mss_l2_banka:1;
      uint64_t mpu_rd_mss_l2_bankb:1;
      uint64_t mpu_rd_hsm_dthe:1;
      uint64_t mpu_rd_mss_mbox:1;
      uint64_t mpu_rd_mss_pcra:1;
      uint64_t mpu_rd_mss_qspi:1;
      uint64_t mpu_rd_mss_cr5a_axis:1;
      uint64_t mpu_rd_mss_cr5b_axis:1;
      uint64_t mpu_rd_dss_l3_banka:1;
      uint64_t mpu_rd_dss_l3_bankb:1;
      uint64_t mpu_rd_dss_l3_bankc:1;
      uint64_t mpu_rd_dss_l3_bankd:1;
      uint64_t mpu_rd_dss_hwa_dma0:1;
      uint64_t mpu_rd_dss_hwa_dma1:1;
      uint64_t mpu_rd_dss_hwa_proc:1;
      uint64_t mpu_rd_dss_mbox:1;
      uint64_t mpu_rd_hsm:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_PERIPH_ERRAGG_STATUS_RAW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig0:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel0:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig1:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel1:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig2:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel2:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig3:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig4:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel4:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig5:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel5:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig6:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel6:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig7:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig8:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel8:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig9:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel9:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig10:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel10:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig11:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig12:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel12:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig13:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel13:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig14:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel14:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig15:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig16:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel16:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig17:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel17:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig18:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel18:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig19:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig20:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel20:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig21:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel21:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig22:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel22:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig23:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT5_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig24:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel24:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig25:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel25:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig26:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel26:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig27:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT6_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig28:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel28:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig29:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel29:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig30:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel30:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig31:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT7_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig32:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel32:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig33:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel33:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig34:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel34:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig35:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel35:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT8_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig36:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel36:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig37:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel37:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig38:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel38:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig39:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel39:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT9_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig40:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel40:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig41:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel41:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig42:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel42:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig43:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel43:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT10_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig44:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel44:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig45:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel45:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig46:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel46:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig47:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel47:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT11_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig48:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel48:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig49:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel49:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig50:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel50:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig51:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel51:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT12_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig52:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel52:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig53:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel53:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig54:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel54:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig55:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel55:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT13_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig56:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel56:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig57:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel57:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig58:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel58:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig59:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel59:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT14_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_trig60:1;
      uint64_t reservedSpace0:3;
      uint64_t event_sel60:1;
      uint64_t reservedSpace1:3;
      uint64_t event_trig61:1;
      uint64_t reservedSpace2:3;
      uint64_t event_sel61:1;
      uint64_t reservedSpace3:3;
      uint64_t event_trig62:1;
      uint64_t reservedSpace4:3;
      uint64_t event_sel62:1;
      uint64_t reservedSpace5:3;
      uint64_t event_trig63:1;
      uint64_t reservedSpace6:3;
      uint64_t event_sel63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_DMM_EVENT15_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tptc_a0_size:6;
      uint64_t reservedSpace0:2;
      uint64_t tptc_a1_size:6;
      uint64_t reservedSpace1:2;
      uint64_t tptc_b0_size:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_BOUNDARY_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tptc_a0_disable:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_a1_disable:1;
      uint64_t reservedSpace1:7;
      uint64_t tptc_b0_disable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_TPTC_XID_REORDER_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpadc_sw_trig:1;
      uint64_t reservedSpace0:7;
      uint64_t gpadc_trigin_sel:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPADC_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fe1_sel:1;
      uint64_t reservedSpace0:7;
      uint64_t fe2_sel:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_Sync_FE_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSETB_FLUSHIN:1;
      uint64_t reservedSpace0:7;
      uint64_t CSETB_FLUSHINACK:1;
      uint64_t CSETB_ACQ_COMPLETE:1;
      uint64_t CSETB_FULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUGSS_CSETB_FLUSH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t inv_ctrl:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANALOG_WU_STATUS_REG_POLARITY_INV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t inv_ctrl:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANALOG_CLK_STATUS_REG_POLARITY_INV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mask:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANALOG_WU_STATUS_REG_GRP1_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mask:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANALOG_CLK_STATUS_REG_GRP1_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mask:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANALOG_WU_STATUS_REG_GRP2_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mask:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANALOG_CLK_STATUS_REG_GRP2_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mask:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NERROR_MASK;

  uint8_t res0[288];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t lock_step:3;
      uint64_t reservedSpace0:5;
      uint64_t lock_step_switch_wait:3;
      uint64_t reservedSpace1:5;
      uint64_t reset_fsm_trigger:3;
      uint64_t reservedSpace2:5;
      uint64_t rom_wait_state:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5_CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t memswap:3;
      uint64_t reservedSpace0:5;
      uint64_t memswap_wait:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5_ROM_ECLIPSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t halt:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5_COREA_HALT;

