iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t halt:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5_COREB_HALT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t memswap:1;
      uint64_t reservedSpace0:7;
      uint64_t lock_step:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5_STATUS_REG;

  uint8_t res1[1980];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_wph:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_WPH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rec0:1;
      uint64_t hw_spare_rec1:1;
      uint64_t hw_spare_rec2:1;
      uint64_t hw_spare_rec3:1;
      uint64_t hw_spare_rec4:1;
      uint64_t hw_spare_rec5:1;
      uint64_t hw_spare_rec6:1;
      uint64_t hw_spare_rec7:1;
      uint64_t hw_spare_rec8:1;
      uint64_t hw_spare_rec9:1;
      uint64_t hw_spare_rec10:1;
      uint64_t hw_spare_rec11:1;
      uint64_t hw_spare_rec12:1;
      uint64_t hw_spare_rec13:1;
      uint64_t hw_spare_rec14:1;
      uint64_t hw_spare_rec15:1;
      uint64_t hw_spare_rec16:1;
      uint64_t hw_spare_rec17:1;
      uint64_t hw_spare_rec18:1;
      uint64_t hw_spare_rec19:1;
      uint64_t hw_spare_rec20:1;
      uint64_t hw_spare_rec21:1;
      uint64_t hw_spare_rec22:1;
      uint64_t hw_spare_rec23:1;
      uint64_t hw_spare_rec24:1;
      uint64_t hw_spare_rec25:1;
      uint64_t hw_spare_rec26:1;
      uint64_t hw_spare_rec27:1;
      uint64_t hw_spare_rec28:1;
      uint64_t hw_spare_rec29:1;
      uint64_t hw_spare_rec30:1;
      uint64_t hw_spare_rec31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REC;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_raw_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enabled_status_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eoi;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_type_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b19_8:12;
      uint64_t b31_20:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_attr_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_clear;

};

#define MSS_CTRL (*(volatile struct MSS_CTRL_tag *) 0x2120000)

struct MSS_TOPRCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREVIOUS_NAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSI_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSIRX_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUCLKOUT_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMICCLKOUT_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OBSCLKOUT_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRCCLKOUT_CLK_SRC_SEL;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSI_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSIRX_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUCLKOUT_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMICCLKOUT_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OBSCLKOUT_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRCCLKOUT_DIV_VAL;

  uint8_t res1[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSI_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSIRX_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUCLKOUT_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMICCLKOUT_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OBSCLKOUT_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRCCLKOUT_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CLK_GATE;

  uint8_t res2[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSI_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSIRX_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUCLKOUT_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMICCLKOUT_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OBSCLKOUT_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRCCLKOUT_CLK_STATUS;

  uint8_t res3[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t pad_bypass:3;
      uint64_t reservedSpace0:5;
      uint64_t sw_rst:3;
      uint64_t reservedSpace1:5;
      uint64_t wdog_rst_en:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WARM_RESET_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cause:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RST_CAUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clear:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RST_CAUSE_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_RST_CTRL;

  uint8_t res4[244];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bitinterval:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RS232_BITINTERVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ctrl:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LVDS_PAD_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ctlr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LVDS_PAD_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFT_DMLED_EXEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFT_DMLED_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dcca_en:3;
      uint64_t reservedSpace0:1;
      uint64_t ccca_en:3;
      uint64_t reservedSpace1:1;
      uint64_t force_rcclk_en:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIMP_MODE_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dcdc_clk_en:1;
      uint64_t dither_en:1;
      uint64_t freq_acc_mode:1;
      uint64_t reservedSpace0:1;
      uint64_t reset_assert:3;
      uint64_t reservedSpace1:1;
      uint64_t min_freq_thr:8;
      uint64_t max_freq_thr:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMICCLKOUT_DCDC_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t slope_val:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMICCLKOUT_DCDC_SLOPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stoposc:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCOSC32K_CTRL;

  uint8_t res5[472];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFMODE:1;
      uint64_t ISOSCAN:1;
      uint64_t ISORET:1;
      uint64_t RET:1;
      uint64_t PGOODIN:1;
      uint64_t PONIN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_PWRCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TINTZ:1;
      uint64_t SSCTYPE:1;
      uint64_t reservedSpace0:6;
      uint64_t RELAXED_LOCK:1;
      uint64_t reservedSpace1:1;
      uint64_t SELFREQDCO:3;
      uint64_t reservedSpace2:1;
      uint64_t STOPMODE:1;
      uint64_t reservedSpace3:1;
      uint64_t M2PWDNZ:1;
      uint64_t CLKDCOLDOPWDNZ:1;
      uint64_t ULOWCLKEN:1;
      uint64_t CLKOUTLDOEN:1;
      uint64_t CLKOUTEN:1;
      uint64_t STBYRET:1;
      uint64_t BYPASSACKZ:1;
      uint64_t IDLE:1;
      uint64_t NWELLTRIM:5;
      uint64_t CLKDCOLDOEN:1;
      uint64_t ENSSC:1;
      uint64_t CYCLESLIPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_CLKCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_TENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENABLEDIV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_TENABLEDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t N:8;
      uint64_t reservedSpace0:8;
      uint64_t M2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_M2NDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M:12;
      uint64_t reservedSpace0:4;
      uint64_t N2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_MN2DIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRACTIONALM:18;
      uint64_t reservedSpace0:6;
      uint64_t REGSD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_FRACDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BW_INCR_DECRZ:1;
      uint64_t BWCONTROL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_BWCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DeltaMStepFraction:18;
      uint64_t DeltaMStepInteger:3;
      uint64_t ModFreqDividerMantissa:7;
      uint64_t ModFreqDividerExponent:3;
      uint64_t DOWNSPREAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_FRACCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t HIGHJITTER:1;
      uint64_t SSCACK:1;
      uint64_t M2CHANGEACK:1;
      uint64_t LOCK2:1;
      uint64_t CLKOUTENACK:1;
      uint64_t LOSSREF:1;
      uint64_t STBYRETACK:1;
      uint64_t BYPASSACK:1;
      uint64_t FREQLOCK:1;
      uint64_t PHASELOCK:1;
      uint64_t CLKDCOLDOACK:1;
      uint64_t reservedSpace0:15;
      uint64_t RECAL_OPPIN:1;
      uint64_t RECAL_BSTATUS3:1;
      uint64_t LDOPWDN:1;
      uint64_t PGOODOUT:1;
      uint64_t PONOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t LDOPWDN:1;
      uint64_t TENABLEDIV:1;
      uint64_t reservedSpace0:13;
      uint64_t BYPASSACKZ:1;
      uint64_t LDOPWDNACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_HSDIVIDER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:5;
      uint64_t DIVCHACK:1;
      uint64_t reservedSpace0:2;
      uint64_t GATE_CTRL:1;
      uint64_t STATUS:1;
      uint64_t reservedSpace1:2;
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_HSDIVIDER_CLKOUT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:5;
      uint64_t DIVCHACK:1;
      uint64_t reservedSpace0:2;
      uint64_t GATE_CTRL:1;
      uint64_t STATUS:1;
      uint64_t reservedSpace1:2;
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_HSDIVIDER_CLKOUT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:5;
      uint64_t DIVCHACK:1;
      uint64_t reservedSpace0:2;
      uint64_t GATE_CTRL:1;
      uint64_t STATUS:1;
      uint64_t reservedSpace1:2;
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_HSDIVIDER_CLKOUT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:5;
      uint64_t DIVCHACK:1;
      uint64_t reservedSpace0:2;
      uint64_t GATE_CTRL:1;
      uint64_t STATUS:1;
      uint64_t reservedSpace1:2;
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_HSDIVIDER_CLKOUT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_CR5_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_RSTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CORE_HSDIVIDER_RSTCTRL;

  uint8_t res6[928];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFMODE:1;
      uint64_t ISOSCAN:1;
      uint64_t ISORET:1;
      uint64_t RET:1;
      uint64_t PGOODIN:1;
      uint64_t PONIN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_PWRCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TINTZ:1;
      uint64_t SSCTYPE:1;
      uint64_t reservedSpace0:6;
      uint64_t RELAXED_LOCK:1;
      uint64_t reservedSpace1:1;
      uint64_t SELFREQDCO:3;
      uint64_t reservedSpace2:1;
      uint64_t STOPMODE:1;
      uint64_t reservedSpace3:1;
      uint64_t M2PWDNZ:1;
      uint64_t CLKDCOLDOPWDNZ:1;
      uint64_t ULOWCLKEN:1;
      uint64_t CLKOUTLDOEN:1;
      uint64_t CLKOUTEN:1;
      uint64_t STBYRET:1;
      uint64_t BYPASSACKZ:1;
      uint64_t IDLE:1;
      uint64_t NWELLTRIM:5;
      uint64_t CLKDCOLDOEN:1;
      uint64_t ENSSC:1;
      uint64_t CYCLESLIPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_CLKCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_TENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENABLEDIV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_TENABLEDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t N:8;
      uint64_t reservedSpace0:8;
      uint64_t M2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_M2NDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M:12;
      uint64_t reservedSpace0:4;
      uint64_t N2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_MN2DIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRACTIONALM:18;
      uint64_t reservedSpace0:6;
      uint64_t REGSD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_FRACDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BW_INCR_DECRZ:1;
      uint64_t BWCONTROL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_BWCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DeltaMStepFraction:18;
      uint64_t DeltaMStepInteger:3;
      uint64_t ModFreqDividerMantissa:7;
      uint64_t ModFreqDividerExponent:3;
      uint64_t DOWNSPREAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_FRACCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t HIGHJITTER:1;
      uint64_t SSCACK:1;
      uint64_t M2CHANGEACK:1;
      uint64_t LOCK2:1;
      uint64_t CLKOUTENACK:1;
      uint64_t LOSSREF:1;
      uint64_t STBYRETACK:1;
      uint64_t BYPASSACK:1;
      uint64_t FREQLOCK:1;
      uint64_t PHASELOCK:1;
      uint64_t CLKDCOLDOACK:1;
      uint64_t reservedSpace0:15;
      uint64_t RECAL_OPPIN:1;
      uint64_t RECAL_BSTATUS3:1;
      uint64_t LDOPWDN:1;
      uint64_t PGOODOUT:1;
      uint64_t PONOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t LDOPWDN:1;
      uint64_t TENABLEDIV:1;
      uint64_t reservedSpace0:13;
      uint64_t BYPASSACKZ:1;
      uint64_t LDOPWDNACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_HSDIVIDER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:5;
      uint64_t DIVCHACK:1;
      uint64_t reservedSpace0:2;
      uint64_t GATE_CTRL:1;
      uint64_t STATUS:1;
      uint64_t reservedSpace1:2;
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_HSDIVIDER_CLKOUT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:5;
      uint64_t DIVCHACK:1;
      uint64_t reservedSpace0:2;
      uint64_t GATE_CTRL:1;
      uint64_t STATUS:1;
      uint64_t reservedSpace1:2;
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_HSDIVIDER_CLKOUT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:5;
      uint64_t DIVCHACK:1;
      uint64_t reservedSpace0:2;
      uint64_t GATE_CTRL:1;
      uint64_t STATUS:1;
      uint64_t reservedSpace1:2;
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_HSDIVIDER_CLKOUT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:5;
      uint64_t DIVCHACK:1;
      uint64_t reservedSpace0:2;
      uint64_t GATE_CTRL:1;
      uint64_t STATUS:1;
      uint64_t reservedSpace1:2;
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_HSDIVIDER_CLKOUT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFMODE:1;
      uint64_t ISOSCAN:1;
      uint64_t ISORET:1;
      uint64_t RET:1;
      uint64_t PGOODIN:1;
      uint64_t PONIN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_PWRCTRL;

