iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TINTZ:1;
      uint64_t SSCTYPE:1;
      uint64_t reservedSpace0:6;
      uint64_t RELAXED_LOCK:1;
      uint64_t reservedSpace1:1;
      uint64_t SELFREQDCO:3;
      uint64_t reservedSpace2:1;
      uint64_t STOPMODE:1;
      uint64_t reservedSpace3:1;
      uint64_t M2PWDNZ:1;
      uint64_t CLKDCOLDOPWDNZ:1;
      uint64_t ULOWCLKEN:1;
      uint64_t CLKOUTLDOEN:1;
      uint64_t CLKOUTEN:1;
      uint64_t STBYRET:1;
      uint64_t BYPASSACKZ:1;
      uint64_t IDLE:1;
      uint64_t NWELLTRIM:5;
      uint64_t CLKDCOLDOEN:1;
      uint64_t ENSSC:1;
      uint64_t CYCLESLIPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_CLKCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_TENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENABLEDIV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_TENABLEDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t N:8;
      uint64_t reservedSpace0:8;
      uint64_t M2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_M2NDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M:12;
      uint64_t reservedSpace0:4;
      uint64_t N2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_MN2DIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRACTIONALM:18;
      uint64_t reservedSpace0:6;
      uint64_t REGSD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_FRACDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BW_INCR_DECRZ:1;
      uint64_t BWCONTROL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_BWCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DeltaMStepFraction:18;
      uint64_t DeltaMStepInteger:3;
      uint64_t ModFreqDividerMantissa:7;
      uint64_t ModFreqDividerExponent:3;
      uint64_t DOWNSPREAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_FRACCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t HIGHJITTER:1;
      uint64_t SSCACK:1;
      uint64_t M2CHANGEACK:1;
      uint64_t LOCK2:1;
      uint64_t CLKOUTENACK:1;
      uint64_t LOSSREF:1;
      uint64_t STBYRETACK:1;
      uint64_t BYPASSACK:1;
      uint64_t FREQLOCK:1;
      uint64_t PHASELOCK:1;
      uint64_t CLKDCOLDOACK:1;
      uint64_t reservedSpace0:15;
      uint64_t RECAL_OPPIN:1;
      uint64_t RECAL_BSTATUS3:1;
      uint64_t LDOPWDN:1;
      uint64_t PGOODOUT:1;
      uint64_t PONOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t LDOPWDN:1;
      uint64_t TENABLEDIV:1;
      uint64_t reservedSpace0:13;
      uint64_t BYPASSACKZ:1;
      uint64_t LDOPWDNACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_HSDIVIDER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:5;
      uint64_t DIVCHACK:1;
      uint64_t reservedSpace0:2;
      uint64_t GATE_CTRL:1;
      uint64_t STATUS:1;
      uint64_t reservedSpace1:2;
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_HSDIVIDER_CLKOUT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:5;
      uint64_t DIVCHACK:1;
      uint64_t reservedSpace0:2;
      uint64_t GATE_CTRL:1;
      uint64_t STATUS:1;
      uint64_t reservedSpace1:2;
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_HSDIVIDER_CLKOUT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:5;
      uint64_t DIVCHACK:1;
      uint64_t reservedSpace0:2;
      uint64_t GATE_CTRL:1;
      uint64_t STATUS:1;
      uint64_t reservedSpace1:2;
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_HSDIVIDER_CLKOUT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:5;
      uint64_t DIVCHACK:1;
      uint64_t reservedSpace0:2;
      uint64_t GATE_CTRL:1;
      uint64_t STATUS:1;
      uint64_t reservedSpace1:2;
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_HSDIVIDER_CLKOUT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_RSTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_DSP_HSDIVIDER_RSTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_RSTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_PER_HSDIVIDER_RSTCTRL;

  uint8_t res7[888];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTRIM_BIAS_XO_SLICER:4;
      uint64_t XOSC_DRIVE_XO_SLICER:5;
      uint64_t FASTCHARGEZ_BIAS_XO_SLICER:1;
      uint64_t SLICER_HIPWR_XO_SLICER:1;
      uint64_t SLICER_DCCPL_XO_SLICER:1;
      uint64_t XTAL_DETECT_XO_SLICER:1;
      uint64_t RESERVED0:11;
      uint64_t OSC_CLKOUT_DRV:4;
      uint64_t OSC_CLKOUT_CLRZ_DIV:1;
      uint64_t OSC_CLKOUT_FREQ_SEL:2;
      uint64_t OSC_CLKOUT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_CLK_CTRL_REG1_XO_SLICER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE_BIAS_XO_SLICER:1;
      uint64_t ENABLE_SLICER_CLKP:1;
      uint64_t ENABLE_XOSC:1;
      uint64_t RESERVED0:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_CLK_CTRL_REG1_CLKTOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED0:31;
      uint64_t CTRL_DC_BIST_BUFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_CLK_CTRL_REG2_CLKTOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN_SLICER_LDO:1;
      uint64_t RESERVED0:6;
      uint64_t CLK_BIST_DISABLE_LDO:1;
      uint64_t RESERVED1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_CLK_CTRL_REG1_LDO_CLKTOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDO_VOUT_CTRL:4;
      uint64_t ENZ_LOW_BW_CAP:1;
      uint64_t EN_TEST_MODE:1;
      uint64_t EN_SHRT_CKT:1;
      uint64_t EN_BYPASS:1;
      uint64_t LDO_BW_CTRL:3;
      uint64_t SCPRT_IBIAS_CTRL:1;
      uint64_t ENABLE_PMOS_PULLDOWN:1;
      uint64_t TLOAD_CTRL:3;
      uint64_t TESTMUX_CTRL:4;
      uint64_t BISTMUX_CTRL:4;
      uint64_t RESERVED0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_CLK_CTRL_REG2_LDO_CLKTOP;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLICER_LDO_SC_OUT:1;
      uint64_t RESERVED0:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_CLK_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFSYS_BGAP_EN_CTRL:1;
      uint64_t REFSYS_V2I_EN_CTRL:1;
      uint64_t REFSYS_CAP_SW_CTRLZ:1;
      uint64_t REFSYS_PRE_CHARGE:1;
      uint64_t SLOPE_TRIM_4_0:5;
      uint64_t MAG_TRIM_4_0:5;
      uint64_t IREF_TRIM_4_0:5;
      uint64_t BGAP_ISW:1;
      uint64_t V2I_STARTUP:1;
      uint64_t CLKTOP_IBIAS_EN:1;
      uint64_t LODIST_IBIAS_EN:1;
      uint64_t TX_TOP_IBIAS_EN:1;
      uint64_t REFSYS_V2I_BYPASS_EN:1;
      uint64_t IDIODE_EN:1;
      uint64_t RESERVED1:1;
      uint64_t FTRIM_3_0:4;
      uint64_t RESERVED2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_REFSYS_CTRL_REG_LOWV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VREF_0P45V:1;
      uint64_t VREF_0P9V:1;
      uint64_t VBG_1P22V:1;
      uint64_t RESERVED2:1;
      uint64_t VBE_WEAK:1;
      uint64_t RESERVED3:1;
      uint64_t IBIASP_20U:1;
      uint64_t IBIASP_TS_6U:1;
      uint64_t RESERVED4:1;
      uint64_t IDIODEP_100U:1;
      uint64_t IREFP_10UA:1;
      uint64_t VSSA_REF:1;
      uint64_t I2V_SENSE:1;
      uint64_t BYPASS_MIRR_VPBIAS:1;
      uint64_t TX_IBIASP_20u:1;
      uint64_t LO_IBIASP_20u:1;
      uint64_t RESERVED1:15;
      uint64_t REFSYS_CTRL_8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_REFSYS_TMUX_CTRL_LOWV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VDD_IR_DROP_COMP_SEL:2;
      uint64_t VDDS_3P3V_IR_DROP_COMP_SEL:2;
      uint64_t VDDA_OSC_IR_DROP_COMP_SEL:2;
      uint64_t VDD_SR_SEL:2;
      uint64_t VDD_UV_SELF_TEST_SEL:1;
      uint64_t VDD_OV_SELF_TEST_SEL:1;
      uint64_t VDDA_OSC_UV_SELF_TEST_SEL:1;
      uint64_t RESERVED0:1;
      uint64_t VDDS_3P3V_UV_SELF_TEST_SEL:1;
      uint64_t RESERVED1:1;
      uint64_t VDD_OV_IR_DROP_COMP_SEL:2;
      uint64_t VDD_OV_SR_SEL:2;
      uint64_t VIOIN_UV_RSET_EN:1;
      uint64_t VDDA_OSC_UV_RSET_EN:1;
      uint64_t VDD_UV_RSET_EN:1;
      uint64_t VDD_OV_RSET_EN:1;
      uint64_t REFSYS_SPARE_30_22:9;
      uint64_t ANALOGTEST_TMUX_ESD_CTRL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_REFSYS_SPARE_REG_LOWV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_CLK_EN:1;
      uint64_t INT_CLK_STOP:1;
      uint64_t INT_CLK_SW_SEL:1;
      uint64_t INT_CLK_TRIM_7_0:8;
      uint64_t INT_CLK_FREQ_SEL_3_0:4;
      uint64_t WU_CPU_CLK_CTRL:1;
      uint64_t XTAL_EN_OVERRIDE:1;
      uint64_t WU_UV_DET_CTRL:1;
      uint64_t WU_OV_DET_CTRL:1;
      uint64_t WU_XTAL_DLY_CTRL:1;
      uint64_t WU_SUPP_VMON_EN:1;
      uint64_t WU_VRAM_VMON_EN:1;
      uint64_t WU_SUPP_DET_CTRL:1;
      uint64_t WU_SPARE_IN:2;
      uint64_t WU_VDDS_3P3V_UV_VMON_EN:1;
      uint64_t WU_VDDA_OSC_UV_VMON_EN:1;
      uint64_t WU_VDD_UV_VMON_EN:1;
      uint64_t WU_VDD_OV_VMON_EN:1;
      uint64_t WU_SPARE_IN_2:2;
      uint64_t RESERVED0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_WU_CTRL_REG_LOWV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCALED_VDDA_OSC_UV:1;
      uint64_t SCALED_VIO3318:1;
      uint64_t SCALED_VDDS18:1;
      uint64_t VFB_0P6V:1;
      uint64_t SCALED_VIOIN:1;
      uint64_t SCALED_VDDA_LVDS_1P8V:1;
      uint64_t VDD_SR_OV_VREF:1;
      uint64_t VREF_0P9V:1;
      uint64_t SCALED_VDDA18:1;
      uint64_t VIOIN_UV_VREF:1;
      uint64_t VDDA14_INT:1;
      uint64_t SCALED_VDDA_LVDS_1P8V_1P2:1;
      uint64_t VDDA14_2_INT:1;
      uint64_t VT_ANA_SIG:1;
      uint64_t VT_DIG_SIG_UV:1;
      uint64_t VT_DIG_SIG_OV:1;
      uint64_t VDD_SR_UV_VREF:1;
      uint64_t VDDA_OSC_UV_VREF:1;
      uint64_t VFB_0P85V:1;
      uint64_t SCALED_VDDA_OSC:1;
      uint64_t VDDSINT18:1;
      uint64_t RESERVED0:10;
      uint64_t WU_TMUX_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_WU_TMUX_CTRL_LOWV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_EN:1;
      uint64_t ADC_START_CONV:1;
      uint64_t ADC_RESET:1;
      uint64_t ADC_INP_BUF_EN:1;
      uint64_t ADC_REF_BUF_EN:1;
      uint64_t ADC_REF_SEL_2_0:3;
      uint64_t TS_DIFF_INP_BUF_EN:1;
      uint64_t TS_SE_INP_BUF_EN:1;
      uint64_t IFORCE_EXT_CTRL:1;
      uint64_t VREF_EXT_CTRL:1;
      uint64_t VIN_EXT_CTRL:1;
      uint64_t ANA_TMUX_BUF_BYPASS:1;
      uint64_t ANA_TMUX_BUF_EN:1;
      uint64_t RTRIM_TW_4_0:5;
      uint64_t Reserved1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_TW_CTRL_REG_LOWV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WU_ANA_TEST_OUT_1P8V:1;
      uint64_t REFSYS_TEST_OUT_1P8V:1;
      uint64_t PM_ANA_INP_2:1;
      uint64_t PM_ANA_INP_3:1;
      uint64_t PM_ANA_INP_4:1;
      uint64_t PM_ANA_INP_5:1;
      uint64_t VBE_S_BUFF:1;
      uint64_t VBE_W_BUFF:1;
      uint64_t DC_BIST_BUF_INP_1P8V:1;
      uint64_t ADC_BUF_OUT_1P8V:1;
      uint64_t ADC_REF_BUF_OUT:1;
      uint64_t DELVBE_BUFF_OUT:1;
      uint64_t VBE_TS_STRONG:1;
      uint64_t VBE_TS_WEAK:1;
      uint64_t ODP:1;
      uint64_t BIST_MUX_OUT_1P8V:1;
      uint64_t I2V_SENSE:1;
      uint64_t TMUX_BUF_OUT_EN:1;
      uint64_t ATESTV_VSLDO:1;
      uint64_t Reserved0:11;
      uint64_t CLK_TMUX_ESD_CTRL:1;
      uint64_t ANA_TEST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_TW_ANA_TMUX_CTRL_LOWV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_TW_SPARE_LOWV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC_TEST_DET_SYNC:1;
      uint64_t TEST_MODE_DET_SYNC:1;
      uint64_t SOP_MODE_LAT_4_0:5;
      uint64_t Reserved0:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_WU_MODE_REG_LOWV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CORE_OVDET_LAT:1;
      uint64_t CORE_UVDET_LAT:1;
      uint64_t SUPP_OK_ANA18:1;
      uint64_t SUPP_OK_CLK18:1;
      uint64_t SUPP_OK_IO18:1;
      uint64_t SUPP_OK_IO33:1;
      uint64_t SUPP_OK_RF10:1;
      uint64_t SUPP_OK_RF14:1;
      uint64_t SUPP_OK_RF2_14:1;
      uint64_t SUPP_OK_SRAM12:1;
      uint64_t SUPP_OK_VDDD18:1;
      uint64_t REF_CLK_STATUS:1;
      uint64_t RCOSC_CLK_STATUS:1;
      uint64_t XTAL_DET_STATUS:1;
      uint64_t LIMP_MODE_STATUS:1;
      uint64_t HVMODE:1;
      uint64_t SUPP_OK_APLLVCO18:1;
      uint64_t VDDA_OSC_UVDET_LAT:1;
      uint64_t VDDS_3P3V_UVDET_LAT:1;
      uint64_t Reserved0:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_WU_STATUS_REG_LOWV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VDDCLK18DET:1;
      uint64_t VDDARF_DET:1;
      uint64_t VDDS18DET:1;
      uint64_t HVMODE:1;
      uint64_t SUPPDET_OV_CTRL:1;
      uint64_t INT_OSC_CTRL:1;
      uint64_t CORE_OVDET_LOWV:1;
      uint64_t CORE_UVDET_LOWV:1;
      uint64_t Reserved0:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_REG_WU_SPARE_OUT_LOWV;

  uint8_t res9[904];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_wph:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_WPH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rec0:1;
      uint64_t hw_spare_rec1:1;
      uint64_t hw_spare_rec2:1;
      uint64_t hw_spare_rec3:1;
      uint64_t hw_spare_rec4:1;
      uint64_t hw_spare_rec5:1;
      uint64_t hw_spare_rec6:1;
      uint64_t hw_spare_rec7:1;
      uint64_t hw_spare_rec8:1;
      uint64_t hw_spare_rec9:1;
      uint64_t hw_spare_rec10:1;
      uint64_t hw_spare_rec11:1;
      uint64_t hw_spare_rec12:1;
      uint64_t hw_spare_rec13:1;
      uint64_t hw_spare_rec14:1;
      uint64_t hw_spare_rec15:1;
      uint64_t hw_spare_rec16:1;
      uint64_t hw_spare_rec17:1;
      uint64_t hw_spare_rec18:1;
      uint64_t hw_spare_rec19:1;
      uint64_t hw_spare_rec20:1;
      uint64_t hw_spare_rec21:1;
      uint64_t hw_spare_rec22:1;
      uint64_t hw_spare_rec23:1;
      uint64_t hw_spare_rec24:1;
      uint64_t hw_spare_rec25:1;
      uint64_t hw_spare_rec26:1;
      uint64_t hw_spare_rec27:1;
      uint64_t hw_spare_rec28:1;
      uint64_t hw_spare_rec29:1;
      uint64_t hw_spare_rec30:1;
      uint64_t hw_spare_rec31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REC;

  uint8_t res10[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_raw_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enabled_status_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eoi;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_type_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b19_8:12;
      uint64_t b31_20:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_attr_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_clear;

