iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_TOPRCM (*(volatile struct MSS_TOPRCM_tag *) 0x2140000)

struct MSS_PCR1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS0_PROT_SET:1;
      uint64_t PCS1_PROT_SET:1;
      uint64_t PCS2_PROT_SET:1;
      uint64_t PCS3_PROT_SET:1;
      uint64_t PCS4_PROT_SET:1;
      uint64_t PCS5_PROT_SET:1;
      uint64_t PCS6_PROT_SET:1;
      uint64_t PCS7_PROT_SET:1;
      uint64_t PCS8_PROT_SET:1;
      uint64_t PCS9_PROT_SET:1;
      uint64_t PCS10_PROT_SET:1;
      uint64_t PCS11_PROT_SET:1;
      uint64_t PCS12_PROT_SET:1;
      uint64_t PCS13_PROT_SET:1;
      uint64_t PCS14_PROT_SET:1;
      uint64_t PCS15_PROT_SET:1;
      uint64_t PCS16_PROT_SET:1;
      uint64_t PCS17_PROT_SET:1;
      uint64_t PCS18_PROT_SET:1;
      uint64_t PCS19_PROT_SET:1;
      uint64_t PCS20_PROT_SET:1;
      uint64_t PCS21_PROT_SET:1;
      uint64_t PCS22_PROT_SET:1;
      uint64_t PCS23_PROT_SET:1;
      uint64_t PCS24_PROT_SET:1;
      uint64_t PCS25_PROT_SET:1;
      uint64_t PCS26_PROT_SET:1;
      uint64_t PCS27_PROT_SET:1;
      uint64_t PCS28_PROT_SET:1;
      uint64_t PCS29_PROT_SET:1;
      uint64_t PCS30_PROT_SET:1;
      uint64_t PCS31_PROT_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTSET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS32_PROT_SET:1;
      uint64_t PCS33_PROT_SET:1;
      uint64_t PCS34_PROT_SET:1;
      uint64_t PCS35_PROT_SET:1;
      uint64_t PCS36_PROT_SET:1;
      uint64_t PCS37_PROT_SET:1;
      uint64_t PCS38_PROT_SET:1;
      uint64_t PCS39_PROT_SET:1;
      uint64_t PCS40_PROT_SET:1;
      uint64_t PCS41_PROT_SET:1;
      uint64_t PCS42_PROT_SET:1;
      uint64_t PCS43_PROT_SET:1;
      uint64_t PCS44_PROT_SET:1;
      uint64_t PCS45_PROT_SET:1;
      uint64_t PCS46_PROT_SET:1;
      uint64_t PCS47_PROT_SET:1;
      uint64_t PCS48_PROT_SET:1;
      uint64_t PCS49_PROT_SET:1;
      uint64_t PCS50_PROT_SET:1;
      uint64_t PCS51_PROT_SET:1;
      uint64_t PCS52_PROT_SET:1;
      uint64_t PCS53_PROT_SET:1;
      uint64_t PCS54_PROT_SET:1;
      uint64_t PCS55_PROT_SET:1;
      uint64_t PCS56_PROT_SET:1;
      uint64_t PCS57_PROT_SET:1;
      uint64_t PCS58_PROT_SET:1;
      uint64_t PCS59_PROT_SET:1;
      uint64_t PCS60_PROT_SET:1;
      uint64_t PCS61_PROT_SET:1;
      uint64_t PCS62_PROT_SET:1;
      uint64_t PCS63_PROT_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTSET1;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS0_PROT_CLR:1;
      uint64_t PCS1_PROT_CLR:1;
      uint64_t PCS2_PROT_CLR:1;
      uint64_t PCS3_PROT_CLR:1;
      uint64_t PCS4_PROT_CLR:1;
      uint64_t PCS5_PROT_CLR:1;
      uint64_t PCS6_PROT_CLR:1;
      uint64_t PCS7_PROT_CLR:1;
      uint64_t PCS8_PROT_CLR:1;
      uint64_t PCS9_PROT_CLR:1;
      uint64_t PCS10_PROT_CLR:1;
      uint64_t PCS11_PROT_CLR:1;
      uint64_t PCS12_PROT_CLR:1;
      uint64_t PCS13_PROT_CLR:1;
      uint64_t PCS14_PROT_CLR:1;
      uint64_t PCS15_PROT_CLR:1;
      uint64_t PCS16_PROT_CLR:1;
      uint64_t PCS17_PROT_CLR:1;
      uint64_t PCS18_PROT_CLR:1;
      uint64_t PCS19_PROT_CLR:1;
      uint64_t PCS20_PROT_CLR:1;
      uint64_t PCS21_PROT_CLR:1;
      uint64_t PCS22_PROT_CLR:1;
      uint64_t PCS23_PROT_CLR:1;
      uint64_t PCS24_PROT_CLR:1;
      uint64_t PCS25_PROT_CLR:1;
      uint64_t PCS26_PROT_CLR:1;
      uint64_t PCS27_PROT_CLR:1;
      uint64_t PCS28_PROT_CLR:1;
      uint64_t PCS29_PROT_CLR:1;
      uint64_t PCS30_PROT_CLR:1;
      uint64_t PCS31_PROT_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTCLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS32_PROT_CLR:1;
      uint64_t PCS33_PROT_CLR:1;
      uint64_t PCS34_PROT_CLR:1;
      uint64_t PCS35_PROT_CLR:1;
      uint64_t PCS36_PROT_CLR:1;
      uint64_t PCS37_PROT_CLR:1;
      uint64_t PCS38_PROT_CLR:1;
      uint64_t PCS39_PROT_CLR:1;
      uint64_t PCS40_PROT_CLR:1;
      uint64_t PCS41_PROT_CLR:1;
      uint64_t PCS42_PROT_CLR:1;
      uint64_t PCS43_PROT_CLR:1;
      uint64_t PCS44_PROT_CLR:1;
      uint64_t PCS45_PROT_CLR:1;
      uint64_t PCS46_PROT_CLR:1;
      uint64_t PCS47_PROT_CLR:1;
      uint64_t PCS48_PROT_CLR:1;
      uint64_t PCS49_PROT_CLR:1;
      uint64_t PCS50_PROT_CLR:1;
      uint64_t PCS51_PROT_CLR:1;
      uint64_t PCS52_PROT_CLR:1;
      uint64_t PCS53_PROT_CLR:1;
      uint64_t PCS54_PROT_CLR:1;
      uint64_t PCS55_PROT_CLR:1;
      uint64_t PCS56_PROT_CLR:1;
      uint64_t PCS57_PROT_CLR:1;
      uint64_t PCS58_PROT_CLR:1;
      uint64_t PCS59_PROT_CLR:1;
      uint64_t PCS60_PROT_CLR:1;
      uint64_t PCS61_PROT_CLR:1;
      uint64_t PCS62_PROT_CLR:1;
      uint64_t PCS63_PROT_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTCLR1;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS0_QUAD0_PROT_SET:1;
      uint64_t PS0_QUAD1_PROT_SET:1;
      uint64_t PS0_QUAD2_PROT_SET:1;
      uint64_t PS0_QUAD3_PROT_SET:1;
      uint64_t PS1_QUAD0_PROT_SET:1;
      uint64_t PS1_QUAD1_PROT_SET:1;
      uint64_t PS1_QUAD2_PROT_SET:1;
      uint64_t PS1_QUAD3_PROT_SET:1;
      uint64_t PS2_QUAD0_PROT_SET:1;
      uint64_t PS2_QUAD1_PROT_SET:1;
      uint64_t PS2_QUAD2_PROT_SET:1;
      uint64_t PS2_QUAD3_PROT_SET:1;
      uint64_t PS3_QUAD0_PROT_SET:1;
      uint64_t PS3_QUAD1_PROT_SET:1;
      uint64_t PS3_QUAD2_PROT_SET:1;
      uint64_t PS3_QUAD3_PROT_SET:1;
      uint64_t PS4_QUAD0_PROT_SET:1;
      uint64_t PS4_QUAD1_PROT_SET:1;
      uint64_t PS4_QUAD2_PROT_SET:1;
      uint64_t PS4_QUAD3_PROT_SET:1;
      uint64_t PS5_QUAD0_PROT_SET:1;
      uint64_t PS5_QUAD1_PROT_SET:1;
      uint64_t PS5_QUAD2_PROT_SET:1;
      uint64_t PS5_QUAD3_PROT_SET:1;
      uint64_t PS6_QUAD0_PROT_SET:1;
      uint64_t PS6_QUAD1_PROT_SET:1;
      uint64_t PS6_QUAD2_PROT_SET:1;
      uint64_t PS6_QUAD3_PROT_SET:1;
      uint64_t PS7_QUAD0_PROT_SET:1;
      uint64_t PS7_QUAD1_PROT_SET:1;
      uint64_t PS7_QUAD2_PROT_SET:1;
      uint64_t PS7_QUAD3_PROT_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTSET_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS8_QUAD0_PROT_SET:1;
      uint64_t PS8_QUAD1_PROT_SET:1;
      uint64_t PS8_QUAD2_PROT_SET:1;
      uint64_t PS8_QUAD3_PROT_SET:1;
      uint64_t PS9_QUAD0_PROT_SET:1;
      uint64_t PS9_QUAD1_PROT_SET:1;
      uint64_t PS9_QUAD2_PROT_SET:1;
      uint64_t PS9_QUAD3_PROT_SET:1;
      uint64_t PS10_QUAD0_PROT_SET:1;
      uint64_t PS10_QUAD1_PROT_SET:1;
      uint64_t PS10_QUAD2_PROT_SET:1;
      uint64_t PS10_QUAD3_PROT_SET:1;
      uint64_t PS11_QUAD0_PROT_SET:1;
      uint64_t PS11_QUAD1_PROT_SET:1;
      uint64_t PS11_QUAD2_PROT_SET:1;
      uint64_t PS11_QUAD3_PROT_SET:1;
      uint64_t PS12_QUAD0_PROT_SET:1;
      uint64_t PS12_QUAD1_PROT_SET:1;
      uint64_t PS12_QUAD2_PROT_SET:1;
      uint64_t PS12_QUAD3_PROT_SET:1;
      uint64_t PS13_QUAD0_PROT_SET:1;
      uint64_t PS13_QUAD1_PROT_SET:1;
      uint64_t PS13_QUAD2_PROT_SET:1;
      uint64_t PS13_QUAD3_PROT_SET:1;
      uint64_t PS14_QUAD0_PROT_SET:1;
      uint64_t PS14_QUAD1_PROT_SET:1;
      uint64_t PS14_QUAD2_PROT_SET:1;
      uint64_t PS14_QUAD3_PROT_SET:1;
      uint64_t PS15_QUAD0_PROT_SET:1;
      uint64_t PS15_QUAD1_PROT_SET:1;
      uint64_t PS15_QUAD2_PROT_SET:1;
      uint64_t PS15_QUAD3_PROT_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTSET_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS16_QUAD0_PROT_SET:1;
      uint64_t PS16_QUAD1_PROT_SET:1;
      uint64_t PS16_QUAD2_PROT_SET:1;
      uint64_t PS16_QUAD3_PROT_SET:1;
      uint64_t PS17_QUAD0_PROT_SET:1;
      uint64_t PS17_QUAD1_PROT_SET:1;
      uint64_t PS17_QUAD2_PROT_SET:1;
      uint64_t PS17_QUAD3_PROT_SET:1;
      uint64_t PS18_QUAD0_PROT_SET:1;
      uint64_t PS18_QUAD1_PROT_SET:1;
      uint64_t PS18_QUAD2_PROT_SET:1;
      uint64_t PS18_QUAD3_PROT_SET:1;
      uint64_t PS19_QUAD0_PROT_SET:1;
      uint64_t PS19_QUAD1_PROT_SET:1;
      uint64_t PS19_QUAD2_PROT_SET:1;
      uint64_t PS19_QUAD3_PROT_SET:1;
      uint64_t PS20_QUAD0_PROT_SET:1;
      uint64_t PS20_QUAD1_PROT_SET:1;
      uint64_t PS20_QUAD2_PROT_SET:1;
      uint64_t PS20_QUAD3_PROT_SET:1;
      uint64_t PS21_QUAD0_PROT_SET:1;
      uint64_t PS21_QUAD1_PROT_SET:1;
      uint64_t PS21_QUAD2_PROT_SET:1;
      uint64_t PS21_QUAD3_PROT_SET:1;
      uint64_t PS22_QUAD0_PROT_SET:1;
      uint64_t PS22_QUAD1_PROT_SET:1;
      uint64_t PS22_QUAD2_PROT_SET:1;
      uint64_t PS22_QUAD3_PROT_SET:1;
      uint64_t PS23_QUAD0_PROT_SET:1;
      uint64_t PS23_QUAD1_PROT_SET:1;
      uint64_t PS23_QUAD2_PROT_SET:1;
      uint64_t PS23_QUAD3_PROT_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTSET_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS24_QUAD0_PROT_SET:1;
      uint64_t PS24_QUAD1_PROT_SET:1;
      uint64_t PS24_QUAD2_PROT_SET:1;
      uint64_t PS24_QUAD3_PROT_SET:1;
      uint64_t PS25_QUAD0_PROT_SET:1;
      uint64_t PS25_QUAD1_PROT_SET:1;
      uint64_t PS25_QUAD2_PROT_SET:1;
      uint64_t PS25_QUAD3_PROT_SET:1;
      uint64_t PS26_QUAD0_PROT_SET:1;
      uint64_t PS26_QUAD1_PROT_SET:1;
      uint64_t PS26_QUAD2_PROT_SET:1;
      uint64_t PS26_QUAD3_PROT_SET:1;
      uint64_t PS27_QUAD0_PROT_SET:1;
      uint64_t PS27_QUAD1_PROT_SET:1;
      uint64_t PS27_QUAD2_PROT_SET:1;
      uint64_t PS27_QUAD3_PROT_SET:1;
      uint64_t PS28_QUAD0_PROT_SET:1;
      uint64_t PS28_QUAD1_PROT_SET:1;
      uint64_t PS28_QUAD2_PROT_SET:1;
      uint64_t PS28_QUAD3_PROT_SET:1;
      uint64_t PS29_QUAD0_PROT_SET:1;
      uint64_t PS29_QUAD1_PROT_SET:1;
      uint64_t PS29_QUAD2_PROT_SET:1;
      uint64_t PS29_QUAD3_PROT_SET:1;
      uint64_t PS30_QUAD0_PROT_SET:1;
      uint64_t PS30_QUAD1_PROT_SET:1;
      uint64_t PS30_QUAD2_PROT_SET:1;
      uint64_t PS30_QUAD3_PROT_SET:1;
      uint64_t PS31_QUAD0_PROT_SET:1;
      uint64_t PS31_QUAD1_PROT_SET:1;
      uint64_t PS31_QUAD2_PROT_SET:1;
      uint64_t PS31_QUAD3_PROT_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTSET_3;

