iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS0_QUAD0_PROT_CLR:1;
      uint64_t PS0_QUAD1_PROT_CLR:1;
      uint64_t PS0_QUAD2_PROT_CLR:1;
      uint64_t PS0_QUAD3_PROT_CLR:1;
      uint64_t PS1_QUAD0_PROT_CLR:1;
      uint64_t PS1_QUAD1_PROT_CLR:1;
      uint64_t PS1_QUAD2_PROT_CLR:1;
      uint64_t PS1_QUAD3_PROT_CLR:1;
      uint64_t PS2_QUAD0_PROT_CLR:1;
      uint64_t PS2_QUAD1_PROT_CLR:1;
      uint64_t PS2_QUAD2_PROT_CLR:1;
      uint64_t PS2_QUAD3_PROT_CLR:1;
      uint64_t PS3_QUAD0_PROT_CLR:1;
      uint64_t PS3_QUAD1_PROT_CLR:1;
      uint64_t PS3_QUAD2_PROT_CLR:1;
      uint64_t PS3_QUAD3_PROT_CLR:1;
      uint64_t PS4_QUAD0_PROT_CLR:1;
      uint64_t PS4_QUAD1_PROT_CLR:1;
      uint64_t PS4_QUAD2_PROT_CLR:1;
      uint64_t PS4_QUAD3_PROT_CLR:1;
      uint64_t PS5_QUAD0_PROT_CLR:1;
      uint64_t PS5_QUAD1_PROT_CLR:1;
      uint64_t PS5_QUAD2_PROT_CLR:1;
      uint64_t PS5_QUAD3_PROT_CLR:1;
      uint64_t PS6_QUAD0_PROT_CLR:1;
      uint64_t PS6_QUAD1_PROT_CLR:1;
      uint64_t PS6_QUAD2_PROT_CLR:1;
      uint64_t PS6_QUAD3_PROT_CLR:1;
      uint64_t PS7_QUAD0_PROT_CLR:1;
      uint64_t PS7_QUAD1_PROT_CLR:1;
      uint64_t PS7_QUAD2_PROT_CLR:1;
      uint64_t PS7_QUAD3_PROT_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTCLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS8_QUAD0_PROT_CLR:1;
      uint64_t PS8_QUAD1_PROT_CLR:1;
      uint64_t PS8_QUAD2_PROT_CLR:1;
      uint64_t PS8_QUAD3_PROT_CLR:1;
      uint64_t PS9_QUAD0_PROT_CLR:1;
      uint64_t PS9_QUAD1_PROT_CLR:1;
      uint64_t PS9_QUAD2_PROT_CLR:1;
      uint64_t PS9_QUAD3_PROT_CLR:1;
      uint64_t PS10_QUAD0_PROT_CLR:1;
      uint64_t PS10_QUAD1_PROT_CLR:1;
      uint64_t PS10_QUAD2_PROT_CLR:1;
      uint64_t PS10_QUAD3_PROT_CLR:1;
      uint64_t PS11_QUAD0_PROT_CLR:1;
      uint64_t PS11_QUAD1_PROT_CLR:1;
      uint64_t PS11_QUAD2_PROT_CLR:1;
      uint64_t PS11_QUAD3_PROT_CLR:1;
      uint64_t PS12_QUAD0_PROT_CLR:1;
      uint64_t PS12_QUAD1_PROT_CLR:1;
      uint64_t PS12_QUAD2_PROT_CLR:1;
      uint64_t PS12_QUAD3_PROT_CLR:1;
      uint64_t PS13_QUAD0_PROT_CLR:1;
      uint64_t PS13_QUAD1_PROT_CLR:1;
      uint64_t PS13_QUAD2_PROT_CLR:1;
      uint64_t PS13_QUAD3_PROT_CLR:1;
      uint64_t PS14_QUAD0_PROT_CLR:1;
      uint64_t PS14_QUAD1_PROT_CLR:1;
      uint64_t PS14_QUAD2_PROT_CLR:1;
      uint64_t PS14_QUAD3_PROT_CLR:1;
      uint64_t PS15_QUAD0_PROT_CLR:1;
      uint64_t PS15_QUAD1_PROT_CLR:1;
      uint64_t PS15_QUAD2_PROT_CLR:1;
      uint64_t PS15_QUAD3_PROT_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTCLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS16_QUAD0_PROT_CLR:1;
      uint64_t PS16_QUAD1_PROT_CLR:1;
      uint64_t PS16_QUAD2_PROT_CLR:1;
      uint64_t PS16_QUAD3_PROT_CLR:1;
      uint64_t PS17_QUAD0_PROT_CLR:1;
      uint64_t PS17_QUAD1_PROT_CLR:1;
      uint64_t PS17_QUAD2_PROT_CLR:1;
      uint64_t PS17_QUAD3_PROT_CLR:1;
      uint64_t PS18_QUAD0_PROT_CLR:1;
      uint64_t PS18_QUAD1_PROT_CLR:1;
      uint64_t PS18_QUAD2_PROT_CLR:1;
      uint64_t PS18_QUAD3_PROT_CLR:1;
      uint64_t PS19_QUAD0_PROT_CLR:1;
      uint64_t PS19_QUAD1_PROT_CLR:1;
      uint64_t PS19_QUAD2_PROT_CLR:1;
      uint64_t PS19_QUAD3_PROT_CLR:1;
      uint64_t PS20_QUAD0_PROT_CLR:1;
      uint64_t PS20_QUAD1_PROT_CLR:1;
      uint64_t PS20_QUAD2_PROT_CLR:1;
      uint64_t PS20_QUAD3_PROT_CLR:1;
      uint64_t PS21_QUAD0_PROT_CLR:1;
      uint64_t PS21_QUAD1_PROT_CLR:1;
      uint64_t PS21_QUAD2_PROT_CLR:1;
      uint64_t PS21_QUAD3_PROT_CLR:1;
      uint64_t PS22_QUAD0_PROT_CLR:1;
      uint64_t PS22_QUAD1_PROT_CLR:1;
      uint64_t PS22_QUAD2_PROT_CLR:1;
      uint64_t PS22_QUAD3_PROT_CLR:1;
      uint64_t PS23_QUAD0_PROT_CLR:1;
      uint64_t PS23_QUAD1_PROT_CLR:1;
      uint64_t PS23_QUAD2_PROT_CLR:1;
      uint64_t PS23_QUAD3_PROT_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTCLR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS24_QUAD0_PROT_CLR:1;
      uint64_t PS24_QUAD1_PROT_CLR:1;
      uint64_t PS24_QUAD2_PROT_CLR:1;
      uint64_t PS24_QUAD3_PROT_CLR:1;
      uint64_t PS25_QUAD0_PROT_CLR:1;
      uint64_t PS25_QUAD1_PROT_CLR:1;
      uint64_t PS25_QUAD2_PROT_CLR:1;
      uint64_t PS25_QUAD3_PROT_CLR:1;
      uint64_t PS26_QUAD0_PROT_CLR:1;
      uint64_t PS26_QUAD1_PROT_CLR:1;
      uint64_t PS26_QUAD2_PROT_CLR:1;
      uint64_t PS26_QUAD3_PROT_CLR:1;
      uint64_t PS27_QUAD0_PROT_CLR:1;
      uint64_t PS27_QUAD1_PROT_CLR:1;
      uint64_t PS27_QUAD2_PROT_CLR:1;
      uint64_t PS27_QUAD3_PROT_CLR:1;
      uint64_t PS28_QUAD0_PROT_CLR:1;
      uint64_t PS28_QUAD1_PROT_CLR:1;
      uint64_t PS28_QUAD2_PROT_CLR:1;
      uint64_t PS28_QUAD3_PROT_CLR:1;
      uint64_t PS29_QUAD0_PROT_CLR:1;
      uint64_t PS29_QUAD1_PROT_CLR:1;
      uint64_t PS29_QUAD2_PROT_CLR:1;
      uint64_t PS29_QUAD3_PROT_CLR:1;
      uint64_t PS30_QUAD0_PROT_CLR:1;
      uint64_t PS30_QUAD1_PROT_CLR:1;
      uint64_t PS30_QUAD2_PROT_CLR:1;
      uint64_t PS30_QUAD3_PROT_CLR:1;
      uint64_t PS31_QUAD0_PROT_CLR:1;
      uint64_t PS31_QUAD1_PROT_CLR:1;
      uint64_t PS31_QUAD2_PROT_CLR:1;
      uint64_t PS31_QUAD3_PROT_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTCLR3;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS0_PWRDWN_SET:1;
      uint64_t PCS1_PWRDWN_SET:1;
      uint64_t PCS2_PWRDWN_SET:1;
      uint64_t PCS3_PWRDWN_SET:1;
      uint64_t PCS4_PWRDWN_SET:1;
      uint64_t PCS5_PWRDWN_SET:1;
      uint64_t PCS6_PWRDWN_SET:1;
      uint64_t PCS7_PWRDWN_SET:1;
      uint64_t PCS8_PWRDWN_SET:1;
      uint64_t PCS9_PWRDWN_SET:1;
      uint64_t PCS10_PWRDWN_SET:1;
      uint64_t PCS11_PWRDWN_SET:1;
      uint64_t PCS12_PWRDWN_SET:1;
      uint64_t PCS13_PWRDWN_SET:1;
      uint64_t PCS14_PWRDWN_SET:1;
      uint64_t PCS15_PWRDWN_SET:1;
      uint64_t PCS16_PWRDWN_SET:1;
      uint64_t PCS17_PWRDWN_SET:1;
      uint64_t PCS18_PWRDWN_SET:1;
      uint64_t PCS19_PWRDWN_SET:1;
      uint64_t PCS20_PWRDWN_SET:1;
      uint64_t PCS21_PWRDWN_SET:1;
      uint64_t PCS22_PWRDWN_SET:1;
      uint64_t PCS23_PWRDWN_SET:1;
      uint64_t PCS24_PWRDWN_SET:1;
      uint64_t PCS25_PWRDWN_SET:1;
      uint64_t PCS26_PWRDWN_SET:1;
      uint64_t PCS27_PWRDWN_SET:1;
      uint64_t PCS28_PWRDWN_SET:1;
      uint64_t PCS29_PWRDWN_SET:1;
      uint64_t PCS30_PWRDWN_SET:1;
      uint64_t PCS31_PWRDWN_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCSPWRDWNSET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS32_PWRDWN_SET:1;
      uint64_t PCS33_PWRDWN_SET:1;
      uint64_t PCS34_PWRDWN_SET:1;
      uint64_t PCS35_PWRDWN_SET:1;
      uint64_t PCS36_PWRDWN_SET:1;
      uint64_t PCS37_PWRDWN_SET:1;
      uint64_t PCS38_PWRDWN_SET:1;
      uint64_t PCS39_PWRDWN_SET:1;
      uint64_t PCS40_PWRDWN_SET:1;
      uint64_t PCS41_PWRDWN_SET:1;
      uint64_t PCS42_PWRDWN_SET:1;
      uint64_t PCS43_PWRDWN_SET:1;
      uint64_t PCS44_PWRDWN_SET:1;
      uint64_t PCS45_PWRDWN_SET:1;
      uint64_t PCS46_PWRDWN_SET:1;
      uint64_t PCS47_PWRDWN_SET:1;
      uint64_t PCS48_PWRDWN_SET:1;
      uint64_t PCS49_PWRDWN_SET:1;
      uint64_t PCS50_PWRDWN_SET:1;
      uint64_t PCS51_PWRDWN_SET:1;
      uint64_t PCS52_PWRDWN_SET:1;
      uint64_t PCS53_PWRDWN_SET:1;
      uint64_t PCS54_PWRDWN_SET:1;
      uint64_t PCS55_PWRDWN_SET:1;
      uint64_t PCS56_PWRDWN_SET:1;
      uint64_t PCS57_PWRDWN_SET:1;
      uint64_t PCS58_PWRDWN_SET:1;
      uint64_t PCS59_PWRDWN_SET:1;
      uint64_t PCS60_PWRDWN_SET:1;
      uint64_t PCS61_PWRDWN_SET:1;
      uint64_t PCS62_PWRDWN_SET:1;
      uint64_t PCS63_PWRDWN_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCSPWRDWNSET1;

