iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS23_QUAD2_MSTID:16;
      uint64_t PS23_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS23MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS24_QUAD0_MSTID:16;
      uint64_t PS24_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS24MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS24_QUAD2_MSTID:16;
      uint64_t PS24_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS24MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS25_QUAD0_MSTID:16;
      uint64_t PS25_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS25MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS25_QUAD2_MSTID:16;
      uint64_t PS25_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS25MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS26_QUAD0_MSTID:16;
      uint64_t PS26_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS26MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS26_QUAD2_MSTID:16;
      uint64_t PS26_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS26MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS27_QUAD0_MSTID:16;
      uint64_t PS27_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS27MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS27_QUAD2_MSTID:16;
      uint64_t PS27_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS27MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS28_QUAD0_MSTID:16;
      uint64_t PS28_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS28MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS28_QUAD2_MSTID:16;
      uint64_t PS28_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS28MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS29_QUAD0_MSTID:16;
      uint64_t PS29_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS29MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS29_QUAD2_MSTID:16;
      uint64_t PS29_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS29MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS30_QUAD0_MSTID:16;
      uint64_t PS30_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS30MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS30_QUAD2_MSTID:16;
      uint64_t PS30_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS30MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS31_QUAD0_MSTID:16;
      uint64_t PS31_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS31MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS31_QUAD2_MSTID:16;
      uint64_t PS31_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS31MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS0_QUAD0_MSTID:16;
      uint64_t PPS0_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS0MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS0_QUAD2_MSTID:16;
      uint64_t PPS0_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS0MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS1_QUAD0_MSTID:16;
      uint64_t PPS1_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS1MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS1_QUAD2_MSTID:16;
      uint64_t PPS1_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS1MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS2_QUAD0_MSTID:16;
      uint64_t PPS2_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS2MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS2_QUAD2_MSTID:16;
      uint64_t PPS2_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS2MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS3_QUAD0_MSTID:16;
      uint64_t PPS3_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS3MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS3_QUAD2_MSTID:16;
      uint64_t PPS3_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS3MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS4_QUAD0_MSTID:16;
      uint64_t PPS4_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS4MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS4_QUAD2_MSTID:16;
      uint64_t PPS4_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS4MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS5_QUAD0_MSTID:16;
      uint64_t PPS5_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS5MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS5_QUAD2_MSTID:16;
      uint64_t PPS5_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS5MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS6_QUAD0_MSTID:16;
      uint64_t PPS6_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS6MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS6_QUAD2_MSTID:16;
      uint64_t PPS6_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS6MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS7_QUAD0_MSTID:16;
      uint64_t PPS7_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS7MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS7_QUAD2_MSTID:16;
      uint64_t PPS7_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS7MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE0_QUAD0_MSTID:16;
      uint64_t PPSE0_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE0MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE0_QUAD2_MSTID:16;
      uint64_t PPSE0_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE0MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE1_QUAD0_MSTID:16;
      uint64_t PPSE1_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE1MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE1_QUAD2_MSTID:16;
      uint64_t PPSE1_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE1MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE2_QUAD0_MSTID:16;
      uint64_t PPSE2_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE2MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE2_QUAD2_MSTID:16;
      uint64_t PPSE2_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE2MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE3_QUAD0_MSTID:16;
      uint64_t PPSE3_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE3MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE3_QUAD2_MSTID:16;
      uint64_t PPSE3_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE3MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE4_QUAD0_MSTID:16;
      uint64_t PPSE4_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE4MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE4_QUAD2_MSTID:16;
      uint64_t PPSE4_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE4MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE5_QUAD0_MSTID:16;
      uint64_t PPSE5_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE5MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE5_QUAD2_MSTID:16;
      uint64_t PPSE5_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE5MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE6_QUAD0_MSTID:16;
      uint64_t PPSE6_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE6MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE6_QUAD2_MSTID:16;
      uint64_t PPSE6_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE6MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE7_QUAD0_MSTID:16;
      uint64_t PPSE7_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE7MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE7_QUAD2_MSTID:16;
      uint64_t PPSE7_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE7MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE8_QUAD0_MSTID:16;
      uint64_t PPSE8_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE8MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE8_QUAD2_MSTID:16;
      uint64_t PPSE8_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE8MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE9_QUAD0_MSTID:16;
      uint64_t PPSE9_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE9MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE9_QUAD2_MSTID:16;
      uint64_t PPSE9_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE9MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE10_QUAD0_MSTID:16;
      uint64_t PPSE10_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE10MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE10_QUAD2_MSTID:16;
      uint64_t PPSE10_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE10MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE11_QUAD0_MSTID:16;
      uint64_t PPSE11_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE11MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE11_QUAD2_MSTID:16;
      uint64_t PPSE11_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE11MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE12_QUAD0_MSTID:16;
      uint64_t PPSE12_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE12MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE12_QUAD2_MSTID:16;
      uint64_t PPSE12_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE12MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE13_QUAD0_MSTID:16;
      uint64_t PPSE13_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE13MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE13_QUAD2_MSTID:16;
      uint64_t PPSE13_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE13MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE14_QUAD0_MSTID:16;
      uint64_t PPSE14_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE14MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE14_QUAD2_MSTID:16;
      uint64_t PPSE14_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE14MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE15_QUAD0_MSTID:16;
      uint64_t PPSE15_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE15MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE15_QUAD2_MSTID:16;
      uint64_t PPSE15_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE15MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE16_QUAD0_MSTID:16;
      uint64_t PPSE16_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE16MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE16_QUAD2_MSTID:16;
      uint64_t PPSE16_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE16MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE17_QUAD0_MSTID:16;
      uint64_t PPSE17_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE17MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE17_QUAD2_MSTID:16;
      uint64_t PPSE17_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE17MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE18_QUAD0_MSTID:16;
      uint64_t PPSE18_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE18MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE18_QUAD2_MSTID:16;
      uint64_t PPSE18_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE18MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE19_QUAD0_MSTID:16;
      uint64_t PPSE19_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE19MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE19_QUAD2_MSTID:16;
      uint64_t PPSE19_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE19MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE20_QUAD0_MSTID:16;
      uint64_t PPSE20_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE20MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE20_QUAD2_MSTID:16;
      uint64_t PPSE20_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE20MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE21_QUAD0_MSTID:16;
      uint64_t PPSE21_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE21MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE21_QUAD2_MSTID:16;
      uint64_t PPSE21_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE21MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE22_QUAD0_MSTID:16;
      uint64_t PPSE22_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE22MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE22_QUAD2_MSTID:16;
      uint64_t PPSE22_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE22MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE23_QUAD0_MSTID:16;
      uint64_t PPSE23_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE23MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE23_QUAD2_MSTID:16;
      uint64_t PPSE23_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE23MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE24_QUAD0_MSTID:16;
      uint64_t PPSE24_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE24MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE24_QUAD2_MSTID:16;
      uint64_t PPSE24_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE24MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE25_QUAD0_MSTID:16;
      uint64_t PPSE25_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE25MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE25_QUAD2_MSTID:16;
      uint64_t PPSE25_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE25MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE26_QUAD0_MSTID:16;
      uint64_t PPSE26_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE26MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE26_QUAD2_MSTID:16;
      uint64_t PPSE26_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE26MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE27_QUAD0_MSTID:16;
      uint64_t PPSE27_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE27MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE27_QUAD2_MSTID:16;
      uint64_t PPSE27_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE27MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE28_QUAD0_MSTID:16;
      uint64_t PPSE28_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE28MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE28_QUAD2_MSTID:16;
      uint64_t PPSE28_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE28MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE29_QUAD0_MSTID:16;
      uint64_t PPSE29_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE29MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE29_QUAD2_MSTID:16;
      uint64_t PPSE29_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE29MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE30_QUAD0_MSTID:16;
      uint64_t PPSE30_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE30MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE30_QUAD2_MSTID:16;
      uint64_t PPSE30_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE30MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE31_QUAD0_MSTID:16;
      uint64_t PPSE31_QUAD1_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE31MSTID_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSE31_QUAD2_MSTID:16;
      uint64_t PPSE31_QUAD3_MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPSE31MSTID_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS0MSTID:16;
      uint64_t PCS1MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS0MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS2MSTID:16;
      uint64_t PCS3MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS1MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS4MSTID:16;
      uint64_t PCS5MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS2MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS6MSTID:16;
      uint64_t PCS7MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS3MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS8MSTID:16;
      uint64_t PCS9MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS4MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS10MSTID:16;
      uint64_t PCS11MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS5MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS12MSTID:16;
      uint64_t PCS13MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS6MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS14MSTID:16;
      uint64_t PCS15MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS7MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS16MSTID:16;
      uint64_t PCS17MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS8MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS18MSTID:16;
      uint64_t PCS19MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS9MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS20MSTID:16;
      uint64_t PCS21MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS10MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS22MSTID:16;
      uint64_t PCS23MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS11MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS24MSTID:16;
      uint64_t PCS25MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS12MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS26MSTID:16;
      uint64_t PCS27MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS13MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS28MSTID:16;
      uint64_t PCS29MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS14MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS30MSTID:16;
      uint64_t PCS31MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS15MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS32MSTID:16;
      uint64_t PCS33MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS16MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS34MSTID:16;
      uint64_t PCS35MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS17MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS36MSTID:16;
      uint64_t PCS37MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS18MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS38MSTID:16;
      uint64_t PCS39MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS19MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS40MSTID:16;
      uint64_t PCS41MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS20MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS42MSTID:16;
      uint64_t PCS43MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS21MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS44MSTID:16;
      uint64_t PCS45MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS22MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS46MSTID:16;
      uint64_t PCS47MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS23MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS48MSTID:16;
      uint64_t PCS49MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS24MSTID;

