iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define TOP_PBIST (*(volatile struct TOP_PBIST_tag *) 0x2f79500)

struct MSS_R5SS_STC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RS_CNT_B1:2;
      uint64_t NU1:3;
      uint64_t SCANEN_HIGH_CAP_IDLE_CYCLE:3;
      uint64_t CAP_IDLE_CYCLE:3;
      uint64_t NU0:5;
      uint64_t INTCOUNT_B16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCGCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST_ENA_B4:4;
      uint64_t ROM_ACCESS_INV:1;
      uint64_t LP_SCAN_MODE:1;
      uint64_t CODEC_SPREAD_MODE:1;
      uint64_t NU3:1;
      uint64_t SEG0_CORE_SEL:4;
      uint64_t NU2:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCGCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TO_PRELOAD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCTPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STC_CADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CORE1_ICOUNT:16;
      uint64_t CORE2_ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCCICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEST_DONE:1;
      uint64_t TEST_FAIL:1;
      uint64_t NU5:6;
      uint64_t ST_ACTIVE:4;
      uint64_t NU4:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCGSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPU1_FAIL_B1:1;
      uint64_t CPU2_FAIL_B1:1;
      uint64_t TO_ER_B1:1;
      uint64_t FSEG_ID:2;
      uint64_t NU6:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCFSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELF_CHECK_KEY_B4:4;
      uint64_t FAULT_INS_B1:1;
      uint64_t NU7:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCSCSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STC_CADDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKDIV3:3;
      uint64_t NU11:5;
      uint64_t CLKDIV2:3;
      uint64_t NU10:5;
      uint64_t CLKDIV1:3;
      uint64_t NU9:5;
      uint64_t CLKDIV0:3;
      uint64_t NU8:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STC_CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGID_PLOAD:2;
      uint64_t NU12:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STC_SEGPLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEG_START_ADDR:20;
      uint64_t NU13:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEG0_START_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEG_START_ADDR:20;
      uint64_t NU14:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEG1_START_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEG_START_ADDR:20;
      uint64_t NU15:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEG2_START_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEG_START_ADDR:20;
      uint64_t NU16:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEG3_START_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR8:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR9:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR10:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR11:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR12:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR13:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR14:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR15:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR16:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR17:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR18:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR19:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR20:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR21:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR22:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR23:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR24:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR25:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR26:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1MISR27:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE1_CURMISR_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR8:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR9:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR10:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR11:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR12:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR13:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR14:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR15:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR16:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR17:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR18:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR19:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR20:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR21:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR22:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR23:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR24:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR25:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR26:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2MISR27:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORE2_CURMISR_27;

