iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_R5SS_STC (*(volatile struct MSS_R5SS_STC_tag *) 0x2f79800)

struct MSS_DCCA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCCENA:4;
      uint64_t ERRENA:4;
      uint64_t SINGLESHOT:4;
      uint64_t DONENA:4;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCGCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR:5;
      uint64_t CUSTOM:1;
      uint64_t MAJOR:3;
      uint64_t RTL:5;
      uint64_t FUNC:12;
      uint64_t NU1:2;
      uint64_t SCHEME:3;
      uint64_t NU2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCREV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTSEED0:20;
      uint64_t NU3:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNTSEED0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDSEED0:16;
      uint64_t NU4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCVALIDSEED0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTSEED1:20;
      uint64_t NU5:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNTSEED1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR:1;
      uint64_t DONE:1;
      uint64_t NU6:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT0:20;
      uint64_t NU7:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALID0:16;
      uint64_t NU8:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCVALID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT1:20;
      uint64_t NU9:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_SRC1:4;
      uint64_t NU10:8;
      uint64_t KEY_B4:4;
      uint64_t NU11:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCLKSSRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_SRC0:4;
      uint64_t NU12:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCLKSSRC0;

};

#define MSS_DCCA (*(volatile struct MSS_DCCA_tag *) 0x2f79c00)

struct MSS_DCCB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCCENA:4;
      uint64_t ERRENA:4;
      uint64_t SINGLESHOT:4;
      uint64_t DONENA:4;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCGCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR:5;
      uint64_t CUSTOM:1;
      uint64_t MAJOR:3;
      uint64_t RTL:5;
      uint64_t FUNC:12;
      uint64_t NU1:2;
      uint64_t SCHEME:3;
      uint64_t NU2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCREV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTSEED0:20;
      uint64_t NU3:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNTSEED0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDSEED0:16;
      uint64_t NU4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCVALIDSEED0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTSEED1:20;
      uint64_t NU5:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNTSEED1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR:1;
      uint64_t DONE:1;
      uint64_t NU6:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT0:20;
      uint64_t NU7:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALID0:16;
      uint64_t NU8:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCVALID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT1:20;
      uint64_t NU9:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_SRC1:4;
      uint64_t NU10:8;
      uint64_t KEY_B4:4;
      uint64_t NU11:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCLKSSRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_SRC0:4;
      uint64_t NU12:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCLKSSRC0;

};

#define MSS_DCCB (*(volatile struct MSS_DCCB_tag *) 0x2f79d00)

struct MSS_DCCC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCCENA:4;
      uint64_t ERRENA:4;
      uint64_t SINGLESHOT:4;
      uint64_t DONENA:4;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCGCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR:5;
      uint64_t CUSTOM:1;
      uint64_t MAJOR:3;
      uint64_t RTL:5;
      uint64_t FUNC:12;
      uint64_t NU1:2;
      uint64_t SCHEME:3;
      uint64_t NU2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCREV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTSEED0:20;
      uint64_t NU3:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNTSEED0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDSEED0:16;
      uint64_t NU4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCVALIDSEED0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTSEED1:20;
      uint64_t NU5:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNTSEED1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR:1;
      uint64_t DONE:1;
      uint64_t NU6:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT0:20;
      uint64_t NU7:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALID0:16;
      uint64_t NU8:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCVALID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT1:20;
      uint64_t NU9:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_SRC1:4;
      uint64_t NU10:8;
      uint64_t KEY_B4:4;
      uint64_t NU11:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCLKSSRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_SRC0:4;
      uint64_t NU12:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCLKSSRC0;

