iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_DCCC (*(volatile struct MSS_DCCC_tag *) 0x2f79e00)

struct MSS_DCCD_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCCENA:4;
      uint64_t ERRENA:4;
      uint64_t SINGLESHOT:4;
      uint64_t DONENA:4;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCGCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR:5;
      uint64_t CUSTOM:1;
      uint64_t MAJOR:3;
      uint64_t RTL:5;
      uint64_t FUNC:12;
      uint64_t NU1:2;
      uint64_t SCHEME:3;
      uint64_t NU2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCREV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTSEED0:20;
      uint64_t NU3:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNTSEED0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDSEED0:16;
      uint64_t NU4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCVALIDSEED0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTSEED1:20;
      uint64_t NU5:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNTSEED1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR:1;
      uint64_t DONE:1;
      uint64_t NU6:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT0:20;
      uint64_t NU7:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALID0:16;
      uint64_t NU8:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCVALID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT1:20;
      uint64_t NU9:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCNT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_SRC1:4;
      uint64_t NU10:8;
      uint64_t KEY_B4:4;
      uint64_t NU11:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCLKSSRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_SRC0:4;
      uint64_t NU12:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCCLKSSRC0;

};

#define MSS_DCCD (*(volatile struct MSS_DCCD_tag *) 0x2f79f00)

struct MSS_RTIA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT0EN:1;
      uint64_t CNT1EN:1;
      uint64_t RESERVED1:13;
      uint64_t COS:1;
      uint64_t NTUSEL:4;
      uint64_t RESERVED2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIGCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBEXT:1;
      uint64_t INC:1;
      uint64_t RESERVED3:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTITBCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPCNTR0:1;
      uint64_t CAPCNTR1:1;
      uint64_t RESERVED4:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICAPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0SEL:1;
      uint64_t RESERVED5:3;
      uint64_t COMP1SEL:1;
      uint64_t RESERVED6:3;
      uint64_t COMP2SEL:1;
      uint64_t RESERVED7:3;
      uint64_t COMP3SEL:1;
      uint64_t RESERVED8:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRC0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIFRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UC0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIUC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPUC0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICPUC0;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAFRC0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICAFRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAUC0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICAUC0;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRC1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIFRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UC1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIUC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPUC1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICPUC1;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAFRC1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICAFRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAUC1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICAUC1;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDCP0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIUDCP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDCP1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIUDCP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDCP2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIUDCP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDCP3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIUDCP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBLCOMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTITBLCOMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBHCOMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTITBHCOMP;

