iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_WDT (*(volatile struct MSS_WDT_tag *) 0x2f7a300)

struct MSS_ESM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIESR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIECR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPSF:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMEPSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTOFFH:9;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIOFFHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTOFFL:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIOFFLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTCP:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMLTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTCP:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMLTCPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EKEY:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMEKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPSR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIESR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIECR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILSR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSR4;

  uint8_t res0[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPSR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIESR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIECR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILSR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSR7;

  uint8_t res1[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPSR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIESR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIECR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILSR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSR10;

};

#define MSS_ESM (*(volatile struct MSS_ESM_tag *) 0x2f7a400)

struct MSS_CCMR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STE1:1;
      uint64_t STET1:1;
      uint64_t NU0:6;
      uint64_t STC1:1;
      uint64_t NU1:7;
      uint64_t CMPE1:1;
      uint64_t NU2:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCMSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MKEY1:4;
      uint64_t NU3:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCMKEYR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STE2:1;
      uint64_t STET2:1;
      uint64_t NU4:6;
      uint64_t STC2:1;
      uint64_t NU5:7;
      uint64_t CMPE2:1;
      uint64_t NU6:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCMSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MKEY2:4;
      uint64_t NU7:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCMKEYR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STE3:1;
      uint64_t STET3:1;
      uint64_t NU8:6;
      uint64_t STC3:1;
      uint64_t NU9:7;
      uint64_t CMPE3:1;
      uint64_t NU10:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCMSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MKEY3:4;
      uint64_t NU11:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCMKEYR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_INV:8;
      uint64_t NU12:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCMPOLCNTRL;

