iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_CCMR (*(volatile struct MSS_CCMR_tag *) 0x2f7ac00)

struct MSS_I2C_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A9_A0:10;
      uint64_t NU:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AL:1;
      uint64_t NACK:1;
      uint64_t ARDY:1;
      uint64_t ICRRDY:1;
      uint64_t ICXRDY:1;
      uint64_t SCD:1;
      uint64_t AAS:1;
      uint64_t NU:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AL:1;
      uint64_t NACK:1;
      uint64_t ARDY:1;
      uint64_t ICRRDY:1;
      uint64_t ICXRDY:1;
      uint64_t SCD:1;
      uint64_t NU1:2;
      uint64_t AD0:1;
      uint64_t AAS:1;
      uint64_t XSMT:1;
      uint64_t RSFULL:1;
      uint64_t BB:1;
      uint64_t NACKSNT:1;
      uint64_t SDIR:1;
      uint64_t NU2:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICCL15_ICCL0:16;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICCLKL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICCH15_ICCLH0:16;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICCLKH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICDC15_ICDC0:16;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D7_D0:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A9_A0:10;
      uint64_t NU:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D7_D0:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDXR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BC2_BC1_BC0:3;
      uint64_t FDF:1;
      uint64_t STB:1;
      uint64_t IRS:1;
      uint64_t DLB:1;
      uint64_t RM:1;
      uint64_t XA:1;
      uint64_t TRX:1;
      uint64_t MST:1;
      uint64_t STP:1;
      uint64_t NU1:1;
      uint64_t STT:1;
      uint64_t FREE:1;
      uint64_t NACKMOD:1;
      uint64_t NU2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTCODE:3;
      uint64_t NU1:5;
      uint64_t TESTMD:4;
      uint64_t NU2:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BCM:1;
      uint64_t IGNACK:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICEMDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPSC7_IPSC0:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REVISION:8;
      uint64_t CLASS:8;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TYPE:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDMAEN:1;
      uint64_t TXDMAEN:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDMAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_RESERVED1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_RESERVED2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFUNC0:1;
      uint64_t NU:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPFUNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIR0:1;
      uint64_t PDIR1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIN0:1;
      uint64_t PDIN1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDOUT0:1;
      uint64_t PDOUT1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDSET0:1;
      uint64_t PDSET1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDCLR0:1;
      uint64_t PDCLR1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDRV0:1;
      uint64_t PDRV1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDRV;

};

#define MSS_I2C (*(volatile struct MSS_I2C_tag *) 0x2f7b000)

struct MSS_GIO_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t NU0:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOGCR;

  union
  {
    uint64_t R:33;
    struct
    {
      uint64_t GIOPWDN:1;
      uint64_t NU:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(8))) GIOPWDN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOINTDET_0:8;
      uint64_t GIOINTDET_1:8;
      uint64_t GIOINTDET_2:8;
      uint64_t GIOINTDET_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOINTDET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPOL_0:8;
      uint64_t GIOPOL_1:8;
      uint64_t GIOPOL_2:8;
      uint64_t GIOPOL_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOENASET_0:8;
      uint64_t GIOENASET_1:8;
      uint64_t GIOENASET_2:8;
      uint64_t GIOENASET_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOENASET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOENACLR_0:8;
      uint64_t GIOENACLR_1:8;
      uint64_t GIOENACLR_2:8;
      uint64_t GIOENACLR_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOENACLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOLVLSET_0:8;
      uint64_t GIOLVLSET_1:8;
      uint64_t GIOLVLSET_2:8;
      uint64_t GIOLVLSET_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOLVLSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOLVLCLR_0:8;
      uint64_t GIOLVLCLR_1:8;
      uint64_t GIOLVLCLR_2:8;
      uint64_t GIOLVLCLR_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOLVLCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOFLG_0:8;
      uint64_t GIOFLG_1:8;
      uint64_t GIOFLG_2:8;
      uint64_t GIOFLG_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOOFFA:6;
      uint64_t NU1:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOOFFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOOFFB:6;
      uint64_t NU2:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOOFFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOEMUA:6;
      uint64_t NU3:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOEMUA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOEMUB:6;
      uint64_t NU4:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOEMUB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODIRA:8;
      uint64_t NU5:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODIRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODINA:8;
      uint64_t NU11:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODINA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODOUTA:8;
      uint64_t NU17:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODOUTA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODSETA:8;
      uint64_t NU23:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSETA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODCLRA:8;
      uint64_t NU29:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOCLRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPDRA:8;
      uint64_t NU35:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPDRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPULDISA:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPULDISA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPSLA:8;
      uint64_t NU35:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPSLA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODIRB:8;
      uint64_t NU6:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODIRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODINB:8;
      uint64_t NU12:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODINB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODOUTB:8;
      uint64_t NU18:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODOUTB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODSETB:8;
      uint64_t NU24:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSETB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODCLRB:8;
      uint64_t NU30:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOCLRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPDRB:8;
      uint64_t NU36:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPDRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPULDISB:8;
      uint64_t NU36:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPULDISB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPSLB:8;
      uint64_t NU36:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPSLB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODIRC:8;
      uint64_t NU7:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODIRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODINC:8;
      uint64_t NU13:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODINC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODOUTC:8;
      uint64_t NU19:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODOUTC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODSETC:8;
      uint64_t NU25:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSETC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODCLRC:8;
      uint64_t NU31:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOCLRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPDRC:8;
      uint64_t NU37:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPDRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPULDISC:8;
      uint64_t NU37:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPULDISC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPSLC:8;
      uint64_t NU37:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPSLC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODIRD:8;
      uint64_t NU8:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODIRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODIND:8;
      uint64_t NU14:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODIND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODOUTD:8;
      uint64_t NU20:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODOUTD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODSETD:8;
      uint64_t NU26:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSETD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODCLRD:8;
      uint64_t NU32:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOCLRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPDRD:8;
      uint64_t NU38:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPDRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPULDISD:8;
      uint64_t NU38:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPULDISD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPSLD:8;
      uint64_t NU38:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPSLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODIRE:8;
      uint64_t NU9:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODIRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODINE:8;
      uint64_t NU15:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODINE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODOUTE:8;
      uint64_t NU21:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODOUTE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODSETE:8;
      uint64_t NU27:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSETE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODCLRE:8;
      uint64_t NU33:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOCLRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPDRE:8;
      uint64_t NU39:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPDRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPULDISE:8;
      uint64_t NU39:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPULDISE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPSLE:8;
      uint64_t NU39:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPSLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODIRF:8;
      uint64_t NU10:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODIRF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODINF:8;
      uint64_t NU16:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODINF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODOUTF:8;
      uint64_t NU22:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODOUTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODSETF:8;
      uint64_t NU28:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSETF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODCLRF:8;
      uint64_t NU34:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOCLRF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPDRF:8;
      uint64_t NU40:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPDRF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPULDISF:8;
      uint64_t NU40:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPULDISF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPSLF:8;
      uint64_t NU40:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPSLF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODIRG:8;
      uint64_t NU9:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODIRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODING:8;
      uint64_t NU15:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODOUTG:8;
      uint64_t NU21:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODOUTG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODSETG:8;
      uint64_t NU27:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSETG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODCLRG:8;
      uint64_t NU33:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOCLRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPDRG:8;
      uint64_t NU39:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPDRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPULDISG:8;
      uint64_t NU39:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPULDISG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPSLG:8;
      uint64_t NU39:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPSLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODIRH:8;
      uint64_t NU10:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODIRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODINH:8;
      uint64_t NU16:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODINH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODOUTH:8;
      uint64_t NU22:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIODOUTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODSETH:8;
      uint64_t NU28:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSETH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIODCLRH:8;
      uint64_t NU34:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOCLRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPDRH:8;
      uint64_t NU40:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPDRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPULDISH:8;
      uint64_t NU40:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPULDISH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOPSLH:8;
      uint64_t NU40:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOPSLH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOSRCA:8;
      uint64_t NU35:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSRCA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOSRCB:8;
      uint64_t NU36:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSRCB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOSRCC:8;
      uint64_t NU37:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSRCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOSRCD:8;
      uint64_t NU38:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSRCD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOSRCE:8;
      uint64_t NU39:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSRCE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOSRCF:8;
      uint64_t NU40:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSRCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOSRCG:8;
      uint64_t NU39:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSRCG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIOSRCH:8;
      uint64_t NU40:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIOSRCH;

