iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_GIO (*(volatile struct MSS_GIO_tag *) 0x2f7b400)

struct MSS_ECC_AGG_R5A_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b27_16:12;
      uint64_t b29_28:2;
      uint64_t b31_30:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) rev;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b10_0:11;
      uint64_t reservedSpace0:4;
      uint64_t b15_15:1;
      uint64_t b23_16:8;
      uint64_t b24_24:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) vector;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b10_0:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) stat;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b27_16:12;
      uint64_t b29_28:2;
      uint64_t b31_30:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) wrap_rev;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ctrl;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) err_ctrl1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) err_ctrl2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b6_5:2;
      uint64_t b7_7:1;
      uint64_t b9_8:2;
      uint64_t b11_10:2;
      uint64_t b12_12:1;
      uint64_t b14_13:2;
      uint64_t b15_15:1;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) err_stat1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) err_stat2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t reservedSpace0:7;
      uint64_t b9_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) err_stat3;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_eoi_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
      uint64_t b20_20:1;
      uint64_t b21_21:1;
      uint64_t b22_22:1;
      uint64_t b23_23:1;
      uint64_t b24_24:1;
      uint64_t b25_25:1;
      uint64_t b26_26:1;
      uint64_t b27_27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_status_reg0;

  uint8_t res2[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
      uint64_t b20_20:1;
      uint64_t b21_21:1;
      uint64_t b22_22:1;
      uint64_t b23_23:1;
      uint64_t b24_24:1;
      uint64_t b25_25:1;
      uint64_t b26_26:1;
      uint64_t b27_27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_enable_set_reg0;

  uint8_t res3[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
      uint64_t b20_20:1;
      uint64_t b21_21:1;
      uint64_t b22_22:1;
      uint64_t b23_23:1;
      uint64_t b24_24:1;
      uint64_t b25_25:1;
      uint64_t b26_26:1;
      uint64_t b27_27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_enable_clr_reg0;

  uint8_t res4[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ded_eoi_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
      uint64_t b20_20:1;
      uint64_t b21_21:1;
      uint64_t b22_22:1;
      uint64_t b23_23:1;
      uint64_t b24_24:1;
      uint64_t b25_25:1;
      uint64_t b26_26:1;
      uint64_t b27_27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ded_status_reg0;

  uint8_t res5[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
      uint64_t b20_20:1;
      uint64_t b21_21:1;
      uint64_t b22_22:1;
      uint64_t b23_23:1;
      uint64_t b24_24:1;
      uint64_t b25_25:1;
      uint64_t b26_26:1;
      uint64_t b27_27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ded_enable_set_reg0;

  uint8_t res6[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
      uint64_t b20_20:1;
      uint64_t b21_21:1;
      uint64_t b22_22:1;
      uint64_t b23_23:1;
      uint64_t b24_24:1;
      uint64_t b25_25:1;
      uint64_t b26_26:1;
      uint64_t b27_27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ded_enable_clr_reg0;

