iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TICKVALUE:16;
      uint64_t NU:12;
      uint64_t CLKCTRL:2;
      uint64_t RELOAD:1;
      uint64_t TICKENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TICKCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU1:8;
      uint64_t LPEND:8;
      uint64_t NU2:8;
      uint64_t TGINSERVICE:5;
      uint64_t NU3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTGPEND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG0CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG1CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG2CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG3CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG4CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG5CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG6CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG7CTRL;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:6;
      uint64_t COUNTBIT17:1;
      uint64_t BUFID7:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA0CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:6;
      uint64_t COUNTBIT17:1;
      uint64_t BUFID7:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:6;
      uint64_t COUNTBIT17:1;
      uint64_t BUFID7:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:6;
      uint64_t COUNTBIT17:1;
      uint64_t BUFID7:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA3CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:6;
      uint64_t COUNTBIT17:1;
      uint64_t BUFID7:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA4CTRL;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ICOUNT2;

  uint8_t res4[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT4;

