iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LARGE_COUNT:1;
      uint64_t NU:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACNTLEN;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDEN:4;
      uint64_t NU1:4;
      uint64_t PTESTEN:1;
      uint64_t NU2:7;
      uint64_t EDAC_MODE:4;
      uint64_t NU3:4;
      uint64_t SBE_EVT_EN:4;
      uint64_t NU4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAR_ECC_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UERR_FLG0:1;
      uint64_t UERR_FLG1:1;
      uint64_t NU1:6;
      uint64_t SBE_FLG0:1;
      uint64_t SBE_FLG1:1;
      uint64_t NU2:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAR_ECC_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UERRADDR1:11;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UERRADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UERRADDR0:11;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UERRADDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXOVRN_BUF_ADDR:11;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXOVRN_BUF_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPENA:1;
      uint64_t LPBKTYPE:1;
      uint64_t CTRLSCSPINERR:1;
      uint64_t ERRSCSPIN:3;
      uint64_t NU1:2;
      uint64_t IOLPBKTSTENA:4;
      uint64_t NU2:4;
      uint64_t CTRLDLENERR:1;
      uint64_t CTRLTIMEOUT:1;
      uint64_t CTRLPARERR:1;
      uint64_t CTRLDESYNC:1;
      uint64_t CTRLBITERR:1;
      uint64_t NU3:3;
      uint64_t SCSFAILFLG:1;
      uint64_t NU4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOLPBKTSTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPRESCLAE_FMT0:11;
      uint64_t NU1:5;
      uint64_t EPRESCLAE_FMT1:11;
      uint64_t NU2:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTENDED_PRESCALE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPRESCLAE_FMT2:11;
      uint64_t NU3:5;
      uint64_t EPRESCLAE_FMT3:11;
      uint64_t NU4:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTENDED_PRESCALE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECCDIAG_EN:4;
      uint64_t NU:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCDIAG_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEFLG0:1;
      uint64_t SEFLG1:1;
      uint64_t NU1:14;
      uint64_t DEFLG0:1;
      uint64_t DEFLG1:1;
      uint64_t NU2:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCDIAG_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBERRADDR1:11;
      uint64_t NU1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SBERRADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBERRADDR0:11;
      uint64_t NU2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SBERRADDR0;

  uint8_t res7[172];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR:6;
      uint64_t CUSTOM:2;
      uint64_t MAJOR:3;
      uint64_t RTL:5;
      uint64_t FUNC:12;
      uint64_t NU:2;
      uint64_t SCHEME:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIREV;

};

#define MSS_SPIB (*(volatile struct MSS_SPIB_tag *) 0x2f7ea00)

struct MSS_SCIA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIGCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMM_MODE:1;
      uint64_t TIMING_MODE:1;
      uint64_t PARITY_ENA:1;
      uint64_t PARITY:1;
      uint64_t STOP:1;
      uint64_t CLOCK:1;
      uint64_t RESERVED1:1;
      uint64_t SW_nRESET:1;
      uint64_t SLEEP:1;
      uint64_t POWERDOWN:1;
      uint64_t RESERVED2:6;
      uint64_t LOOP_BACK:1;
      uint64_t CONT:1;
      uint64_t RESERVED3:6;
      uint64_t RXENA:1;
      uint64_t TXENA:1;
      uint64_t RESERVED4:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIGCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESERVED1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_BRKDT_INT:1;
      uint64_t SET_WAKEUP_INT:1;
      uint64_t RESERVED1:6;
      uint64_t SET_TX_INT:1;
      uint64_t SET_RX_INT:1;
      uint64_t RESERVED2:6;
      uint64_t SET_TX_DMA:1;
      uint64_t SET_RX_DMA:1;
      uint64_t SET_RX_DMA_ALL:1;
      uint64_t RESERVED3:5;
      uint64_t SET_PE_INT:1;
      uint64_t SET_OE_INT:1;
      uint64_t SET_FE_INT:1;
      uint64_t RESERVED4:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCISETINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_BRKDT_INT:1;
      uint64_t CLR_WAKEUP_INT:1;
      uint64_t RESERVED1:6;
      uint64_t CLR_TX_INT:1;
      uint64_t CLR_RX_INT:1;
      uint64_t RESERVED2:6;
      uint64_t CLR_TX_DMA:1;
      uint64_t CLR_RX_DMA:1;
      uint64_t CLR_RX_DMA_ALL:1;
      uint64_t RESERVED3:5;
      uint64_t CLR_PE_INT:1;
      uint64_t CLR_OE_INT:1;
      uint64_t CLR_FE_INT:1;
      uint64_t RESERVED4:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCICLEARINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_BRKDT_INT_LVL:1;
      uint64_t SET_WAKEUP_INT_LVL:1;
      uint64_t RESERVED1:6;
      uint64_t SET_TX_INT_LVL:1;
      uint64_t SET_RX_INT_LVL:1;
      uint64_t RESERVED2:5;
      uint64_t SET_INC_BR_INT_LVL:1;
      uint64_t RESERVED3:2;
      uint64_t SET_RX_DMA_ALL_INT_LVL:1;
      uint64_t RESERVED4:5;
      uint64_t SET_PE_INT_LVL:1;
      uint64_t SET_OE_INT_LVL:1;
      uint64_t SET_FE_INT_LVL:1;
      uint64_t RESERVED5:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCISETINTLVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_BRKDT_INT_LVL:1;
      uint64_t CLR_WAKEUP_INT_LVL:1;
      uint64_t RESERVED1:6;
      uint64_t CLR_TX_INT_LVL:1;
      uint64_t CLR_RX_INT_LVL:1;
      uint64_t RESERVED2:5;
      uint64_t CLR_INC_BR_INT_LVL:1;
      uint64_t RESERVED3:2;
      uint64_t CLR_RX_DMA_ALL_INT_LVL:1;
      uint64_t RESERVED4:5;
      uint64_t CLR_PE_INT_LVL:1;
      uint64_t CLR_OE_INT_LVL:1;
      uint64_t CLR_FE_INT_LVL:1;
      uint64_t RESERVED5:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCICLEARINTLVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRKDT:1;
      uint64_t WAKEUP:1;
      uint64_t IDLE:1;
      uint64_t Bus_busy_flag:1;
      uint64_t RESERVED1:4;
      uint64_t TXRDY:1;
      uint64_t RXRDY:1;
      uint64_t TXWAKE:1;
      uint64_t TX_EMPTY:1;
      uint64_t RXWAKE:1;
      uint64_t RESERVED2:11;
      uint64_t PE:1;
      uint64_t OE:1;
      uint64_t FE:1;
      uint64_t RESERVED3:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIFLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTVECT0:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIINTVECT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTVECT1:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIINTVECT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHAR:3;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCICHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAUD:24;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIBAUD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ED:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TD:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCITD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_FUNC:1;
      uint64_t RX_FUNC:1;
      uint64_t TX_FUNC:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_DIR:1;
      uint64_t RX_DIR:1;
      uint64_t TX_DIR:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_DATA_IN:1;
      uint64_t RX_DATA_IN:1;
      uint64_t TX_DATA_IN:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_DATA_OUT:1;
      uint64_t RX_DATA_OUT:1;
      uint64_t TX_DATA_OUT:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_DATA_SET:1;
      uint64_t RX_DATA_SET:1;
      uint64_t TX_DATA_SET:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_DATA_CLR:1;
      uint64_t RX_DATA_CLR:1;
      uint64_t TX_DATA_CLR:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_PDR:1;
      uint64_t RX_PDR:1;
      uint64_t TX_PDR:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_PD:1;
      uint64_t RX_PD:1;
      uint64_t TX_PD:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_PSL:1;
      uint64_t RX_PSL:1;
      uint64_t TX_PSL:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESERVED2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESERVED3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESERVED4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESERVED5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESERVED6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESERVED7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESERVED8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESERVED9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_SL:1;
      uint64_t RX_SL:1;
      uint64_t TX_SL:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO9;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXP_ENA:1;
      uint64_t LBP_ENA:1;
      uint64_t RESERVED1:6;
      uint64_t IODFTENA:4;
      uint64_t RESERVED2:4;
      uint64_t TX_SHIFT:3;
      uint64_t PIN_SAMPLE_MASK:2;
      uint64_t RESERVED3:3;
      uint64_t BRKDT_ENA:1;
      uint64_t PEN:1;
      uint64_t FEN:1;
      uint64_t RESERVED4:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIIODCTRL;

