iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_SCIB (*(volatile struct MSS_SCIB_tag *) 0x2f7ed00)

struct MSS_MCANA_ECC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REVMIN:6;
      uint64_t CUSTOM:2;
      uint64_t REVMAJ:3;
      uint64_t REVRTL:5;
      uint64_t MODULE_ID:12;
      uint64_t BU:2;
      uint64_t SCHEME:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REV;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC_VEC:11;
      uint64_t NU0:4;
      uint64_t RD_SVBUS:1;
      uint64_t RD_SVBUS_ADDR:8;
      uint64_t RD_SVBUS_DONE:1;
      uint64_t NU1:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VECTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUM_RAMS:11;
      uint64_t NU2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC_EN:1;
      uint64_t ECC_CHK:1;
      uint64_t EN_RMW:1;
      uint64_t FORCE_SEC:1;
      uint64_t FORCE_DED:1;
      uint64_t FORCE_N_ROW:1;
      uint64_t ERROR_ONCE:1;
      uint64_t CHECK_PARITY:1;
      uint64_t CHECK_TIMEOUT:1;
      uint64_t NU3:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC_ROW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC_BIT1:16;
      uint64_t ECC_BIT2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC_SEC:2;
      uint64_t ECC_DED:2;
      uint64_t ECC_OTHER:1;
      uint64_t ECC_PAR:2;
      uint64_t ECC_CTRL_REG:1;
      uint64_t CLR_ECC_SEC:2;
      uint64_t CLR_ECC_DED:2;
      uint64_t CLR_ECC_OTHER:1;
      uint64_t CLR_ECC_PAR:2;
      uint64_t CLR_ECC_CTRL_REG:1;
      uint64_t ECC_BIT1_STS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_STAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC_ROW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_STAT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU4:1;
      uint64_t TIMEOUT_PEND:1;
      uint64_t NU5:7;
      uint64_t CLR_TIMEOUT_PEND:1;
      uint64_t NU6:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_STAT3;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_EOI_WR:1;
      uint64_t NU7:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_EOI_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_PEND:1;
      uint64_t CTRL_EDC_VBUSS_PEND:1;
      uint64_t NU8:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_STATUS_REG0;

  uint8_t res3[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_EN_SET:1;
      uint64_t CTRL_EDC_VBUSS_ENABLE_SET:1;
      uint64_t NU9:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_ENABLE_SET_REG0;

  uint8_t res4[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_EN_CLR:1;
      uint64_t CTRL_EDC_VBUSS_ENABLE_CLR:1;
      uint64_t NU10:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_ENABLE_CLR_REG0;

  uint8_t res5[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DED_EOI_WR:1;
      uint64_t NU11:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DED_EOI_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DED_PEND:1;
      uint64_t CTRL_EDC_VBUSS_PEND:1;
      uint64_t NU12:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DED_STATUS_REG0;

  uint8_t res6[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DED_EN_SET:1;
      uint64_t CTRL_EDC_VBUSS_ENABLE_SET:1;
      uint64_t NU13:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DED_ENABLE_SET_REG0;

  uint8_t res7[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DED_EN_CLR:1;
      uint64_t CTRL_EDC_VBUSS_ENABLE_CLR:1;
      uint64_t NU14:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DED_ENABLE_CLR_REG0;

  uint8_t res8[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARITY:1;
      uint64_t TIMEOUT:1;
      uint64_t NU15:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AGGR_ENABLE_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARITY:1;
      uint64_t TIMEOUT:1;
      uint64_t NU16:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AGGR_ENABLE_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARITY:2;
      uint64_t TIMEOUT:2;
      uint64_t NU17:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AGGR_STATUS_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARITY:2;
      uint64_t TIMEOUT:2;
      uint64_t NU18:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AGGR_STATUS_CLR;

};

#define MSS_MCANA_ECC (*(volatile struct MSS_MCANA_ECC_tag *) 0x2f7f800)

struct MSS_MCANA_CFG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR:6;
      uint64_t CUSTOM:2;
      uint64_t MAJOR:3;
      uint64_t RTL:5;
      uint64_t MODULE_ID:12;
      uint64_t BU:2;
      uint64_t SCHEME:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU:3;
      uint64_t DBGSUSP_FREE:1;
      uint64_t WAKEUPREGEN:1;
      uint64_t AUTOWAKEUP:1;
      uint64_t EXT_TS_CNTR_EN:1;
      uint64_t NU0:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU:1;
      uint64_t MMI_DONE:1;
      uint64_t EN_FDOE:1;
      uint64_t NU1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICS:1;
      uint64_t NU2:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_ICS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRS:1;
      uint64_t NU3:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_IRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IECS:1;
      uint64_t NU4:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_IECS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IE:1;
      uint64_t NU5:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_IE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IES:1;
      uint64_t NU6:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_IES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOI:8;
      uint64_t NU7:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_EOI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRESCALE:24;
      uint64_t NU8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_EXT_TS_PS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT_TS_INTR_CNTR:5;
      uint64_t NU9:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_EXT_TS_USIC;

  uint8_t res0[468];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAY:8;
      uint64_t MON:8;
      uint64_t YEAR:4;
      uint64_t SUBSTEP:4;
      uint64_t STEP:4;
      uint64_t REL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CREL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENDN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CUST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CUST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSJW:4;
      uint64_t DTSEG2:4;
      uint64_t DTSEG1:5;
      uint64_t NU11:3;
      uint64_t DBRP:5;
      uint64_t NU12:2;
      uint64_t TDC:1;
      uint64_t NU13:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBTP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU14:4;
      uint64_t LBCK:1;
      uint64_t TX:2;
      uint64_t RX:1;
      uint64_t NU15:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDC:8;
      uint64_t WDV:8;
      uint64_t NU16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RWD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t CCE:1;
      uint64_t ASM:1;
      uint64_t CSA:1;
      uint64_t CSR:1;
      uint64_t MON:1;
      uint64_t DAR:1;
      uint64_t TEST:1;
      uint64_t FDOE:1;
      uint64_t BRSE:1;
      uint64_t NU17:2;
      uint64_t PXHD:1;
      uint64_t EFBI:1;
      uint64_t TXP:1;
      uint64_t NU18:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NTSEG2:7;
      uint64_t NU19:1;
      uint64_t NTSEG1:8;
      uint64_t NBRP:9;
      uint64_t NSJW:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NBTP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSS:2;
      uint64_t NU20:14;
      uint64_t TCP:4;
      uint64_t NU21:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSC:16;
      uint64_t NU22:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETOC:1;
      uint64_t TOS:2;
      uint64_t NU23:13;
      uint64_t TOP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TOCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOC:16;
      uint64_t NU24:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TOCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES00:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES01:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES02:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES03:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEC:8;
      uint64_t REC:7;
      uint64_t RP:1;
      uint64_t CEL:8;
      uint64_t NU25:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t ACT:2;
      uint64_t EP:1;
      uint64_t EW:1;
      uint64_t BO:1;
      uint64_t DLEC:3;
      uint64_t RESI:1;
      uint64_t RBRS:1;
      uint64_t RFDF:1;
      uint64_t PXE:1;
      uint64_t NU26:1;
      uint64_t TDCV:7;
      uint64_t NU27:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDCF:7;
      uint64_t NU28:1;
      uint64_t TDCO:7;
      uint64_t NU29:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES04:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF0N:1;
      uint64_t RF0W:1;
      uint64_t RF0F:1;
      uint64_t RF0L:1;
      uint64_t RF1N:1;
      uint64_t RF1W:1;
      uint64_t RF1F:1;
      uint64_t RF1L:1;
      uint64_t HPM:1;
      uint64_t TC:1;
      uint64_t TCF:1;
      uint64_t TFE:1;
      uint64_t TEFN:1;
      uint64_t TEFW:1;
      uint64_t TEFF:1;
      uint64_t TEFL:1;
      uint64_t TSW:1;
      uint64_t MRAF:1;
      uint64_t TOO:1;
      uint64_t DRX:1;
      uint64_t BEC:1;
      uint64_t BEU:1;
      uint64_t ELO:1;
      uint64_t EP:1;
      uint64_t EW:1;
      uint64_t BO:1;
      uint64_t WDI:1;
      uint64_t PEA:1;
      uint64_t PED:1;
      uint64_t ARA:1;
      uint64_t NU30:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF0NE:1;
      uint64_t RF0WE:1;
      uint64_t RF0FE:1;
      uint64_t RF0LE:1;
      uint64_t RF1NE:1;
      uint64_t RF1WE:1;
      uint64_t RF1FE:1;
      uint64_t RF1LE:1;
      uint64_t HPME:1;
      uint64_t TCE:1;
      uint64_t TCFE:1;
      uint64_t TFEE:1;
      uint64_t TEFNE:1;
      uint64_t TEFWE:1;
      uint64_t TEFFE:1;
      uint64_t TEFLE:1;
      uint64_t TSWE:1;
      uint64_t MRAFE:1;
      uint64_t TOOE:1;
      uint64_t DRX:1;
      uint64_t BECE:1;
      uint64_t BEUE:1;
      uint64_t ELOE:1;
      uint64_t EPE:1;
      uint64_t EWE:1;
      uint64_t BOE:1;
      uint64_t WDIE:1;
      uint64_t PEAE:1;
      uint64_t PEDE:1;
      uint64_t ARAE:1;
      uint64_t NU31:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF0NL:1;
      uint64_t RF0WL:1;
      uint64_t RF0FL:1;
      uint64_t RF0LL:1;
      uint64_t RF1NL:1;
      uint64_t RF1WL:1;
      uint64_t RF1FL:1;
      uint64_t RF1LL:1;
      uint64_t HPML:1;
      uint64_t TCL:1;
      uint64_t TCFL:1;
      uint64_t TFEL:1;
      uint64_t TEFNL:1;
      uint64_t TEFWL:1;
      uint64_t TEFFL:1;
      uint64_t TEFLL:1;
      uint64_t TSWL:1;
      uint64_t MRAFL:1;
      uint64_t TOOL:1;
      uint64_t DRXL:1;
      uint64_t BECL:1;
      uint64_t BEUL:1;
      uint64_t ELOL:1;
      uint64_t EPL:1;
      uint64_t EWL:1;
      uint64_t BOL:1;
      uint64_t WDIL:1;
      uint64_t PEAL:1;
      uint64_t PEDL:1;
      uint64_t ARAL:1;
      uint64_t NU32:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ILS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EINT0:1;
      uint64_t EINT1:1;
      uint64_t NU33:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ILE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES05:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES05;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES06:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES06;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES07:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES07;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES08:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES08;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES09:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES09;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES10:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES11:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES12:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RRFE:1;
      uint64_t RRFS:1;
      uint64_t ANFE:2;
      uint64_t ANFS:2;
      uint64_t NU34:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU35:2;
      uint64_t FLSSA_S:14;
      uint64_t LSS_S:8;
      uint64_t NU36:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIDFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU37:2;
      uint64_t FLSSA_X:14;
      uint64_t LSS_X:8;
      uint64_t NU38:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XIDFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES13:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIDM:29;
      uint64_t NU39:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XIDAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BIDX:6;
      uint64_t MSI:2;
      uint64_t FIDX:7;
      uint64_t FLST:1;
      uint64_t NU40:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HPMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ND0_31:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NDAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ND32_63:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NDAT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU41:2;
      uint64_t F0SA:13;
      uint64_t NU42:1;
      uint64_t F0S:7;
      uint64_t NU42_1:1;
      uint64_t F0WM:7;
      uint64_t F0OM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF0C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0FL:7;
      uint64_t NU43:1;
      uint64_t F0GI:6;
      uint64_t NU44:2;
      uint64_t F0PI:6;
      uint64_t NU45:2;
      uint64_t F0F:1;
      uint64_t RF0L:1;
      uint64_t NU46:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF0S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0AI:6;
      uint64_t NU47:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF0A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU48:2;
      uint64_t RBSA:14;
      uint64_t NU49:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXBC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU499:2;
      uint64_t F1SA:13;
      uint64_t NU50:1;
      uint64_t F1S:7;
      uint64_t NU50_1:1;
      uint64_t F1WM:7;
      uint64_t F1OM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF1C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1FL:7;
      uint64_t NU51:1;
      uint64_t F1GI:6;
      uint64_t NU52:2;
      uint64_t F1PI:6;
      uint64_t NU53:2;
      uint64_t F1F:1;
      uint64_t RF1L:1;
      uint64_t NU54:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF1S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1AI:6;
      uint64_t NU55:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXF1A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0DS:3;
      uint64_t NU56:1;
      uint64_t F1DS:3;
      uint64_t NU57:1;
      uint64_t RBDS:3;
      uint64_t NU58:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXESC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU59:2;
      uint64_t TBSA:14;
      uint64_t NDTB:6;
      uint64_t NU60:2;
      uint64_t TFQS:6;
      uint64_t TFQM:1;
      uint64_t NU61:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFFL:6;
      uint64_t NU62:2;
      uint64_t TFGI:5;
      uint64_t NU63:3;
      uint64_t TFQPI:5;
      uint64_t TFQF:1;
      uint64_t NU64:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXFQS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBDS:3;
      uint64_t NU65:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXESC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBTO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBTIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFIE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBCIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES14:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES15:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU66:2;
      uint64_t EFSA:14;
      uint64_t EFS:6;
      uint64_t NU67:2;
      uint64_t EFWM:6;
      uint64_t NU68:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFFL:6;
      uint64_t NU69:2;
      uint64_t EFGI:5;
      uint64_t NU70:3;
      uint64_t EFPI:5;
      uint64_t NU71:3;
      uint64_t EFF:1;
      uint64_t TEFL:1;
      uint64_t NU72:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFAI:5;
      uint64_t NU73:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES16:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES16;

