iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_MCANA_CFG (*(volatile struct MSS_MCANA_CFG_tag *) 0x2f7fc00)

struct TOP_AURORA_TX_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t PROTOCOL_SEL:1;
      uint64_t STRICT_ALIGN:1;
      uint64_t reservedSpace0:13;
      uint64_t NUM_LANES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LANE0_MAP:4;
      uint64_t LANE1_MAP:4;
      uint64_t LANE2_MAP:4;
      uint64_t LANE3_MAP:4;
      uint64_t LANE4_MAP:4;
      uint64_t LANE5_MAP:4;
      uint64_t LANE6_MAP:4;
      uint64_t LANE7_MAP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_LANE_MAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACK_MODE_SEL:2;
      uint64_t reservedSpace0:2;
      uint64_t TWP_IDLE_FILTER_EN:1;
      uint64_t CRC_EN:1;
      uint64_t TWP_SYNC_COMPRESSION_EN:1;
      uint64_t TEST_PATTERN_EN:1;
      uint64_t BYPASS_EN:1;
      uint64_t reservedSpace1:7;
      uint64_t FRAME_HEADER_EN:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIZE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_SIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UDP_FRAME_HEADER15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UFC_MSG_SENT_STS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UFC_MSG_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MESSAGE0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UFC_MESSAGE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MESSAGE1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UFC_MESSAGE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNC_CNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_TWP_SYNC_CNT;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TX_INIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_INITIALIZE_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEND_MSG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_UFC_MSG_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_FLUSH_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_EOP_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DATA_START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_DATA_START_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DATA_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_DATA_STOP_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TEST_PATTERN_START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_TESTPATTERN_START_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TEST_PATTERN_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_TESTPATTERN_STOP_REQ;

  uint8_t res2[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_STATE_OVR_EN:1;
      uint64_t reservedSpace0:3;
      uint64_t TX_STATE_OVR_VAL:4;
      uint64_t SYM_OVR_EN:1;
      uint64_t I0_OVR_TYP:1;
      uint64_t I1_OVR_TYP:1;
      uint64_t I2_OVR_TYP:1;
      uint64_t UFC_SUF_OVR_TYP:1;
      uint64_t INIT_SP0_OVR_TYP:1;
      uint64_t INIT_SP1_OVR_TYP:1;
      uint64_t INIT_SP2_OVR_TYP:1;
      uint64_t INIT_SP3_OVR_TYP:1;
      uint64_t INIT_V0_OVR_TYP:1;
      uint64_t INIT_V1_OVR_TYP:1;
      uint64_t INIT_V2_OVR_TYP:1;
      uint64_t INIT_V3_OVR_TYP:1;
      uint64_t CC0_OVR_TYP:1;
      uint64_t CC1_OVR_TYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_OVERRIDE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I0:8;
      uint64_t I1:8;
      uint64_t I2:8;
      uint64_t UFC_SUF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_8B10B_OVERRIDE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SP0:8;
      uint64_t SP1:8;
      uint64_t SP2:8;
      uint64_t SP3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_8B10B_OVERRIDE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V0:8;
      uint64_t V1:8;
      uint64_t V2:8;
      uint64_t V3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_8B10B_OVERRIDE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC0:8;
      uint64_t CC1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_8B10B_OVERRIDE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDLE_BTF:8;
      uint64_t IDLE_BITS:8;
      uint64_t CB_BTF:8;
      uint64_t CB_BITS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_64B66B_OVERRIDE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UFC_BTF:8;
      uint64_t CC_BTF:8;
      uint64_t CC_BITS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_64B66B_OVERRIDE2_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEP_BTF:8;
      uint64_t SEP7_BTF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_64B66B_OVERRIDE2_1;

