iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LRC_N:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_INIT_CNT_LRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALIGN_LEN:13;
      uint64_t reservedSpace0:3;
      uint64_t ALIGN_MUL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_INIT_CNT_ALIGN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOND_LEN:9;
      uint64_t reservedSpace0:7;
      uint64_t BOND_MUL:4;
      uint64_t rw:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_INIT_CNT_BONDING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VERIFY_LEN:9;
      uint64_t reservedSpace0:7;
      uint64_t VERIFY_MUL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_INIT_CNT_VERIFY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_ALIGNED:1;
      uint64_t TX_BONDED:1;
      uint64_t TX_VERIFIED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_INIT_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SEED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_IDLE_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEND_IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_IDLE_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SEND_CC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_CC_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNC_COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_CC_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CB_COMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_CB_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SEND_CB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_CB_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CB_COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_CB_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_RESET_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_SERIALIZER_OVERRIDE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_SERIALIZER_OVERRIDE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t byte_reverse_en:1;
      uint64_t crc_byte_reverse_en:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_DATA_BYTE_REVERSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_64B66B_SCRAMBLER_INIT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:26;
      uint64_t reservedSpace0:5;
      uint64_t load:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_64B66B_SCRAMBLER_INIT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ramp_en:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_TESTPATTERN_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t count_8b10b:4;
      uint64_t reservedSpace0:12;
      uint64_t count_64b66b:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_CC_SEQ_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t delay:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_EOP_DELAY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t delay:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_FLUSH_DELAY;

  uint8_t res4[132];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_STATE:4;
      uint64_t reservedSpace0:12;
      uint64_t DATAFRAMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_RESET0:1;
      uint64_t TX_RESET1:1;
      uint64_t TX_INIT0:1;
      uint64_t TX_TXCB0:1;
      uint64_t TX_CH_RDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_INIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC_COMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_CC_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDLE_COMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_IDLE_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t int0:1;
      uint64_t int1:1;
      uint64_t int2:1;
      uint64_t int3:1;
      uint64_t int4:1;
      uint64_t int5:1;
      uint64_t int6:1;
      uint64_t int7:1;
      uint64_t int8:1;
      uint64_t int9:1;
      uint64_t int10:1;
      uint64_t int11:1;
      uint64_t int12:1;
      uint64_t int13:1;
      uint64_t int14:1;
      uint64_t int15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_INTAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t int0:1;
      uint64_t int1:1;
      uint64_t int2:1;
      uint64_t int3:1;
      uint64_t int4:1;
      uint64_t int5:1;
      uint64_t int6:1;
      uint64_t int7:1;
      uint64_t int8:1;
      uint64_t int9:1;
      uint64_t int10:1;
      uint64_t int11:1;
      uint64_t int12:1;
      uint64_t int13:1;
      uint64_t int14:1;
      uint64_t int15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_INTAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t int0:1;
      uint64_t int1:1;
      uint64_t int2:1;
      uint64_t int3:1;
      uint64_t int4:1;
      uint64_t int5:1;
      uint64_t int6:1;
      uint64_t int7:1;
      uint64_t int8:1;
      uint64_t int9:1;
      uint64_t int10:1;
      uint64_t int11:1;
      uint64_t int12:1;
      uint64_t int13:1;
      uint64_t int14:1;
      uint64_t int15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_INTAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t err0:1;
      uint64_t err1:1;
      uint64_t err2:1;
      uint64_t err3:1;
      uint64_t err4:1;
      uint64_t err5:1;
      uint64_t err6:1;
      uint64_t err7:1;
      uint64_t err8:1;
      uint64_t err9:1;
      uint64_t err10:1;
      uint64_t err11:1;
      uint64_t err12:1;
      uint64_t err13:1;
      uint64_t err14:1;
      uint64_t err15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_ERRAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t err0:1;
      uint64_t err1:1;
      uint64_t err2:1;
      uint64_t err3:1;
      uint64_t err4:1;
      uint64_t err5:1;
      uint64_t err6:1;
      uint64_t err7:1;
      uint64_t err8:1;
      uint64_t err9:1;
      uint64_t err10:1;
      uint64_t err11:1;
      uint64_t err12:1;
      uint64_t err13:1;
      uint64_t err14:1;
      uint64_t err15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_ERRAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t err0:1;
      uint64_t err1:1;
      uint64_t err2:1;
      uint64_t err3:1;
      uint64_t err4:1;
      uint64_t err5:1;
      uint64_t err6:1;
      uint64_t err7:1;
      uint64_t err8:1;
      uint64_t err9:1;
      uint64_t err10:1;
      uint64_t err11:1;
      uint64_t err12:1;
      uint64_t err13:1;
      uint64_t err14:1;
      uint64_t err15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_ERRAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t status:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_SERIALIZER_STATUS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t status:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_SERIALIZER_STATUS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bytes_packed:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AURORA_TX_TPIU_DATA_PACKED;

  uint8_t res5[3484];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_wph:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_WPH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rec0:1;
      uint64_t hw_spare_rec1:1;
      uint64_t hw_spare_rec2:1;
      uint64_t hw_spare_rec3:1;
      uint64_t hw_spare_rec4:1;
      uint64_t hw_spare_rec5:1;
      uint64_t hw_spare_rec6:1;
      uint64_t hw_spare_rec7:1;
      uint64_t hw_spare_rec8:1;
      uint64_t hw_spare_rec9:1;
      uint64_t hw_spare_rec10:1;
      uint64_t hw_spare_rec11:1;
      uint64_t hw_spare_rec12:1;
      uint64_t hw_spare_rec13:1;
      uint64_t hw_spare_rec14:1;
      uint64_t hw_spare_rec15:1;
      uint64_t hw_spare_rec16:1;
      uint64_t hw_spare_rec17:1;
      uint64_t hw_spare_rec18:1;
      uint64_t hw_spare_rec19:1;
      uint64_t hw_spare_rec20:1;
      uint64_t hw_spare_rec21:1;
      uint64_t hw_spare_rec22:1;
      uint64_t hw_spare_rec23:1;
      uint64_t hw_spare_rec24:1;
      uint64_t hw_spare_rec25:1;
      uint64_t hw_spare_rec26:1;
      uint64_t hw_spare_rec27:1;
      uint64_t hw_spare_rec28:1;
      uint64_t hw_spare_rec29:1;
      uint64_t hw_spare_rec30:1;
      uint64_t hw_spare_rec31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REC;

  uint8_t res6[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_raw_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enabled_status_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eoi;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_type_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b19_8:12;
      uint64_t b31_20:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_attr_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_clear;

