iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define TOP_AURORA_TX (*(volatile struct TOP_AURORA_TX_tag *) 0x3060000)

struct TOP_MDO_INFRA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:1;
      uint64_t snif_mode:1;
      uint64_t crop_en:1;
      uint64_t reservedSpace0:5;
      uint64_t hw_marker_en:4;
      uint64_t hw_flush_en:4;
      uint64_t range_en:4;
      uint64_t gen_marker_on_flush:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_RANGE_START0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_RANGE_END0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_RANGE_START1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_RANGE_END1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_RANGE_START2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_RANGE_END2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_RANGE_START3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_RANGE_END3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t marker:1;
      uint64_t reservedSpace0:3;
      uint64_t flush:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_SW_TRIGGER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t threshold:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t write_mode:1;
      uint64_t reservedSpace0:3;
      uint64_t burst_num:8;
      uint64_t reservedSpace1:4;
      uint64_t burst_size:5;
      uint64_t reservedSpace2:7;
      uint64_t priority:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_BW_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_CHANNEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_GUARANTEED:1;
      uint64_t DATA_MARKED:1;
      uint64_t DATA_TIMESTAMPED:1;
      uint64_t NONDATA_GUARANTEED:1;
      uint64_t NONDATA_TIMESTAMPED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_CHANNEL_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:1;
      uint64_t snif_mode:1;
      uint64_t crop_en:1;
      uint64_t reservedSpace0:5;
      uint64_t hw_marker_en:4;
      uint64_t hw_flush_en:4;
      uint64_t range_en:4;
      uint64_t gen_marker_on_flush:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_RANGE_START0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_RANGE_END0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_RANGE_START1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_RANGE_END1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_RANGE_START2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_RANGE_END2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_RANGE_START3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_RANGE_END3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t marker:1;
      uint64_t reservedSpace0:3;
      uint64_t flush:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_SW_TRIGGER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t threshold:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t write_mode:1;
      uint64_t reservedSpace0:3;
      uint64_t burst_num:8;
      uint64_t reservedSpace1:4;
      uint64_t burst_size:5;
      uint64_t reservedSpace2:7;
      uint64_t priority:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_BW_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_CHANNEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_GUARANTEED:1;
      uint64_t DATA_MARKED:1;
      uint64_t DATA_TIMESTAMPED:1;
      uint64_t NONDATA_GUARANTEED:1;
      uint64_t NONDATA_TIMESTAMPED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_CHANNEL_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:1;
      uint64_t snif_mode:1;
      uint64_t crop_en:1;
      uint64_t reservedSpace0:5;
      uint64_t hw_marker_en:4;
      uint64_t hw_flush_en:4;
      uint64_t range_en:4;
      uint64_t gen_marker_on_flush:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_RANGE_START0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_RANGE_END0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_RANGE_START1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_RANGE_END1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_RANGE_START2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_RANGE_END2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_RANGE_START3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_RANGE_END3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t marker:1;
      uint64_t reservedSpace0:3;
      uint64_t flush:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_SW_TRIGGER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t threshold:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t write_mode:1;
      uint64_t reservedSpace0:3;
      uint64_t burst_num:8;
      uint64_t reservedSpace1:4;
      uint64_t burst_size:5;
      uint64_t reservedSpace2:7;
      uint64_t priority:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_BW_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_CHANNEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_GUARANTEED:1;
      uint64_t DATA_MARKED:1;
      uint64_t DATA_TIMESTAMPED:1;
      uint64_t NONDATA_GUARANTEED:1;
      uint64_t NONDATA_TIMESTAMPED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_CHANNEL_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:1;
      uint64_t snif_mode:1;
      uint64_t crop_en:1;
      uint64_t reservedSpace0:5;
      uint64_t hw_marker_en:4;
      uint64_t hw_flush_en:4;
      uint64_t range_en:4;
      uint64_t gen_marker_on_flush:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_RANGE_START0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_RANGE_END0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_RANGE_START1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_RANGE_END1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_RANGE_START2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_RANGE_END2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_RANGE_START3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_RANGE_END3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t marker:1;
      uint64_t reservedSpace0:3;
      uint64_t flush:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_SW_TRIGGER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t threshold:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t write_mode:1;
      uint64_t reservedSpace0:3;
      uint64_t burst_num:8;
      uint64_t reservedSpace1:4;
      uint64_t burst_size:5;
      uint64_t reservedSpace2:7;
      uint64_t priority:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_BW_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_CHANNEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_GUARANTEED:1;
      uint64_t DATA_MARKED:1;
      uint64_t DATA_TIMESTAMPED:1;
      uint64_t NONDATA_GUARANTEED:1;
      uint64_t NONDATA_TIMESTAMPED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_CHANNEL_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:1;
      uint64_t snif_mode:1;
      uint64_t crop_en:1;
      uint64_t reservedSpace0:1;
      uint64_t port_sel:1;
      uint64_t reservedSpace1:3;
      uint64_t hw_marker_en:4;
      uint64_t hw_flush_en:4;
      uint64_t range_en:4;
      uint64_t gen_marker_on_flush:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_RANGE_START0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_RANGE_END0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_RANGE_START1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_RANGE_END1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_RANGE_START2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_RANGE_END2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_RANGE_START3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_RANGE_END3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t marker:1;
      uint64_t reservedSpace0:3;
      uint64_t flush:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_SW_TRIGGER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t threshold:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t write_mode:1;
      uint64_t reservedSpace0:3;
      uint64_t burst_num:8;
      uint64_t reservedSpace1:4;
      uint64_t burst_size:5;
      uint64_t reservedSpace2:7;
      uint64_t priority:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_BW_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_CHANNEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_GUARANTEED:1;
      uint64_t DATA_MARKED:1;
      uint64_t DATA_TIMESTAMPED:1;
      uint64_t NONDATA_GUARANTEED:1;
      uint64_t NONDATA_TIMESTAMPED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_CHANNEL_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:1;
      uint64_t snif_mode:1;
      uint64_t crop_en:1;
      uint64_t reservedSpace0:5;
      uint64_t hw_marker_en:4;
      uint64_t hw_flush_en:4;
      uint64_t range_en:4;
      uint64_t gen_marker_on_flush:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_RANGE_START0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_RANGE_END0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_RANGE_START1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_RANGE_END1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_RANGE_START2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_RANGE_END2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_RANGE_START3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_RANGE_END3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t marker:1;
      uint64_t reservedSpace0:3;
      uint64_t flush:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_SW_TRIGGER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t threshold:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t write_mode:1;
      uint64_t reservedSpace0:3;
      uint64_t burst_num:8;
      uint64_t reservedSpace1:4;
      uint64_t burst_size:5;
      uint64_t reservedSpace2:7;
      uint64_t priority:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_BW_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_CHANNEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_GUARANTEED:1;
      uint64_t DATA_MARKED:1;
      uint64_t DATA_TIMESTAMPED:1;
      uint64_t NONDATA_GUARANTEED:1;
      uint64_t NONDATA_TIMESTAMPED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_CHANNEL_CFG;

  uint8_t res0[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t flush_done:1;
      uint64_t data_miss:1;
      uint64_t flush_err:1;
      uint64_t overflow_err:1;
      uint64_t reservedSpace0:12;
      uint64_t status:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC0_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t flush_done:1;
      uint64_t data_miss:1;
      uint64_t flush_err:1;
      uint64_t overflow_err:1;
      uint64_t reservedSpace0:12;
      uint64_t status:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t flush_done:1;
      uint64_t data_miss:1;
      uint64_t flush_err:1;
      uint64_t overflow_err:1;
      uint64_t reservedSpace0:12;
      uint64_t status:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC2_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t flush_done:1;
      uint64_t data_miss:1;
      uint64_t flush_err:1;
      uint64_t overflow_err:1;
      uint64_t reservedSpace0:12;
      uint64_t status:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC3_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t flush_done:1;
      uint64_t data_miss:1;
      uint64_t flush_err:1;
      uint64_t overflow_err:1;
      uint64_t reservedSpace0:12;
      uint64_t status:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC4_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t flush_done:1;
      uint64_t data_miss:1;
      uint64_t flush_err:1;
      uint64_t overflow_err:1;
      uint64_t reservedSpace0:12;
      uint64_t status:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC5_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mask:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTERRUPT_MASK;

  uint8_t res1[3552];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_wph:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_WPH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rec0:1;
      uint64_t hw_spare_rec1:1;
      uint64_t hw_spare_rec2:1;
      uint64_t hw_spare_rec3:1;
      uint64_t hw_spare_rec4:1;
      uint64_t hw_spare_rec5:1;
      uint64_t hw_spare_rec6:1;
      uint64_t hw_spare_rec7:1;
      uint64_t hw_spare_rec8:1;
      uint64_t hw_spare_rec9:1;
      uint64_t hw_spare_rec10:1;
      uint64_t hw_spare_rec11:1;
      uint64_t hw_spare_rec12:1;
      uint64_t hw_spare_rec13:1;
      uint64_t hw_spare_rec14:1;
      uint64_t hw_spare_rec15:1;
      uint64_t hw_spare_rec16:1;
      uint64_t hw_spare_rec17:1;
      uint64_t hw_spare_rec18:1;
      uint64_t hw_spare_rec19:1;
      uint64_t hw_spare_rec20:1;
      uint64_t hw_spare_rec21:1;
      uint64_t hw_spare_rec22:1;
      uint64_t hw_spare_rec23:1;
      uint64_t hw_spare_rec24:1;
      uint64_t hw_spare_rec25:1;
      uint64_t hw_spare_rec26:1;
      uint64_t hw_spare_rec27:1;
      uint64_t hw_spare_rec28:1;
      uint64_t hw_spare_rec29:1;
      uint64_t hw_spare_rec30:1;
      uint64_t hw_spare_rec31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REC;

