iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_raw_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enabled_status_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eoi;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_type_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b19_8:12;
      uint64_t b31_20:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_attr_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_clear;

};

#define TOP_MDO_INFRA (*(volatile struct TOP_MDO_INFRA_tag *) 0x3080000)

struct MSS_GPADC_PKT_RAM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST0_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST0_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST1_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST1_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST2_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST2_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST3_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST3_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST4_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST4_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST5_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST5_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST6_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST6_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST7_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST7_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST8_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST8_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST9_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST9_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST10_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST10_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST11_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST11_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST12_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST12_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST13_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST13_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST14_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST14_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST15_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST15_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST16_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST16_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST17_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST17_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST18_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST18_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST19_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST19_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST20_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST20_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST21_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST21_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST22_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST22_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST23_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST23_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST24_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST24_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST25_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST25_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST26_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST26_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST27_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST27_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST28_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST28_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST29_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST29_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST30_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST30_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST31_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST31_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST32_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST32_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST33_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST33_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST34_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST34_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST35_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST35_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST36_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST36_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST37_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST37_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST38_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST38_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST39_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST39_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST40_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST40_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST41_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST41_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST42_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST42_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST43_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST43_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST44_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST44_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST45_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST45_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST46_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST46_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST47_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST47_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST48_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST48_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST49_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST49_1;

