iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST105_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST105_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST106_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST106_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST107_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST107_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST108_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST108_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST109_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST109_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST110_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST110_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST111_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST111_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST112_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST112_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST113_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST113_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST114_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST114_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST115_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST115_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST116_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST116_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST117_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST117_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST118_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST118_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST119_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST119_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST120_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST120_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST121_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST121_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST122_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST122_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST123_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST123_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST124_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST124_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST125_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST125_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST126_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST126_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST127_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST127_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST128_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST128_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST129_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST129_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST130_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST130_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST131_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST131_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST132_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST132_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST133_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST133_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST134_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST134_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST135_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST135_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST136_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST136_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST137_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST137_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST138_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST138_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST139_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST139_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST140_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST140_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST141_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST141_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST142_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST142_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST143_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST143_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST144_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST144_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST145_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST145_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST146_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST146_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST147_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST147_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST148_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST148_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST149_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST149_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST150_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST150_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST151_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST151_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST152_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST152_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST153_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST153_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST154_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST154_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST155_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST155_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST156_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST156_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST157_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST157_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST158_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST158_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST159_0;

