iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST159_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST160_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST160_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST161_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST161_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST162_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST162_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST163_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST163_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST164_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST164_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST165_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST165_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST166_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST166_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST167_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST167_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST168_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST168_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST169_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST169_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST170_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST170_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST171_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST171_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST172_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST172_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST173_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST173_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST174_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST174_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST175_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST175_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST176_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST176_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST177_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST177_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST178_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST178_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST179_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST179_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST180_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST180_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST181_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST181_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST182_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST182_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST183_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST183_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST184_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST184_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST185_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST185_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST186_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST186_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST187_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST187_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST188_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST188_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST189_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST189_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST190_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST190_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST191_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST191_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST192_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST192_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST193_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST193_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST194_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST194_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST195_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST195_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST196_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST196_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST197_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST197_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST198_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST198_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST199_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST199_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST200_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST200_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST201_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST201_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST202_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST202_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST203_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST203_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST204_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST204_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST205_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST205_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST206_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST206_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST207_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST207_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST208_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST208_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST209_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST209_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST210_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST210_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST211_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST211_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST212_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST212_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST213_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST213_1;

