iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST214_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST214_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST215_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST215_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST216_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST216_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST217_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST217_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST218_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST218_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST219_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST219_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST220_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST220_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST221_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST221_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST222_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST222_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST223_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST223_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST224_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST224_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST225_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST225_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST226_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST226_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST227_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST227_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST228_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST228_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST229_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST229_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST230_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST230_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST231_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST231_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST232_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST232_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST233_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST233_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST234_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST234_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST235_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST235_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST236_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST236_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST237_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST237_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST238_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST238_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST239_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST239_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST240_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST240_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST241_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST241_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST242_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST242_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST243_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST243_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST244_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST244_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST245_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST245_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST246_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST246_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST247_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST247_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST248_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST248_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST249_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST249_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST250_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST250_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST251_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST251_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST252_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST252_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST253_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST253_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST254_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST254_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST255_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:8;
      uint64_t COLLECT_SAMPLES:8;
      uint64_t SKIP_SAMPLES:7;
      uint64_t CHIRP_BRK:1;
      uint64_t NU1:1;
      uint64_t NU2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INST255_1;

