iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_GPADC_PKT_RAM (*(volatile struct MSS_GPADC_PKT_RAM_tag *) 0x30c0000)

struct TOP_CTRL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AURORATX_SRC_SELECT:1;
      uint64_t reservedSpace0:3;
      uint64_t SRC_SELECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDO_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t sel:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PROBE_BUS_SEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t sel:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PROBE_BUS_SEL1;

  uint8_t res0[496];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_DIEID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_DIEID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_DIEID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_DIEID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_UID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_UID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_UID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_UID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_DEVICE_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_FROM0_CHECKSUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_ROM_SEQ_UPDATE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_ROM_SEQ_UPDATE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_ROM_SEQ_UPDATE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_ROM_SEQ_UPDATE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_ROM_SEQ_UPDATE4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_ROM_SEQ_UPDATE5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_ROM_SEQ_UPDATE6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_ROM_SEQ_UPDATE7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t val:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_ROM_SEQ_UPDATE8;

  uint8_t res1[436];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE0_ROW_61:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE0_ROW_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE0_ROW_62:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE0_ROW_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE0_ROW_63:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE0_ROW_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_5:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_7:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_8:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_9:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_10:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_11:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_12:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_13:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_14:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_15:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_16:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_17:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_18:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_19:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_20:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_21:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_22:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_23:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_24:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_25:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_26:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_27:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_28:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_29:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_30:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_31:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_32:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_33:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_34:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_35:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_36:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_37:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_38:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_39:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_40:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_41:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_42:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE1_ROW_43:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE1_ROW_43;

  uint8_t res2[856];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
      uint64_t reservedSpace0:1;
      uint64_t override_val:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_HSM_HALT_ON_ROM_ECC_ERR_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t glg_margin_override:3;
      uint64_t reservedSpace0:1;
      uint64_t glg_margin:2;
      uint64_t reservedSpace1:2;
      uint64_t gwg_margin_override:3;
      uint64_t reservedSpace2:1;
      uint64_t gwg_margin:4;
      uint64_t byg_margin_override:3;
      uint64_t reservedSpace3:1;
      uint64_t byg_margin:2;
      uint64_t reservedSpace4:2;
      uint64_t brg_margin_override:3;
      uint64_t reservedSpace5:1;
      uint64_t brg_margin:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_MEM_MARGINCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
      uint64_t reservedSpace0:1;
      uint64_t override_val:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_LVDS_BGAP_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_XTAL_STABLIZATION_WAIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_SLICER_BIAS_RTRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_XO_OUTPUT_DRIVE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_RCOSC_TRIM_CODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_IP1_BG1_RTRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_IP1_BG1_SLOPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_IP1_BG1_MAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
      uint64_t reservedSpace0:1;
      uint64_t override_val:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_RS232_CLKMODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_VMON_VDD_OV_UV_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_VMON_VDDS_3P3_UV_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_VMON_VDDA_OSC_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_VDD_VT_DET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_MASK_CPU_CLK_OUT_CTRL_LOWV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_MASK_CPU_CLK_OUT_CTRL_LOWV_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_EN_VOL_MON_FUNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override:3;
      uint64_t reservedSpace0:1;
      uint64_t override_val:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE_OVERRIDE_BYPASS_HOLDBUFFER_ENABLE;

  uint8_t res3[1924];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_wph:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_WPH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rec0:1;
      uint64_t hw_spare_rec1:1;
      uint64_t hw_spare_rec2:1;
      uint64_t hw_spare_rec3:1;
      uint64_t hw_spare_rec4:1;
      uint64_t hw_spare_rec5:1;
      uint64_t hw_spare_rec6:1;
      uint64_t hw_spare_rec7:1;
      uint64_t hw_spare_rec8:1;
      uint64_t hw_spare_rec9:1;
      uint64_t hw_spare_rec10:1;
      uint64_t hw_spare_rec11:1;
      uint64_t hw_spare_rec12:1;
      uint64_t hw_spare_rec13:1;
      uint64_t hw_spare_rec14:1;
      uint64_t hw_spare_rec15:1;
      uint64_t hw_spare_rec16:1;
      uint64_t hw_spare_rec17:1;
      uint64_t hw_spare_rec18:1;
      uint64_t hw_spare_rec19:1;
      uint64_t hw_spare_rec20:1;
      uint64_t hw_spare_rec21:1;
      uint64_t hw_spare_rec22:1;
      uint64_t hw_spare_rec23:1;
      uint64_t hw_spare_rec24:1;
      uint64_t hw_spare_rec25:1;
      uint64_t hw_spare_rec26:1;
      uint64_t hw_spare_rec27:1;
      uint64_t hw_spare_rec28:1;
      uint64_t hw_spare_rec29:1;
      uint64_t hw_spare_rec30:1;
      uint64_t hw_spare_rec31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REC;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_raw_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enabled_status_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eoi;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_type_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b19_8:12;
      uint64_t b31_20:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_attr_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_clear;

