iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res5[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFCNTRLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSRCBREF;

  uint8_t res6[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t reservedSpace0:2;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b17_12:6;
      uint64_t reservedSpace3:2;
      uint64_t b20_20:1;
      uint64_t reservedSpace4:1;
      uint64_t b22_22:1;
      uint64_t reservedSpace5:5;
      uint64_t b29_28:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFOPT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b22_0:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFACNT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFDST0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFBIDX0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:4;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFMPPRXY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFBCNT0;

  uint8_t res7[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t reservedSpace0:2;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b17_12:6;
      uint64_t reservedSpace3:2;
      uint64_t b20_20:1;
      uint64_t reservedSpace4:1;
      uint64_t b22_22:1;
      uint64_t reservedSpace5:5;
      uint64_t b29_28:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFOPT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b22_0:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFACNT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFDST1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFBIDX1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:4;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFMPPRXY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFBCNT1;

};

#define MSS_TPTC_B0 (*(volatile struct MSS_TPTC_B0_tag *) 0x3180000)

struct MSS_PCR2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS0_PROT_SET:1;
      uint64_t PCS1_PROT_SET:1;
      uint64_t PCS2_PROT_SET:1;
      uint64_t PCS3_PROT_SET:1;
      uint64_t PCS4_PROT_SET:1;
      uint64_t PCS5_PROT_SET:1;
      uint64_t PCS6_PROT_SET:1;
      uint64_t PCS7_PROT_SET:1;
      uint64_t PCS8_PROT_SET:1;
      uint64_t PCS9_PROT_SET:1;
      uint64_t PCS10_PROT_SET:1;
      uint64_t PCS11_PROT_SET:1;
      uint64_t PCS12_PROT_SET:1;
      uint64_t PCS13_PROT_SET:1;
      uint64_t PCS14_PROT_SET:1;
      uint64_t PCS15_PROT_SET:1;
      uint64_t PCS16_PROT_SET:1;
      uint64_t PCS17_PROT_SET:1;
      uint64_t PCS18_PROT_SET:1;
      uint64_t PCS19_PROT_SET:1;
      uint64_t PCS20_PROT_SET:1;
      uint64_t PCS21_PROT_SET:1;
      uint64_t PCS22_PROT_SET:1;
      uint64_t PCS23_PROT_SET:1;
      uint64_t PCS24_PROT_SET:1;
      uint64_t PCS25_PROT_SET:1;
      uint64_t PCS26_PROT_SET:1;
      uint64_t PCS27_PROT_SET:1;
      uint64_t PCS28_PROT_SET:1;
      uint64_t PCS29_PROT_SET:1;
      uint64_t PCS30_PROT_SET:1;
      uint64_t PCS31_PROT_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTSET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS32_PROT_SET:1;
      uint64_t PCS33_PROT_SET:1;
      uint64_t PCS34_PROT_SET:1;
      uint64_t PCS35_PROT_SET:1;
      uint64_t PCS36_PROT_SET:1;
      uint64_t PCS37_PROT_SET:1;
      uint64_t PCS38_PROT_SET:1;
      uint64_t PCS39_PROT_SET:1;
      uint64_t PCS40_PROT_SET:1;
      uint64_t PCS41_PROT_SET:1;
      uint64_t PCS42_PROT_SET:1;
      uint64_t PCS43_PROT_SET:1;
      uint64_t PCS44_PROT_SET:1;
      uint64_t PCS45_PROT_SET:1;
      uint64_t PCS46_PROT_SET:1;
      uint64_t PCS47_PROT_SET:1;
      uint64_t PCS48_PROT_SET:1;
      uint64_t PCS49_PROT_SET:1;
      uint64_t PCS50_PROT_SET:1;
      uint64_t PCS51_PROT_SET:1;
      uint64_t PCS52_PROT_SET:1;
      uint64_t PCS53_PROT_SET:1;
      uint64_t PCS54_PROT_SET:1;
      uint64_t PCS55_PROT_SET:1;
      uint64_t PCS56_PROT_SET:1;
      uint64_t PCS57_PROT_SET:1;
      uint64_t PCS58_PROT_SET:1;
      uint64_t PCS59_PROT_SET:1;
      uint64_t PCS60_PROT_SET:1;
      uint64_t PCS61_PROT_SET:1;
      uint64_t PCS62_PROT_SET:1;
      uint64_t PCS63_PROT_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTSET1;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS0_PROT_CLR:1;
      uint64_t PCS1_PROT_CLR:1;
      uint64_t PCS2_PROT_CLR:1;
      uint64_t PCS3_PROT_CLR:1;
      uint64_t PCS4_PROT_CLR:1;
      uint64_t PCS5_PROT_CLR:1;
      uint64_t PCS6_PROT_CLR:1;
      uint64_t PCS7_PROT_CLR:1;
      uint64_t PCS8_PROT_CLR:1;
      uint64_t PCS9_PROT_CLR:1;
      uint64_t PCS10_PROT_CLR:1;
      uint64_t PCS11_PROT_CLR:1;
      uint64_t PCS12_PROT_CLR:1;
      uint64_t PCS13_PROT_CLR:1;
      uint64_t PCS14_PROT_CLR:1;
      uint64_t PCS15_PROT_CLR:1;
      uint64_t PCS16_PROT_CLR:1;
      uint64_t PCS17_PROT_CLR:1;
      uint64_t PCS18_PROT_CLR:1;
      uint64_t PCS19_PROT_CLR:1;
      uint64_t PCS20_PROT_CLR:1;
      uint64_t PCS21_PROT_CLR:1;
      uint64_t PCS22_PROT_CLR:1;
      uint64_t PCS23_PROT_CLR:1;
      uint64_t PCS24_PROT_CLR:1;
      uint64_t PCS25_PROT_CLR:1;
      uint64_t PCS26_PROT_CLR:1;
      uint64_t PCS27_PROT_CLR:1;
      uint64_t PCS28_PROT_CLR:1;
      uint64_t PCS29_PROT_CLR:1;
      uint64_t PCS30_PROT_CLR:1;
      uint64_t PCS31_PROT_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTCLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS32_PROT_CLR:1;
      uint64_t PCS33_PROT_CLR:1;
      uint64_t PCS34_PROT_CLR:1;
      uint64_t PCS35_PROT_CLR:1;
      uint64_t PCS36_PROT_CLR:1;
      uint64_t PCS37_PROT_CLR:1;
      uint64_t PCS38_PROT_CLR:1;
      uint64_t PCS39_PROT_CLR:1;
      uint64_t PCS40_PROT_CLR:1;
      uint64_t PCS41_PROT_CLR:1;
      uint64_t PCS42_PROT_CLR:1;
      uint64_t PCS43_PROT_CLR:1;
      uint64_t PCS44_PROT_CLR:1;
      uint64_t PCS45_PROT_CLR:1;
      uint64_t PCS46_PROT_CLR:1;
      uint64_t PCS47_PROT_CLR:1;
      uint64_t PCS48_PROT_CLR:1;
      uint64_t PCS49_PROT_CLR:1;
      uint64_t PCS50_PROT_CLR:1;
      uint64_t PCS51_PROT_CLR:1;
      uint64_t PCS52_PROT_CLR:1;
      uint64_t PCS53_PROT_CLR:1;
      uint64_t PCS54_PROT_CLR:1;
      uint64_t PCS55_PROT_CLR:1;
      uint64_t PCS56_PROT_CLR:1;
      uint64_t PCS57_PROT_CLR:1;
      uint64_t PCS58_PROT_CLR:1;
      uint64_t PCS59_PROT_CLR:1;
      uint64_t PCS60_PROT_CLR:1;
      uint64_t PCS61_PROT_CLR:1;
      uint64_t PCS62_PROT_CLR:1;
      uint64_t PCS63_PROT_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTCLR1;

