iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_ETPWMB (*(volatile struct MSS_ETPWMB_tag *) 0x3f78d00)

struct MSS_ETPWMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBCTL_CTRMODE:2;
      uint64_t TBCTL_PHSEN:1;
      uint64_t TBCTL_PRDLD:1;
      uint64_t TBCTL_SYNCOSEL:2;
      uint64_t TBCTL_SWFSYNC:1;
      uint64_t TBCTL_HSPCLKDIV:3;
      uint64_t TBCTL_CLKDIV:3;
      uint64_t TBCTL_PHSDIR:1;
      uint64_t TBCTL_FREE_SOFT:2;
      uint64_t TBSTS_CTRDIR:1;
      uint64_t TBSTS_SYNCI:1;
      uint64_t TBSTS_CTRMAX:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBCTL_TBSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved:16;
      uint64_t TBPHS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBPHS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBCTR:16;
      uint64_t TBPRD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBCTR_TBPRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved1:16;
      uint64_t LOADAMODE:2;
      uint64_t LOADBMODE:2;
      uint64_t SHDWAMODE:1;
      uint64_t Reserved2:1;
      uint64_t SHDWBMODE:1;
      uint64_t Reserved3:1;
      uint64_t SHDWAFULL:1;
      uint64_t SHDWBFULL:1;
      uint64_t Reserved4:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved:16;
      uint64_t CMPA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPB:16;
      uint64_t AQCTLA_ZRO:2;
      uint64_t AQCTLA_PRD:2;
      uint64_t AQCTLA_CAU:2;
      uint64_t AQCTLA_CAD:2;
      uint64_t AQCTLA_CBU:2;
      uint64_t AQCTLA_CBD:2;
      uint64_t Reserved:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPB_AQCTLA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AQCTLB_ZRO:2;
      uint64_t AQCTLB_PRD:2;
      uint64_t AQCTLB_CAU:2;
      uint64_t AQCTLB_CAD:2;
      uint64_t AQCTLB_CBU:2;
      uint64_t AQCTLB_CBD:2;
      uint64_t Reserved2:4;
      uint64_t AQSFRC_ACTSFA:2;
      uint64_t AQSFRC_OTSFA:1;
      uint64_t AQSFRC_ACTSFB:2;
      uint64_t AQSFRC_OTSFB:1;
      uint64_t AQSFRC_RLDCSF:2;
      uint64_t Reserved1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AQCTLB_AQSFRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AQCSFRC_CSFA:2;
      uint64_t AQCSFRC_CSFB:2;
      uint64_t Reserved2:12;
      uint64_t DBCTL_OUT_MODE:2;
      uint64_t DBCTL_POLSEL:2;
      uint64_t DBCTL_IN_MODE:2;
      uint64_t Reserved1:9;
      uint64_t DBCTL_HALFCYCLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AQCSFRC_DBCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBRED_DEL:10;
      uint64_t Reserved2:6;
      uint64_t DBFED_DEL:10;
      uint64_t Reserved1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBRED_DBFED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TZSEL_CBC1:1;
      uint64_t TZSEL_CBC2:1;
      uint64_t TZSEL_CBC3:1;
      uint64_t TZSEL_CBC4:1;
      uint64_t TZSEL_CBC5:1;
      uint64_t TZSEL_CBC6:1;
      uint64_t TZSEL_DCAEVT2:1;
      uint64_t TZSEL_DCBEVT2:1;
      uint64_t TZSEL_OSHT1:1;
      uint64_t TZSEL_OSHT2:1;
      uint64_t TZSEL_OSHT3:1;
      uint64_t TZSEL_OSHT4:1;
      uint64_t TZSEL_OSHT5:1;
      uint64_t TZSEL_OSHT6:1;
      uint64_t TZSEL_DCAEVT1:1;
      uint64_t TZSEL_DCBEVT1:1;
      uint64_t TZDCSEL_DCAEVT1:3;
      uint64_t TZDCSEL_DCAEVT2:3;
      uint64_t TZDCSEL_DCBEVT1:3;
      uint64_t TZDCSEL_DCBEVT2:3;
      uint64_t Reserved1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TZSEL_TZDCSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TZCTL_TZA:2;
      uint64_t TZCTL_TZB:2;
      uint64_t TZCTL_DCAEVT1:2;
      uint64_t TZCTL_DCAEVT2:2;
      uint64_t TZCTL_DCBEVT1:2;
      uint64_t TZCTL_DCBEVT2:2;
      uint64_t Reserved1:4;
      uint64_t Reserved2:1;
      uint64_t TZEINT_CBC:1;
      uint64_t TZEINT_OST:1;
      uint64_t TZEINT_DCAEVT1:1;
      uint64_t TZEINT_DCAEVT2:1;
      uint64_t TZEINT_DCBEVT1:1;
      uint64_t TZEINT_DCBEVT2:1;
      uint64_t Reserved3:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TZCTL_TZEINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TZFLG_INT:1;
      uint64_t TZFLG_CBC:1;
      uint64_t TZFLG_OST:1;
      uint64_t TZFLG_DCAEVT1:1;
      uint64_t TZFLG_DCAEVT2:1;
      uint64_t TZFLG_DCBEVT1:1;
      uint64_t TZFLG_DCBEVT2:1;
      uint64_t Reserved2:9;
      uint64_t TZCLR_INT:1;
      uint64_t TZCLR_CBC:1;
      uint64_t TZCLR_OST:1;
      uint64_t TZCLR_DCAEVT1:1;
      uint64_t TZCLR_DCAEVT2:1;
      uint64_t TZCLR_DCBEVT1:1;
      uint64_t TZCLR_DCBEVT2:1;
      uint64_t Reserved1:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TZFLG_TZCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved2:1;
      uint64_t TZFRC_CBC:1;
      uint64_t TZFRC_OST:1;
      uint64_t TZFRC_DCAEVT1:1;
      uint64_t TZFRC_DCAEVT2:1;
      uint64_t TZFRC_DCBEVT1:1;
      uint64_t TZFRC_DCBEVT2:1;
      uint64_t Reserved3:9;
      uint64_t ETSEL_INTSEL:3;
      uint64_t ETSEL_INTEN:1;
      uint64_t Reserved1:4;
      uint64_t ETSEL_SOCASEL:3;
      uint64_t ETSEL_SOCAEN:1;
      uint64_t ETSEL_SOCBSEL:3;
      uint64_t ETSEL_SOCBEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TZFRC_ETSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETPS_INTPRD:2;
      uint64_t ETPS_INTCNT:2;
      uint64_t Reserved3:4;
      uint64_t ETPS_SOCAPRD:2;
      uint64_t ETPS_SOCACNT:2;
      uint64_t ETPS_SOCBPRD:2;
      uint64_t ETPS_SOCBCNT:2;
      uint64_t ETFLG_INT:1;
      uint64_t Reserved1:1;
      uint64_t ETFLG_SOCA:1;
      uint64_t ETFLG_SOCB:1;
      uint64_t Reserved2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETPS_ETFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETCLR_INT:1;
      uint64_t Reserved1:1;
      uint64_t ETCLR_SOCA:1;
      uint64_t ETCLR_SOCB:1;
      uint64_t Reserved2:12;
      uint64_t ETFRC_INT:1;
      uint64_t Reserved3:1;
      uint64_t ETFRC_SOCA:1;
      uint64_t ETFRC_SOCB:1;
      uint64_t Reserved4:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETCLR_ETFRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHPEN:1;
      uint64_t OSHTWTH:4;
      uint64_t CHPFREQ:3;
      uint64_t CHPDUTY:3;
      uint64_t Reserved:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Reserved1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Reserved2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Reserved3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Reserved4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Reserved5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Reserved6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Reserved7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Reserved8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCTRIPSEL_DCAHCOMPSEL:4;
      uint64_t DCTRIPSEL_DCALCOMPSEL:4;
      uint64_t DCTRIPSEL_DCBHCOMPSEL:4;
      uint64_t DCTRIPSEL_DCBLCOMPSEL:4;
      uint64_t DCACTL_EVT1SRCSEL:1;
      uint64_t DCACTL_EVT1FRC_SYNCSEL:1;
      uint64_t DCACTL_EVT1SOCE:1;
      uint64_t DCACTL_EVT1SYNCE:1;
      uint64_t Reserved1:4;
      uint64_t DCACTL_EVT2SRCSEL:1;
      uint64_t DCACTL_EVT2FRC_SYNCSEL:1;
      uint64_t Reserved2:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCTRIPSEL_DCACTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCBCTL_EVT1SRCSEL:1;
      uint64_t DCBCTL_EVT1FRC_SYNCSEL:1;
      uint64_t DCBCTL_EVT1SOCE:1;
      uint64_t DCBCTL_EVT1SYNCE:1;
      uint64_t Reserved1:4;
      uint64_t DCBCTL_EVT2SRCSEL:1;
      uint64_t DCBCTL_EVT2FRC_SYNCSEL:1;
      uint64_t Reserved2:6;
      uint64_t DCFCTL_SRCSEL:2;
      uint64_t DCFCTL_BLANKE:1;
      uint64_t DCFCTL_BLANKINV:1;
      uint64_t DCFCTL_PULSESEL:2;
      uint64_t Reserved3:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCBCTL_DCFCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCCAPCTL_CAPE:1;
      uint64_t DCCAPCTL_SHDWMODE:1;
      uint64_t Reserved:14;
      uint64_t DCFOFFSET_OFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCAPCTL_DCFOFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCFOFFSETCNT_OFFSETCNT:16;
      uint64_t DCFWINDOW_WINDOW:8;
      uint64_t Reserved1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCFOFFSETCNT_DCFWINDOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCFWINDOWCNT:8;
      uint64_t Reserved1:8;
      uint64_t DCCAP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCFWINDOWCNT_DCCAP;

