iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_ETPWMC (*(volatile struct MSS_ETPWMC_tag *) 0x3f78e00)

struct MSS_GPADC_REG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCBIST_MODE:2;
      uint64_t NU1:6;
      uint64_t GPADC_FSM_CLK_ENABLE:1;
      uint64_t GPADC2ADCBUF_PATH_EN:3;
      uint64_t NU2:4;
      uint64_t GPADC_DEBUG_MODE_ENABLE:1;
      uint64_t NU3:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPADC_TRIGGER:1;
      uint64_t NU1:7;
      uint64_t GPADC_INIT:1;
      uint64_t NU2:7;
      uint64_t GPADC_FSM_BYPASS:1;
      uint64_t NU3:7;
      uint64_t GPADC_START_BYP_VAL:1;
      uint64_t NU4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_VALUE_IFM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM_VAL_IFM:8;
      uint64_t COLLECT_SAMPLES_IFM:8;
      uint64_t SKIP_SAMPLES_IFM:7;
      uint64_t NU:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKT_RAM_BASE_ADDR_CP0:8;
      uint64_t PKT_RAM_BASE_ADDR_CP1:8;
      uint64_t PKT_RAM_BASE_ADDR_CP2:8;
      uint64_t PKT_RAM_BASE_ADDR_CP3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKT_RAM_BASE_ADDR_CP4:8;
      uint64_t PKT_RAM_BASE_ADDR_CP5:8;
      uint64_t PKT_RAM_BASE_ADDR_CP6:8;
      uint64_t PKT_RAM_BASE_ADDR_CP7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKT_RAM_BASE_ADDR_CP8:8;
      uint64_t PKT_RAM_BASE_ADDR_CP9:8;
      uint64_t PKT_RAM_BASE_ADDR_CP10:8;
      uint64_t PKT_RAM_BASE_ADDR_CP11:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKT_RAM_BASE_ADDR_CP12:8;
      uint64_t PKT_RAM_BASE_ADDR_CP13:8;
      uint64_t PKT_RAM_BASE_ADDR_CP14:8;
      uint64_t PKT_RAM_BASE_ADDR_CP15:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPADC_CLK_DIV:8;
      uint64_t GPADC_CLK_ENABLE:1;
      uint64_t NU:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM_NOT_USED_TX_ENA1_OFF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM_NOT_USED_TX_ENA2_OFF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM_NOT_USED_TX_ENA3_OFF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRAM_ECC_ENABLE:1;
      uint64_t NU1:7;
      uint64_t DRAM_ECC_ERR_CLR:1;
      uint64_t NU2:7;
      uint64_t DRAM_ECC_ERR_ADDR:8;
      uint64_t DRAM_REPAIRED_BIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPARE_WR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUM_IFM:20;
      uint64_t NU:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIN_GPADC:10;
      uint64_t NU1:6;
      uint64_t MAX_GPADC:10;
      uint64_t NU2:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPADC_MEM_INIT_DONE_STAT:1;
      uint64_t NU:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPADC_IFM_DONE_STATUS:1;
      uint64_t NU:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPADC_IFM_DONE_CLR:1;
      uint64_t NU:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPADC_SAMPLES_FRAME:16;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPARE_RD1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPARE_RD2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPARE_WR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG22;

};

#define MSS_GPADC_REG (*(volatile struct MSS_GPADC_REG_tag *) 0x3f79800)

struct MSS_DMM_A_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ONOFF:4;
      uint64_t Reserved1:4;
      uint64_t TM_DMM:1;
      uint64_t DDM_WIDTH:2;
      uint64_t Reserved2:5;
      uint64_t RESET:1;
      uint64_t COS:1;
      uint64_t CONTCLK:1;
      uint64_t Reserved3:5;
      uint64_t BUSY:1;
      uint64_t Reserved4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLBCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACKET_ERR_INT:1;
      uint64_t DEST0_ERRENA:1;
      uint64_t DEST1_ERRENA:1;
      uint64_t DEST2_ERRENA:1;
      uint64_t DEST3_ERRENA:1;
      uint64_t SRC_OVF:1;
      uint64_t BUFF_OVF:1;
      uint64_t BUSERROR:1;
      uint64_t DEST0REG1:1;
      uint64_t DEST0REG2:1;
      uint64_t DEST1REG1:1;
      uint64_t DEST1REG2:1;
      uint64_t DEST2REG1:1;
      uint64_t DEST2REG2:1;
      uint64_t DEST3REG1:1;
      uint64_t DEST3REG2:1;
      uint64_t EO_BUFF:1;
      uint64_t PROG_BUFF:1;
      uint64_t Reserved:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACKET_ERR_INT:1;
      uint64_t DEST0_ERRENA:1;
      uint64_t DEST1_ERRENA:1;
      uint64_t DEST2_ERRENA:1;
      uint64_t DEST3_ERRENA:1;
      uint64_t SRC_OVF:1;
      uint64_t BUFF_OVF:1;
      uint64_t BUSERROR:1;
      uint64_t DEST0REG1:1;
      uint64_t DEST0REG2:1;
      uint64_t DEST1REG1:1;
      uint64_t DEST1REG2:1;
      uint64_t DEST2REG1:1;
      uint64_t DEST2REG2:1;
      uint64_t DEST3REG1:1;
      uint64_t DEST3REG2:1;
      uint64_t EO_BUFF:1;
      uint64_t PROG_BUFF:1;
      uint64_t Reserved:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACKET_ERR_INT:1;
      uint64_t DEST0_ERRENA:1;
      uint64_t DEST1_ERRENA:1;
      uint64_t DEST2_ERRENA:1;
      uint64_t DEST3_ERRENA:1;
      uint64_t SRC_OVF:1;
      uint64_t BUFF_OVF:1;
      uint64_t BUSERROR:1;
      uint64_t DEST0REG1:1;
      uint64_t DEST0REG2:1;
      uint64_t DEST1REG1:1;
      uint64_t DEST1REG2:1;
      uint64_t DEST2REG1:1;
      uint64_t DEST2REG2:1;
      uint64_t DEST3REG1:1;
      uint64_t DEST3REG2:1;
      uint64_t EO_BUFF:1;
      uint64_t PROG_BUFF:1;
      uint64_t Reserved:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTLVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACKET_ERR_INT:1;
      uint64_t DEST0_ERRENA:1;
      uint64_t DEST1_ERRENA:1;
      uint64_t DEST2_ERRENA:1;
      uint64_t DEST3_ERRENA:1;
      uint64_t SRC_OVF:1;
      uint64_t BUFF_OVF:1;
      uint64_t BUSERROR:1;
      uint64_t DEST0REG1:1;
      uint64_t DEST0REG2:1;
      uint64_t DEST1REG1:1;
      uint64_t DEST1REG2:1;
      uint64_t DEST2REG1:1;
      uint64_t DEST2REG2:1;
      uint64_t DEST3REG1:1;
      uint64_t DEST3REG2:1;
      uint64_t EO_BUFF:1;
      uint64_t PROG_BUFF:1;
      uint64_t Reserved:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTFLAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET:5;
      uint64_t Reserved:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET:5;
      uint64_t Reserved:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDMDEST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDMBL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POINTER:15;
      uint64_t Reserved:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDMPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPT:15;
      uint64_t Reserved:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST0REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST0BL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST0REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST0BL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST1REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST1BL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST1REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST1BL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST2REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST2BL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST2REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST2BL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST3REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST3BL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST3REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST3BL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCFUNC:1;
      uint64_t CLKFUNC:1;
      uint64_t DATAxFUNC:16;
      uint64_t ENAFUNC:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCDIR:1;
      uint64_t CLKDIR:1;
      uint64_t DATAxDIR:16;
      uint64_t ENADIR:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCIN:1;
      uint64_t CLKIN:1;
      uint64_t DATAxIN:16;
      uint64_t ENAIN:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCOUT:1;
      uint64_t CLKOUT:1;
      uint64_t DATAxOUT:16;
      uint64_t ENAOUT:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCSET:1;
      uint64_t CLKSET:1;
      uint64_t DATAxSET:16;
      uint64_t ENASET:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCCLR:1;
      uint64_t CLKCLR:1;
      uint64_t DATAxCLR:16;
      uint64_t ENACLR:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCPDR:1;
      uint64_t CLKPDR:1;
      uint64_t DATAxPDR:16;
      uint64_t ENAPDR:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCPDIS:1;
      uint64_t CLKPDIS:1;
      uint64_t DATAxPDIS:16;
      uint64_t ENAPDIS:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCPSEL:1;
      uint64_t CLKPDSEL:1;
      uint64_t DATAxPSEL:16;
      uint64_t ENAPSEL:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC8;

