iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_DMM_A (*(volatile struct MSS_DMM_A_tag *) 0x3f79c00)

struct MSS_DMM_B_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ONOFF:4;
      uint64_t Reserved1:4;
      uint64_t TM_DMM:1;
      uint64_t DDM_WIDTH:2;
      uint64_t Reserved2:5;
      uint64_t RESET:1;
      uint64_t COS:1;
      uint64_t CONTCLK:1;
      uint64_t Reserved3:5;
      uint64_t BUSY:1;
      uint64_t Reserved4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLBCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACKET_ERR_INT:1;
      uint64_t DEST0_ERRENA:1;
      uint64_t DEST1_ERRENA:1;
      uint64_t DEST2_ERRENA:1;
      uint64_t DEST3_ERRENA:1;
      uint64_t SRC_OVF:1;
      uint64_t BUFF_OVF:1;
      uint64_t BUSERROR:1;
      uint64_t DEST0REG1:1;
      uint64_t DEST0REG2:1;
      uint64_t DEST1REG1:1;
      uint64_t DEST1REG2:1;
      uint64_t DEST2REG1:1;
      uint64_t DEST2REG2:1;
      uint64_t DEST3REG1:1;
      uint64_t DEST3REG2:1;
      uint64_t EO_BUFF:1;
      uint64_t PROG_BUFF:1;
      uint64_t Reserved:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACKET_ERR_INT:1;
      uint64_t DEST0_ERRENA:1;
      uint64_t DEST1_ERRENA:1;
      uint64_t DEST2_ERRENA:1;
      uint64_t DEST3_ERRENA:1;
      uint64_t SRC_OVF:1;
      uint64_t BUFF_OVF:1;
      uint64_t BUSERROR:1;
      uint64_t DEST0REG1:1;
      uint64_t DEST0REG2:1;
      uint64_t DEST1REG1:1;
      uint64_t DEST1REG2:1;
      uint64_t DEST2REG1:1;
      uint64_t DEST2REG2:1;
      uint64_t DEST3REG1:1;
      uint64_t DEST3REG2:1;
      uint64_t EO_BUFF:1;
      uint64_t PROG_BUFF:1;
      uint64_t Reserved:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACKET_ERR_INT:1;
      uint64_t DEST0_ERRENA:1;
      uint64_t DEST1_ERRENA:1;
      uint64_t DEST2_ERRENA:1;
      uint64_t DEST3_ERRENA:1;
      uint64_t SRC_OVF:1;
      uint64_t BUFF_OVF:1;
      uint64_t BUSERROR:1;
      uint64_t DEST0REG1:1;
      uint64_t DEST0REG2:1;
      uint64_t DEST1REG1:1;
      uint64_t DEST1REG2:1;
      uint64_t DEST2REG1:1;
      uint64_t DEST2REG2:1;
      uint64_t DEST3REG1:1;
      uint64_t DEST3REG2:1;
      uint64_t EO_BUFF:1;
      uint64_t PROG_BUFF:1;
      uint64_t Reserved:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTLVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACKET_ERR_INT:1;
      uint64_t DEST0_ERRENA:1;
      uint64_t DEST1_ERRENA:1;
      uint64_t DEST2_ERRENA:1;
      uint64_t DEST3_ERRENA:1;
      uint64_t SRC_OVF:1;
      uint64_t BUFF_OVF:1;
      uint64_t BUSERROR:1;
      uint64_t DEST0REG1:1;
      uint64_t DEST0REG2:1;
      uint64_t DEST1REG1:1;
      uint64_t DEST1REG2:1;
      uint64_t DEST2REG1:1;
      uint64_t DEST2REG2:1;
      uint64_t DEST3REG1:1;
      uint64_t DEST3REG2:1;
      uint64_t EO_BUFF:1;
      uint64_t PROG_BUFF:1;
      uint64_t Reserved:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTFLAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET:5;
      uint64_t Reserved:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET:5;
      uint64_t Reserved:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDMDEST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDMBL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POINTER:15;
      uint64_t Reserved:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDMPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPT:15;
      uint64_t Reserved:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST0REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST0BL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST0REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST0BL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST1REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST1BL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST1REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST1BL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST2REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST2BL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST2REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST2BL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST3REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST3BL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST3REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
      uint64_t Reserved:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEST3BL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCFUNC:1;
      uint64_t CLKFUNC:1;
      uint64_t DATAxFUNC:16;
      uint64_t ENAFUNC:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCDIR:1;
      uint64_t CLKDIR:1;
      uint64_t DATAxDIR:16;
      uint64_t ENADIR:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCIN:1;
      uint64_t CLKIN:1;
      uint64_t DATAxIN:16;
      uint64_t ENAIN:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCOUT:1;
      uint64_t CLKOUT:1;
      uint64_t DATAxOUT:16;
      uint64_t ENAOUT:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCSET:1;
      uint64_t CLKSET:1;
      uint64_t DATAxSET:16;
      uint64_t ENASET:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCCLR:1;
      uint64_t CLKCLR:1;
      uint64_t DATAxCLR:16;
      uint64_t ENACLR:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCPDR:1;
      uint64_t CLKPDR:1;
      uint64_t DATAxPDR:16;
      uint64_t ENAPDR:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCPDIS:1;
      uint64_t CLKPDIS:1;
      uint64_t DATAxPDIS:16;
      uint64_t ENAPDIS:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCPSEL:1;
      uint64_t CLKPDSEL:1;
      uint64_t DATAxPSEL:16;
      uint64_t ENAPSEL:1;
      uint64_t Reserved:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC8;

