iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_MCANB_CFG (*(volatile struct MSS_MCANB_CFG_tag *) 0x3f7fc00)

struct RCSS_RCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREVIOUS_NAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_I2CA_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_I2CB_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SCIA_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIA_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIB_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_ATL_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPA_REF0_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPA_REF1_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPA_AUX_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPB_REF0_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPB_REF1_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPB_AUX_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPC_REF0_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPC_REF1_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPC_AUX_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_I2CA_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_I2CB_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SCIA_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIA_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIB_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_ATL_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPA_REF0_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPA_REF1_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPA_AUX_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPB_REF0_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPB_REF1_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPB_AUX_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPC_REF0_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPC_REF1_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPC_AUX_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_I2CA_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_I2CB_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SCIA_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIA_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIB_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_ATL_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPA_REF0_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPA_REF1_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPA_AUX_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPB_REF0_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPB_REF1_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPB_AUX_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPC_REF0_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPC_REF1_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPC_AUX_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_ECAP_SYS_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_SYS_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_SYS_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_I2CA_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_I2CB_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SCIA_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIA_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIB_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_ATL_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPA_REF0_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPA_REF1_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPA_AUX_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPB_REF0_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPB_REF1_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPB_AUX_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPC_REF0_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPC_REF1_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPC_AUX_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_ECAP_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_I2CA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_I2CB_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SCIA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIB_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPB_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_MCASPC_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_GIO_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
      uint64_t reservedSpace0:1;
      uint64_t tpcca_assert:3;
      uint64_t reservedSpace1:1;
      uint64_t tptca0_assert:3;
      uint64_t reservedSpace2:1;
      uint64_t tptca1_assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_EDMA_RST_CTRL;

  uint8_t res0[3724];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_wph:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_WPH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rec0:1;
      uint64_t hw_spare_rec1:1;
      uint64_t hw_spare_rec2:1;
      uint64_t hw_spare_rec3:1;
      uint64_t hw_spare_rec4:1;
      uint64_t hw_spare_rec5:1;
      uint64_t hw_spare_rec6:1;
      uint64_t hw_spare_rec7:1;
      uint64_t hw_spare_rec8:1;
      uint64_t hw_spare_rec9:1;
      uint64_t hw_spare_rec10:1;
      uint64_t hw_spare_rec11:1;
      uint64_t hw_spare_rec12:1;
      uint64_t hw_spare_rec13:1;
      uint64_t hw_spare_rec14:1;
      uint64_t hw_spare_rec15:1;
      uint64_t hw_spare_rec16:1;
      uint64_t hw_spare_rec17:1;
      uint64_t hw_spare_rec18:1;
      uint64_t hw_spare_rec19:1;
      uint64_t hw_spare_rec20:1;
      uint64_t hw_spare_rec21:1;
      uint64_t hw_spare_rec22:1;
      uint64_t hw_spare_rec23:1;
      uint64_t hw_spare_rec24:1;
      uint64_t hw_spare_rec25:1;
      uint64_t hw_spare_rec26:1;
      uint64_t hw_spare_rec27:1;
      uint64_t hw_spare_rec28:1;
      uint64_t hw_spare_rec29:1;
      uint64_t hw_spare_rec30:1;
      uint64_t hw_spare_rec31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REC;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_raw_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enabled_status_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eoi;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_type_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b19_8:12;
      uint64_t b31_20:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_attr_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_clear;

