iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define RCSS_RCM (*(volatile struct RCSS_RCM_tag *) 0x5000000)

struct RCSS_CTRL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_errint:1;
      uint64_t tpcc_a_mpint:1;
      uint64_t tptc_a0_err:1;
      uint64_t tptc_a1_err:1;
      uint64_t reservedSpace0:4;
      uint64_t tpcc_a_parity_err:1;
      uint64_t reservedSpace1:7;
      uint64_t tpcc_a_write_access_error:1;
      uint64_t tptc_a0_write_access_error:1;
      uint64_t tptc_a1_write_access_error:1;
      uint64_t reservedSpace2:5;
      uint64_t tpcc_a_read_access_error:1;
      uint64_t tptc_a0_read_access_error:1;
      uint64_t tptc_a1_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPCC_A_ERRAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_errint:1;
      uint64_t tpcc_a_mpint:1;
      uint64_t tptc_a0_err:1;
      uint64_t tptc_a1_err:1;
      uint64_t reservedSpace0:4;
      uint64_t tpcc_a_parity_err:1;
      uint64_t reservedSpace1:7;
      uint64_t tpcc_a_write_access_error:1;
      uint64_t tptc_a0_write_access_error:1;
      uint64_t tptc_a1_write_access_error:1;
      uint64_t reservedSpace2:5;
      uint64_t tpcc_a_read_access_error:1;
      uint64_t tptc_a0_read_access_error:1;
      uint64_t tptc_a1_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPCC_A_ERRAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_errint:1;
      uint64_t tpcc_a_mpint:1;
      uint64_t tptc_a0_err:1;
      uint64_t tptc_a1_err:1;
      uint64_t reservedSpace0:4;
      uint64_t tpcc_a_parity_err:1;
      uint64_t reservedSpace1:7;
      uint64_t tpcc_a_write_access_error:1;
      uint64_t tptc_a0_write_access_error:1;
      uint64_t tptc_a1_write_access_error:1;
      uint64_t reservedSpace2:5;
      uint64_t tpcc_a_read_access_error:1;
      uint64_t tptc_a0_read_access_error:1;
      uint64_t tptc_a1_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPCC_A_ERRAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_intg:1;
      uint64_t tpcc_a_int0:1;
      uint64_t tpcc_a_int1:1;
      uint64_t tpcc_a_int2:1;
      uint64_t tpcc_a_int3:1;
      uint64_t tpcc_a_int4:1;
      uint64_t tpcc_a_int5:1;
      uint64_t tpcc_a_int6:1;
      uint64_t tpcc_a_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_a0:1;
      uint64_t tptc_a1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPCC_A_INTAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_intg:1;
      uint64_t tpcc_a_int0:1;
      uint64_t tpcc_a_int1:1;
      uint64_t tpcc_a_int2:1;
      uint64_t tpcc_a_int3:1;
      uint64_t tpcc_a_int4:1;
      uint64_t tpcc_a_int5:1;
      uint64_t tpcc_a_int6:1;
      uint64_t tpcc_a_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_a0:1;
      uint64_t tptc_a1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPCC_A_INTAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_intg:1;
      uint64_t tpcc_a_int0:1;
      uint64_t tpcc_a_int1:1;
      uint64_t tpcc_a_int2:1;
      uint64_t tpcc_a_int3:1;
      uint64_t tpcc_a_int4:1;
      uint64_t tpcc_a_int5:1;
      uint64_t tpcc_a_int6:1;
      uint64_t tpcc_a_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_a0:1;
      uint64_t tptc_a1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPCC_A_INTAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t trig_spia:12;
      uint64_t reservedSpace0:4;
      uint64_t trig_spib:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPI_TRIG_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_init:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIA_MEMINIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIA_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIA_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_init:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIB_MEMINIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIB_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mem0_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIB_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_meminit_start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPCC_MEMINIT_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_meminit_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPCC_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_meminit_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPCC_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t spiasync2sen:3;
      uint64_t reservedSpace0:5;
      uint64_t spia_cs_trigsrc_en:1;
      uint64_t reservedSpace1:7;
      uint64_t spia_trig_gate_en:1;
      uint64_t reservedSpace2:7;
      uint64_t spia_int_trig_polarity:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIA_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t spibsync2sen:3;
      uint64_t reservedSpace0:5;
      uint64_t spib_cs_trigsrc_en:1;
      uint64_t reservedSpace1:7;
      uint64_t spib_trig_gate_en:1;
      uint64_t reservedSpace2:7;
      uint64_t spib_int_trig_polarity:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIB_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cs_deact:3;
      uint64_t reservedSpace0:5;
      uint64_t cs_pol:3;
      uint64_t reservedSpace1:5;
      uint64_t miso_oen_by_cs:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIA_IOCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cs_deact:3;
      uint64_t reservedSpace0:5;
      uint64_t cs_pol:3;
      uint64_t reservedSpace1:5;
      uint64_t miso_oen_by_cs:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPIB_IOCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t host_irq:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_SPI_HOST_IRQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tptc_a0:2;
      uint64_t tptc_a1:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPTC_DBS_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t parity_en:1;
      uint64_t parity_testen:1;
      uint64_t parity_err_clr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPCC_A_PARITY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t parity_addr:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPCC_A_PARITY_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t lane_enable:5;
      uint64_t reservedSpace0:3;
      uint64_t mwait:1;
      uint64_t reservedSpace1:7;
      uint64_t sign_ext_en:1;
      uint64_t eof_intr0_sel:3;
      uint64_t eof_intr1_sel:3;
      uint64_t reservedSpace2:1;
      uint64_t sof_intr0_sel:3;
      uint64_t reservedSpace3:1;
      uint64_t sof_intr1_sel:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t lane_enable:5;
      uint64_t reservedSpace0:3;
      uint64_t mwait:1;
      uint64_t reservedSpace1:7;
      uint64_t sign_ext_en:1;
      uint64_t eof_intr0_sel:3;
      uint64_t eof_intr1_sel:3;
      uint64_t reservedSpace2:1;
      uint64_t sof_intr0_sel:3;
      uint64_t reservedSpace3:1;
      uint64_t sof_intr1_sel:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_CTX0_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_CTX1_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_CTX2_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_CTX3_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_CTX4_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_CTX5_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_CTX6_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_CTX7_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ctx_parity_en:1;
      uint64_t reservedSpace0:15;
      uint64_t fifo_parity_en:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_PARITY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ctx_parity_addr:4;
      uint64_t reservedSpace0:12;
      uint64_t fifo_parity_addr:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_PARITY_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_CTX0_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_CTX1_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_CTX2_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_CTX3_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_CTX4_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_CTX5_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_CTX6_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t num_lines:16;
      uint64_t enable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_CTX7_LINE_PING_PONG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ctx_parity_en:1;
      uint64_t reservedSpace0:15;
      uint64_t fifo_parity_en:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_PARITY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ctx_parity_addr:4;
      uint64_t reservedSpace0:12;
      uint64_t fifo_parity_addr:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_PARITY_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dx0_enbpu:1;
      uint64_t dx0_enbpd:1;
      uint64_t dx0_in:1;
      uint64_t dx0_ie:1;
      uint64_t dx0_isoin:1;
      uint64_t dx0_isoclkin:1;
      uint64_t dx0_wuin:1;
      uint64_t dx0_wuclkin:1;
      uint64_t dx0_wuen:1;
      uint64_t dx0_wuevnt:1;
      uint64_t dx0_isoout:1;
      uint64_t dx0_isoclkout:1;
      uint64_t dx0_wuout:1;
      uint64_t dx0_wuclkout:1;
      uint64_t dy0_enbpu:1;
      uint64_t dy0_enbpd:1;
      uint64_t dy0_in:1;
      uint64_t dy0_ie:1;
      uint64_t dy0_wuen:1;
      uint64_t dy0_wuevnt:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_LANE0_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dx1_enbpu:1;
      uint64_t dx1_enbpd:1;
      uint64_t dx1_in:1;
      uint64_t dx1_ie:1;
      uint64_t dx1_isoin:1;
      uint64_t dx1_isoclkin:1;
      uint64_t dx1_wuin:1;
      uint64_t dx1_wuclkin:1;
      uint64_t dx1_wuen:1;
      uint64_t dx1_wuevnt:1;
      uint64_t dx1_isoout:1;
      uint64_t dx1_isoclkout:1;
      uint64_t dx1_wuout:1;
      uint64_t dx1_wuclkout:1;
      uint64_t dy1_enbpu:1;
      uint64_t dy1_enbpd:1;
      uint64_t dy1_in:1;
      uint64_t dy1_ie:1;
      uint64_t dy1_wuen:1;
      uint64_t dy1_wuevnt:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_LANE1_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dx2_enbpu:1;
      uint64_t dx2_enbpd:1;
      uint64_t dx2_in:1;
      uint64_t dx2_ie:1;
      uint64_t dx2_isoin:1;
      uint64_t dx2_isoclkin:1;
      uint64_t dx2_wuin:1;
      uint64_t dx2_wuclkin:1;
      uint64_t dx2_wuen:1;
      uint64_t dx2_wuevnt:1;
      uint64_t reservedSpace0:4;
      uint64_t dy2_enbpu:1;
      uint64_t dy2_enbpd:1;
      uint64_t dy2_in:1;
      uint64_t dy2_ie:1;
      uint64_t dy2_wuen:1;
      uint64_t dy2_wuevnt:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_LANE2_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dx3_enbpu:1;
      uint64_t dx3_enbpd:1;
      uint64_t dx3_in:1;
      uint64_t dx3_ie:1;
      uint64_t dx3_isoin:1;
      uint64_t dx3_isoclkin:1;
      uint64_t dx3_wuin:1;
      uint64_t dx3_wuclkin:1;
      uint64_t dx3_wuen:1;
      uint64_t dx3_wuevnt:1;
      uint64_t dx3_isoout:1;
      uint64_t dx3_isoclkout:1;
      uint64_t dx3_wuout:1;
      uint64_t dx3_wuclkout:1;
      uint64_t dy3_enbpu:1;
      uint64_t dy3_enbpd:1;
      uint64_t dy3_in:1;
      uint64_t dy3_ie:1;
      uint64_t dy3_wuen:1;
      uint64_t dy3_wuevnt:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_LANE3_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dx4_enbpu:1;
      uint64_t dx4_enbpd:1;
      uint64_t dx4_in:1;
      uint64_t dx4_ie:1;
      uint64_t dx4_isoin:1;
      uint64_t dx4_isoclkin:1;
      uint64_t dx4_wuin:1;
      uint64_t dx4_wuclkin:1;
      uint64_t dx4_wuen:1;
      uint64_t dx4_wuevnt:1;
      uint64_t dx4_isoout:1;
      uint64_t dx4_isoclkout:1;
      uint64_t dx4_wuout:1;
      uint64_t dx4_wuclkout:1;
      uint64_t dy4_enbpu:1;
      uint64_t dy4_enbpd:1;
      uint64_t dy4_in:1;
      uint64_t dy4_ie:1;
      uint64_t dy4_wuen:1;
      uint64_t dy4_wuevnt:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_LANE4_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dx0_enbpu:1;
      uint64_t dx0_enbpd:1;
      uint64_t dx0_in:1;
      uint64_t dx0_ie:1;
      uint64_t dx0_isoin:1;
      uint64_t dx0_isoclkin:1;
      uint64_t dx0_wuin:1;
      uint64_t dx0_wuclkin:1;
      uint64_t dx0_wuen:1;
      uint64_t dx0_wuevnt:1;
      uint64_t dx0_isoout:1;
      uint64_t dx0_isoclkout:1;
      uint64_t dx0_wuout:1;
      uint64_t dx0_wuclkout:1;
      uint64_t dy0_enbpu:1;
      uint64_t dy0_enbpd:1;
      uint64_t dy0_in:1;
      uint64_t dy0_ie:1;
      uint64_t dy0_wuen:1;
      uint64_t dy0_wuevnt:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_LANE0_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dx1_enbpu:1;
      uint64_t dx1_enbpd:1;
      uint64_t dx1_in:1;
      uint64_t dx1_ie:1;
      uint64_t dx1_isoin:1;
      uint64_t dx1_isoclkin:1;
      uint64_t dx1_wuin:1;
      uint64_t dx1_wuclkin:1;
      uint64_t dx1_wuen:1;
      uint64_t dx1_wuevnt:1;
      uint64_t dx1_isoout:1;
      uint64_t dx1_isoclkout:1;
      uint64_t dx1_wuout:1;
      uint64_t dx1_wuclkout:1;
      uint64_t dy1_enbpu:1;
      uint64_t dy1_enbpd:1;
      uint64_t dy1_in:1;
      uint64_t dy1_ie:1;
      uint64_t dy1_wuen:1;
      uint64_t dy1_wuevnt:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_LANE1_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dx2_enbpu:1;
      uint64_t dx2_enbpd:1;
      uint64_t dx2_in:1;
      uint64_t dx2_ie:1;
      uint64_t dx2_isoin:1;
      uint64_t dx2_isoclkin:1;
      uint64_t dx2_wuin:1;
      uint64_t dx2_wuclkin:1;
      uint64_t dx2_wuen:1;
      uint64_t dx2_wuevnt:1;
      uint64_t reservedSpace0:4;
      uint64_t dy2_enbpu:1;
      uint64_t dy2_enbpd:1;
      uint64_t dy2_in:1;
      uint64_t dy2_ie:1;
      uint64_t dy2_wuen:1;
      uint64_t dy2_wuevnt:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_LANE2_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dx3_enbpu:1;
      uint64_t dx3_enbpd:1;
      uint64_t dx3_in:1;
      uint64_t dx3_ie:1;
      uint64_t dx3_isoin:1;
      uint64_t dx3_isoclkin:1;
      uint64_t dx3_wuin:1;
      uint64_t dx3_wuclkin:1;
      uint64_t dx3_wuen:1;
      uint64_t dx3_wuevnt:1;
      uint64_t dx3_isoout:1;
      uint64_t dx3_isoclkout:1;
      uint64_t dx3_wuout:1;
      uint64_t dx3_wuclkout:1;
      uint64_t dy3_enbpu:1;
      uint64_t dy3_enbpd:1;
      uint64_t dy3_in:1;
      uint64_t dy3_ie:1;
      uint64_t dy3_wuen:1;
      uint64_t dy3_wuevnt:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_LANE3_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dx4_enbpu:1;
      uint64_t dx4_enbpd:1;
      uint64_t dx4_in:1;
      uint64_t dx4_ie:1;
      uint64_t dx4_isoin:1;
      uint64_t dx4_isoclkin:1;
      uint64_t dx4_wuin:1;
      uint64_t dx4_wuclkin:1;
      uint64_t dx4_wuen:1;
      uint64_t dx4_wuevnt:1;
      uint64_t dx4_isoout:1;
      uint64_t dx4_isoclkout:1;
      uint64_t dx4_wuout:1;
      uint64_t dx4_wuclkout:1;
      uint64_t dy4_enbpu:1;
      uint64_t dy4_enbpd:1;
      uint64_t dy4_in:1;
      uint64_t dy4_ie:1;
      uint64_t dy4_wuen:1;
      uint64_t dy4_wuevnt:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_LANE4_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_FIFO_MEMINIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_FIFO_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_FIFO_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_CTX_MEMINIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_CTX_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2A_CTX_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_FIFO_MEMINIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_FIFO_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_FIFO_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_CTX_MEMINIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_CTX_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_CSI2B_CTX_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:1;
      uint64_t clk_disable:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCSS_CSI2A_MDMA:1;
      uint64_t RCSS_CSI2B_MDMA:1;
      uint64_t RCSS_PCR_bitfield:1;
      uint64_t RCSS_MCASPA:1;
      uint64_t RCSS_MCASPB:1;
      uint64_t RCSS_MCASPC:1;
      uint64_t RCSS_TPTC_A0_RD:1;
      uint64_t RCSS_TPTC_A1_RD:1;
      uint64_t RCSS_TPTC_A0_WR:1;
      uint64_t RCSS_TPTC_A1_WR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_BUS_SAFETY_SEC_ERR_STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPTCA0_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPTCA0_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPTCA0_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPTCA0_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPTCA0_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPTCA0_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSS_TPTCA1_RD_BUS_SAFETY_CTRL;

