iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t OFST:12;
      uint64_t RES21:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_DAT_OFST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_DAT_PING_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_DAT_PONG_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES23:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES22:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_IRQENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES25:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES24:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_NUMBER:16;
      uint64_t ALPHA:14;
      uint64_t Reserved:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX_EN:1;
      uint64_t LINE_MODULO:1;
      uint64_t VP_FORCE:1;
      uint64_t PING_PONG:1;
      uint64_t COUNT_UNLOCK:1;
      uint64_t CS_EN:1;
      uint64_t EOL_EN:1;
      uint64_t EOF_EN:1;
      uint64_t COUNT:8;
      uint64_t FEC_NUMBER:8;
      uint64_t TRANSCODE:4;
      uint64_t HSCALE:1;
      uint64_t RES19:1;
      uint64_t GENERIC:1;
      uint64_t BYTESWAP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX6_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORMAT:10;
      uint64_t DPCM_PRED:1;
      uint64_t VIRTUAL_ID:2;
      uint64_t USER_DEF_MAPPING:2;
      uint64_t RES20:1;
      uint64_t FRAME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX6_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t OFST:12;
      uint64_t RES21:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX6_DAT_OFST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX6_DAT_PING_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX6_DAT_PONG_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES23:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES22:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX6_IRQENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES25:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES24:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX6_IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_NUMBER:16;
      uint64_t ALPHA:14;
      uint64_t Reserved:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX6_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX_EN:1;
      uint64_t LINE_MODULO:1;
      uint64_t VP_FORCE:1;
      uint64_t PING_PONG:1;
      uint64_t COUNT_UNLOCK:1;
      uint64_t CS_EN:1;
      uint64_t EOL_EN:1;
      uint64_t EOF_EN:1;
      uint64_t COUNT:8;
      uint64_t FEC_NUMBER:8;
      uint64_t TRANSCODE:4;
      uint64_t HSCALE:1;
      uint64_t RES19:1;
      uint64_t GENERIC:1;
      uint64_t BYTESWAP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX7_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORMAT:10;
      uint64_t DPCM_PRED:1;
      uint64_t VIRTUAL_ID:2;
      uint64_t USER_DEF_MAPPING:2;
      uint64_t RES20:1;
      uint64_t FRAME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX7_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t OFST:12;
      uint64_t RES21:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX7_DAT_OFST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX7_DAT_PING_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX7_DAT_PONG_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES23:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES22:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX7_IRQENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES25:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES24:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX7_IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_NUMBER:16;
      uint64_t ALPHA:14;
      uint64_t Reserved:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX7_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THS_SETTLE:8;
      uint64_t THS_TERM:8;
      uint64_t RESERVED:8;
      uint64_t HS_CLK_CONFIG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_PHY_CFG_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCLK_SETTLE:8;
      uint64_t CTRLCLK_DIV_FACT:2;
      uint64_t D_PHY_HS_SYNC_PAT:8;
      uint64_t TCLK_TERM:7;
      uint64_t CLK_MISS_DET:1;
      uint64_t RSVD1:2;
      uint64_t RESETDONERXBYTECLK:1;
      uint64_t RESETDONECTRLCLK:1;
      uint64_t RSVD2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_PHY_CFG_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCP2_SYNC_PAT:24;
      uint64_t RXTRIGGERESC3:2;
      uint64_t RXTRIGGERESC2:2;
      uint64_t RXTRIGGERESC1:2;
      uint64_t RXTRIGGERESC0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_PHY_CFG_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RECAL_BIAS:1;
      uint64_t RECAL_HS_RX:1;
      uint64_t RSVD1:1;
      uint64_t OVR_ENCCP_TO_HSRX:1;
      uint64_t OVR_ENCCP_TO_ANAT:1;
      uint64_t ENBIAS:1;
      uint64_t OVR_ENBIAS:1;
      uint64_t ENLDO:1;
      uint64_t OVR_ENLDO:1;
      uint64_t ENULPRX:5;
      uint64_t ENLPRX:5;
      uint64_t OVR_ENLPRX:1;
      uint64_t ENRXTERM:5;
      uint64_t OVR_ENRXTERM:1;
      uint64_t ENHSRX:5;
      uint64_t OVR_ENHSRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_PHY_CFG_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSVD1:1;
      uint64_t BYPASS_EFUSE:1;
      uint64_t TRIM_TERM_LANE0:5;
      uint64_t TRIM_TERM_LANE1:5;
      uint64_t TRIM_TERM_LANE2:5;
      uint64_t TRIM_TERM_LANE3:5;
      uint64_t TRIM_TERM_LANE4:5;
      uint64_t TRIM_BIAS_GEN:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_PHY_CFG_REG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSVD1:1;
      uint64_t BYPASS_CALIB_OFFSET:1;
      uint64_t TRIM_OFFSET_LANE0_HS_RX:6;
      uint64_t TRIM_OFFSET_LANE1_HS_RX:6;
      uint64_t TRIM_OFFSET_LANE2_HS_RX:6;
      uint64_t TRIM_OFFSET_LANE3_HS_RX:6;
      uint64_t TRIM_OFFSET_LANE4_HS_RX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_PHY_CFG_REG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BIASGEN_CAL_OVR_VAL:5;
      uint64_t BIASGEN_CAL_OVR:1;
      uint64_t RSVD1:1;
      uint64_t OBSV_BIAS_CURR_DXA:1;
      uint64_t OBSV_LDO_VOLT_DYA:1;
      uint64_t BYPASS_LDO_REG:1;
      uint64_t HSCOMOOUT:1;
      uint64_t AFE_LANE_POL:1;
      uint64_t AFE_LANE_SEL:8;
      uint64_t OVR_AFE_LANE_ADR_POL:1;
      uint64_t RSVD2:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_PHY_CFG_REG6;

  uint8_t res2[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSKIP:13;
      uint64_t RSVD1:3;
      uint64_t HCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX0_TRANSCODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSKIP:13;
      uint64_t RSVD1:3;
      uint64_t VCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX0_TRANSCODEV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSKIP:13;
      uint64_t RSVD1:3;
      uint64_t HCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX1_TRANSCODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSKIP:13;
      uint64_t RSVD1:3;
      uint64_t VCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX1_TRANSCODEV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSKIP:13;
      uint64_t RSVD1:3;
      uint64_t HCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX2_TRANSCODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSKIP:13;
      uint64_t RSVD1:3;
      uint64_t VCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX2_TRANSCODEV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSKIP:13;
      uint64_t RSVD1:3;
      uint64_t HCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX3_TRANSCODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSKIP:13;
      uint64_t RSVD1:3;
      uint64_t VCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX3_TRANSCODEV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSKIP:13;
      uint64_t RSVD1:3;
      uint64_t HCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX4_TRANSCODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSKIP:13;
      uint64_t RSVD1:3;
      uint64_t VCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX4_TRANSCODEV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSKIP:13;
      uint64_t RSVD1:3;
      uint64_t HCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_TRANSCODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSKIP:13;
      uint64_t RSVD1:3;
      uint64_t VCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_TRANSCODEV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSKIP:13;
      uint64_t RSVD1:3;
      uint64_t HCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX6_TRANSCODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSKIP:13;
      uint64_t RSVD1:3;
      uint64_t VCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX6_TRANSCODEV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSKIP:13;
      uint64_t RSVD1:3;
      uint64_t HCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX7_TRANSCODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSKIP:13;
      uint64_t RSVD1:3;
      uint64_t VCOUNT:13;
      uint64_t RSVD2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX7_TRANSCODEV;

