iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define RCSS_CSI2A (*(volatile struct RCSS_CSI2A_tag *) 0x5080000)

struct RCSS_CSI2B_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REV:8;
      uint64_t RES1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_REVISION;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTO_IDLE:1;
      uint64_t SOFT_RESET:1;
      uint64_t RES3:10;
      uint64_t MSTANDBY_MODE:2;
      uint64_t RES2:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_SYSCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET_DONE:1;
      uint64_t RES4:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_SYSSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONTEXT0:1;
      uint64_t CONTEXT1:1;
      uint64_t CONTEXT2:1;
      uint64_t CONTEXT3:1;
      uint64_t CONTEXT4:1;
      uint64_t CONTEXT5:1;
      uint64_t CONTEXT6:1;
      uint64_t CONTEXT7:1;
      uint64_t FIFO_OVF_IRQ:1;
      uint64_t COMPLEXIO1_ERR_IRQ:1;
      uint64_t COMPLEXIO2_ERR_IRQ:1;
      uint64_t ECC_NO_CORRECTION_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t SHORT_PACKET_IRQ:1;
      uint64_t OCP_ERR_IRQ:1;
      uint64_t RES5:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONTEXT0:1;
      uint64_t CONTEXT1:1;
      uint64_t CONTEXT2:1;
      uint64_t CONTEXT3:1;
      uint64_t CONTEXT4:1;
      uint64_t CONTEXT5:1;
      uint64_t CONTEXT6:1;
      uint64_t CONTEXT7:1;
      uint64_t FIFO_OVF_IRQ:1;
      uint64_t COMPLEXIO1_ERR_IRQ:1;
      uint64_t COMPLEXIO2_ERR_IRQ:1;
      uint64_t ECC_NO_CORRECTION_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t SHORT_PACKET_IRQ:1;
      uint64_t OCP_ERR_IRQ:1;
      uint64_t RES6:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_IRQENABLE;

  uint8_t res1[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF_EN:1;
      uint64_t SECURE:1;
      uint64_t ECC_EN:1;
      uint64_t FRAME:1;
      uint64_t ENDIANNESS:1;
      uint64_t BURST_SIZE:2;
      uint64_t DBG_EN:1;
      uint64_t VP_OUT_CTRL:2;
      uint64_t STREAMING_32_BIT:1;
      uint64_t VP_ONLY_EN:1;
      uint64_t RES8:1;
      uint64_t NON_POSTED_WRITE:1;
      uint64_t STREAMING:1;
      uint64_t VP_CLK_EN:1;
      uint64_t BURST_SIZE_EXPAND:1;
      uint64_t MFLAG_LEVL:3;
      uint64_t MFLAG_LEVH:3;
      uint64_t RES7:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_DBG_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBCONTEXTS:2;
      uint64_t FIFODEPTH:4;
      uint64_t RES9:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_GNQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLOCK_POSITION:3;
      uint64_t CLOCK_POL:1;
      uint64_t DATA1_POSITION:3;
      uint64_t DATA1_POL:1;
      uint64_t DATA2_POSITION:3;
      uint64_t DATA2_POL:1;
      uint64_t DATA3_POSITION:3;
      uint64_t DATA3_POL:1;
      uint64_t DATA4_POSITION:3;
      uint64_t DATA4_POL:1;
      uint64_t RES11:4;
      uint64_t PWR_AUTO:1;
      uint64_t PWR_STATUS:2;
      uint64_t PWR_CMD:2;
      uint64_t RESET_DONE:1;
      uint64_t RESET_CTRL:1;
      uint64_t RES10:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_COMPLEXIO_CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLOCK_POSITION:3;
      uint64_t CLOCK_POL:1;
      uint64_t DATA1_POSITION:3;
      uint64_t DATA1_POL:1;
      uint64_t DATA2_POSITION:3;
      uint64_t DATA2_POL:1;
      uint64_t DATA3_POSITION:3;
      uint64_t DATA3_POL:1;
      uint64_t DATA4_POSITION:3;
      uint64_t DATA4_POL:1;
      uint64_t RES13:4;
      uint64_t PWR_AUTO:1;
      uint64_t PWR_STATUS:2;
      uint64_t PWR_CMD:2;
      uint64_t RESET_DONE:1;
      uint64_t RESET_CTRL:1;
      uint64_t RES12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_COMPLEXIO_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRSOTHS1:1;
      uint64_t ERRSOTHS2:1;
      uint64_t ERRSOTHS3:1;
      uint64_t ERRSOTHS4:1;
      uint64_t ERRSOTHS5:1;
      uint64_t ERRSOTSYNCHS1:1;
      uint64_t ERRSOTSYNCHS2:1;
      uint64_t ERRSOTSYNCHS3:1;
      uint64_t ERRSOTSYNCHS4:1;
      uint64_t ERRSOTSYNCHS5:1;
      uint64_t ERRESC1:1;
      uint64_t ERRESC2:1;
      uint64_t ERRESC3:1;
      uint64_t ERRESC4:1;
      uint64_t ERRESC5:1;
      uint64_t ERRCONTROL1:1;
      uint64_t ERRCONTROL2:1;
      uint64_t ERRCONTROL3:1;
      uint64_t ERRCONTROL4:1;
      uint64_t ERRCONTROL5:1;
      uint64_t STATEULPM1:1;
      uint64_t STATEULPM2:1;
      uint64_t STATEULPM3:1;
      uint64_t STATEULPM4:1;
      uint64_t STATEULPM5:1;
      uint64_t STATEALLULPMENTER:1;
      uint64_t STATEALLULPMEXIT:1;
      uint64_t RES14:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_COMPLEXIO1_IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRSOTHS1:1;
      uint64_t ERRSOTHS2:1;
      uint64_t ERRSOTHS3:1;
      uint64_t ERRSOTHS4:1;
      uint64_t ERRSOTHS5:1;
      uint64_t ERRSOTSYNCHS1:1;
      uint64_t ERRSOTSYNCHS2:1;
      uint64_t ERRSOTSYNCHS3:1;
      uint64_t ERRSOTSYNCHS4:1;
      uint64_t ERRSOTSYNCHS5:1;
      uint64_t ERRESC1:1;
      uint64_t ERRESC2:1;
      uint64_t ERRESC3:1;
      uint64_t ERRESC4:1;
      uint64_t ERRESC5:1;
      uint64_t ERRCONTROL1:1;
      uint64_t ERRCONTROL2:1;
      uint64_t ERRCONTROL3:1;
      uint64_t ERRCONTROL4:1;
      uint64_t ERRCONTROL5:1;
      uint64_t STATEULPM1:1;
      uint64_t STATEULPM2:1;
      uint64_t STATEULPM3:1;
      uint64_t STATEULPM4:1;
      uint64_t STATEULPM5:1;
      uint64_t STATEALLULPMENTER:1;
      uint64_t STATEALLULPMEXIT:1;
      uint64_t RES15:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_COMPLEXIO2_IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHORT_PACKET:24;
      uint64_t RES16:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_SHORT_PACKET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRSOTHS1:1;
      uint64_t ERRSOTHS2:1;
      uint64_t ERRSOTHS3:1;
      uint64_t ERRSOTHS4:1;
      uint64_t ERRSOTHS5:1;
      uint64_t ERRSOTSYNCHS1:1;
      uint64_t ERRSOTSYNCHS2:1;
      uint64_t ERRSOTSYNCHS3:1;
      uint64_t ERRSOTSYNCHS4:1;
      uint64_t ERRSOTSYNCHS5:1;
      uint64_t ERRESC1:1;
      uint64_t ERRESC2:1;
      uint64_t ERRESC3:1;
      uint64_t ERRESC4:1;
      uint64_t ERRESC5:1;
      uint64_t ERRCONTROL1:1;
      uint64_t ERRCONTROL2:1;
      uint64_t ERRCONTROL3:1;
      uint64_t ERRCONTROL4:1;
      uint64_t ERRCONTROL5:1;
      uint64_t STATEULPM1:1;
      uint64_t STATEULPM2:1;
      uint64_t STATEULPM3:1;
      uint64_t STATEULPM4:1;
      uint64_t STATEULPM5:1;
      uint64_t STATEALLULPMENTER:1;
      uint64_t STATEALLULPMEXIT:1;
      uint64_t RES17:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_COMPLEXIO1_IRQENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRSOTHS1:1;
      uint64_t ERRSOTHS2:1;
      uint64_t ERRSOTHS3:1;
      uint64_t ERRSOTHS4:1;
      uint64_t ERRSOTHS5:1;
      uint64_t ERRSOTSYNCHS1:1;
      uint64_t ERRSOTSYNCHS2:1;
      uint64_t ERRSOTSYNCHS3:1;
      uint64_t ERRSOTSYNCHS4:1;
      uint64_t ERRSOTSYNCHS5:1;
      uint64_t ERRESC1:1;
      uint64_t ERRESC2:1;
      uint64_t ERRESC3:1;
      uint64_t ERRESC4:1;
      uint64_t ERRESC5:1;
      uint64_t ERRCONTROL1:1;
      uint64_t ERRCONTROL2:1;
      uint64_t ERRCONTROL3:1;
      uint64_t ERRCONTROL4:1;
      uint64_t ERRCONTROL5:1;
      uint64_t STATEULPM1:1;
      uint64_t STATEULPM2:1;
      uint64_t STATEULPM3:1;
      uint64_t STATEULPM4:1;
      uint64_t STATEULPM5:1;
      uint64_t STATEALLULPMENTER:1;
      uint64_t STATEALLULPMEXIT:1;
      uint64_t RES18:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_COMPLEXIO2_IRQENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_DBG_P;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOP_STATE_COUNTER_IO1:13;
      uint64_t STOP_STATE_X4_IO1:1;
      uint64_t STOP_STATE_X16_IO1:1;
      uint64_t FORCE_RX_MODE_IO1:1;
      uint64_t STOP_STATE_COUNTER_IO2:13;
      uint64_t STOP_STATE_X4_IO2:1;
      uint64_t STOP_STATE_X16_IO2:1;
      uint64_t FORCE_RX_MODE_IO2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX_EN:1;
      uint64_t LINE_MODULO:1;
      uint64_t VP_FORCE:1;
      uint64_t PING_PONG:1;
      uint64_t COUNT_UNLOCK:1;
      uint64_t CS_EN:1;
      uint64_t EOL_EN:1;
      uint64_t EOF_EN:1;
      uint64_t COUNT:8;
      uint64_t FEC_NUMBER:8;
      uint64_t TRANSCODE:4;
      uint64_t HSCALE:1;
      uint64_t RES19:1;
      uint64_t GENERIC:1;
      uint64_t BYTESWAP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX0_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORMAT:10;
      uint64_t DPCM_PRED:1;
      uint64_t VIRTUAL_ID:2;
      uint64_t USER_DEF_MAPPING:2;
      uint64_t RES20:1;
      uint64_t FRAME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX0_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t OFST:12;
      uint64_t RES21:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX0_DAT_OFST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX0_DAT_PING_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX0_DAT_PONG_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES23:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES22:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX0_IRQENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES25:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES24:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX0_IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_NUMBER:16;
      uint64_t ALPHA:14;
      uint64_t Reserved:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX0_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX_EN:1;
      uint64_t LINE_MODULO:1;
      uint64_t VP_FORCE:1;
      uint64_t PING_PONG:1;
      uint64_t COUNT_UNLOCK:1;
      uint64_t CS_EN:1;
      uint64_t EOL_EN:1;
      uint64_t EOF_EN:1;
      uint64_t COUNT:8;
      uint64_t FEC_NUMBER:8;
      uint64_t TRANSCODE:4;
      uint64_t HSCALE:1;
      uint64_t RES19:1;
      uint64_t GENERIC:1;
      uint64_t BYTESWAP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX1_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORMAT:10;
      uint64_t DPCM_PRED:1;
      uint64_t VIRTUAL_ID:2;
      uint64_t USER_DEF_MAPPING:2;
      uint64_t RES20:1;
      uint64_t FRAME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX1_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t OFST:12;
      uint64_t RES21:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX1_DAT_OFST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX1_DAT_PING_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX1_DAT_PONG_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES23:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES22:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX1_IRQENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES25:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES24:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX1_IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_NUMBER:16;
      uint64_t ALPHA:14;
      uint64_t Reserved:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX1_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX_EN:1;
      uint64_t LINE_MODULO:1;
      uint64_t VP_FORCE:1;
      uint64_t PING_PONG:1;
      uint64_t COUNT_UNLOCK:1;
      uint64_t CS_EN:1;
      uint64_t EOL_EN:1;
      uint64_t EOF_EN:1;
      uint64_t COUNT:8;
      uint64_t FEC_NUMBER:8;
      uint64_t TRANSCODE:4;
      uint64_t HSCALE:1;
      uint64_t RES19:1;
      uint64_t GENERIC:1;
      uint64_t BYTESWAP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX2_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORMAT:10;
      uint64_t DPCM_PRED:1;
      uint64_t VIRTUAL_ID:2;
      uint64_t USER_DEF_MAPPING:2;
      uint64_t RES20:1;
      uint64_t FRAME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX2_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t OFST:12;
      uint64_t RES21:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX2_DAT_OFST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX2_DAT_PING_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX2_DAT_PONG_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES23:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES22:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX2_IRQENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES25:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES24:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX2_IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_NUMBER:16;
      uint64_t ALPHA:14;
      uint64_t Reserved:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX2_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX_EN:1;
      uint64_t LINE_MODULO:1;
      uint64_t VP_FORCE:1;
      uint64_t PING_PONG:1;
      uint64_t COUNT_UNLOCK:1;
      uint64_t CS_EN:1;
      uint64_t EOL_EN:1;
      uint64_t EOF_EN:1;
      uint64_t COUNT:8;
      uint64_t FEC_NUMBER:8;
      uint64_t TRANSCODE:4;
      uint64_t HSCALE:1;
      uint64_t RES19:1;
      uint64_t GENERIC:1;
      uint64_t BYTESWAP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX3_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORMAT:10;
      uint64_t DPCM_PRED:1;
      uint64_t VIRTUAL_ID:2;
      uint64_t USER_DEF_MAPPING:2;
      uint64_t RES20:1;
      uint64_t FRAME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX3_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t OFST:12;
      uint64_t RES21:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX3_DAT_OFST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX3_DAT_PING_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX3_DAT_PONG_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES23:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES22:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX3_IRQENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES25:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES24:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX3_IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_NUMBER:16;
      uint64_t ALPHA:14;
      uint64_t Reserved:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX3_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX_EN:1;
      uint64_t LINE_MODULO:1;
      uint64_t VP_FORCE:1;
      uint64_t PING_PONG:1;
      uint64_t COUNT_UNLOCK:1;
      uint64_t CS_EN:1;
      uint64_t EOL_EN:1;
      uint64_t EOF_EN:1;
      uint64_t COUNT:8;
      uint64_t FEC_NUMBER:8;
      uint64_t TRANSCODE:4;
      uint64_t HSCALE:1;
      uint64_t RES19:1;
      uint64_t GENERIC:1;
      uint64_t BYTESWAP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX4_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORMAT:10;
      uint64_t DPCM_PRED:1;
      uint64_t VIRTUAL_ID:2;
      uint64_t USER_DEF_MAPPING:2;
      uint64_t RES20:1;
      uint64_t FRAME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX4_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t OFST:12;
      uint64_t RES21:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX4_DAT_OFST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX4_DAT_PING_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX4_DAT_PONG_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES23:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES22:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX4_IRQENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES25:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES24:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX4_IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_NUMBER:16;
      uint64_t ALPHA:14;
      uint64_t Reserved:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX4_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX_EN:1;
      uint64_t LINE_MODULO:1;
      uint64_t VP_FORCE:1;
      uint64_t PING_PONG:1;
      uint64_t COUNT_UNLOCK:1;
      uint64_t CS_EN:1;
      uint64_t EOL_EN:1;
      uint64_t EOF_EN:1;
      uint64_t COUNT:8;
      uint64_t FEC_NUMBER:8;
      uint64_t TRANSCODE:4;
      uint64_t HSCALE:1;
      uint64_t RES19:1;
      uint64_t GENERIC:1;
      uint64_t BYTESWAP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORMAT:10;
      uint64_t DPCM_PRED:1;
      uint64_t VIRTUAL_ID:2;
      uint64_t USER_DEF_MAPPING:2;
      uint64_t RES20:1;
      uint64_t FRAME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t OFST:12;
      uint64_t RES21:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_DAT_OFST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_DAT_PING_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:5;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_DAT_PONG_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES23:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES22:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_IRQENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS_IRQ:1;
      uint64_t FE_IRQ:1;
      uint64_t LS_IRQ:1;
      uint64_t LE_IRQ:1;
      uint64_t RES25:1;
      uint64_t CS_IRQ:1;
      uint64_t FRAME_NUMBER_IRQ:1;
      uint64_t LINE_NUMBER_IRQ:1;
      uint64_t ECC_CORRECTION_IRQ:1;
      uint64_t RES24:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_NUMBER:16;
      uint64_t ALPHA:14;
      uint64_t Reserved:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX5_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX_EN:1;
      uint64_t LINE_MODULO:1;
      uint64_t VP_FORCE:1;
      uint64_t PING_PONG:1;
      uint64_t COUNT_UNLOCK:1;
      uint64_t CS_EN:1;
      uint64_t EOL_EN:1;
      uint64_t EOF_EN:1;
      uint64_t COUNT:8;
      uint64_t FEC_NUMBER:8;
      uint64_t TRANSCODE:4;
      uint64_t HSCALE:1;
      uint64_t RES19:1;
      uint64_t GENERIC:1;
      uint64_t BYTESWAP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSI2_CTX6_CTRL1;

