iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define RCSS_CSI2B (*(volatile struct RCSS_CSI2B_tag *) 0x50a0000)

struct RCSS_SCI_A_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
      uint64_t FE:1;
      uint64_t PE:1;
      uint64_t BE:1;
      uint64_t OE:1;
      uint64_t NU0:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FE:1;
      uint64_t PE:1;
      uint64_t BE:1;
      uint64_t OE:1;
      uint64_t NU1:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTRSR_ECR;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTS:1;
      uint64_t DSR:1;
      uint64_t DCD:1;
      uint64_t BUSY:1;
      uint64_t RXFE:1;
      uint64_t TXFF:1;
      uint64_t RXFF:1;
      uint64_t TXFE:1;
      uint64_t RI:1;
      uint64_t NU2:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTFR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ILPDVSR:8;
      uint64_t NU3:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTILPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAUD_DIVINT:8;
      uint64_t NU4:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTIBRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAUD_DIVFRAC:6;
      uint64_t NU5:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTFBRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRK:1;
      uint64_t PEN:1;
      uint64_t EPS:1;
      uint64_t STP2:1;
      uint64_t FEN:1;
      uint64_t WLEN:2;
      uint64_t SPS:1;
      uint64_t NU6:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTLCR_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UARTEN:1;
      uint64_t SIREN:1;
      uint64_t SIRLP:1;
      uint64_t NU6:4;
      uint64_t LBE:1;
      uint64_t TXE:1;
      uint64_t RXE:1;
      uint64_t DTR:1;
      uint64_t RTS:1;
      uint64_t Out1:1;
      uint64_t Out2:1;
      uint64_t RTSEn:1;
      uint64_t CTSEn:1;
      uint64_t NU7:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXIFLSEL:3;
      uint64_t RXIFLSEL:3;
      uint64_t NU8:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTIFLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIMIM:1;
      uint64_t CTSMIM:1;
      uint64_t DCDMIM:1;
      uint64_t DSRMIM:1;
      uint64_t RXIM:1;
      uint64_t TXIM:1;
      uint64_t RTIM:1;
      uint64_t FEIM:1;
      uint64_t PEIM:1;
      uint64_t BEIM:1;
      uint64_t OEIM:1;
      uint64_t NU9:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTIMSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIRMIS:1;
      uint64_t CTSRMIS:1;
      uint64_t DCDRMIS:1;
      uint64_t DSRRMIS:1;
      uint64_t RXRIS:1;
      uint64_t TXRIS:1;
      uint64_t RTRIS:1;
      uint64_t FERIS:1;
      uint64_t PERIS:1;
      uint64_t OERIS:1;
      uint64_t NU10:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTRIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIMMIS:1;
      uint64_t CTSMMIS:1;
      uint64_t DCDMMIS:1;
      uint64_t DSRMMIS:1;
      uint64_t RXMIS:1;
      uint64_t TXMIS:1;
      uint64_t RTMIS:1;
      uint64_t FEMIS:1;
      uint64_t PEMIS:1;
      uint64_t BEMIS:1;
      uint64_t OEMIS:1;
      uint64_t NU11:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTMIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIMIC:1;
      uint64_t CTSMIC:1;
      uint64_t DCDMIC:1;
      uint64_t DSRMIC:1;
      uint64_t RXIC:1;
      uint64_t TXIC:1;
      uint64_t RTIC:1;
      uint64_t FEIC:1;
      uint64_t PEIC:1;
      uint64_t BEIC:1;
      uint64_t OEIC:1;
      uint64_t NU12:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDMAE:1;
      uint64_t TXDMAE:1;
      uint64_t DMAONERR:1;
      uint64_t NU13:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTDMACR;

  uint8_t res2[3988];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UARTPeriphID0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTPeriphID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UARTPeriphID1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTPeriphID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UARTPeriphID2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTPeriphID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UARTPeriphID3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTPeriphID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UARTPCellID0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTPCellID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UARTPCellID1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTPCellID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UARTPCellID2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTPCellID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UARTPCellID3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTPCellID3;

};

#define RCSS_SCI_A (*(volatile struct RCSS_SCI_A_tag *) 0x50c0000)

struct RCSS_TPCC_A_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR:6;
      uint64_t CUSTOM:2;
      uint64_t MAJOR:3;
      uint64_t RTL:5;
      uint64_t FUNC:12;
      uint64_t RES1:2;
      uint64_t SCHEME:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUMDMACH:3;
      uint64_t RES8:1;
      uint64_t NUMQDMACH:3;
      uint64_t RES7:1;
      uint64_t NUMINTCH:3;
      uint64_t RES6:1;
      uint64_t NUMPAENTRY:3;
      uint64_t RES5:1;
      uint64_t NUMTC:3;
      uint64_t RES4:1;
      uint64_t NUMREGN:2;
      uint64_t RES3:2;
      uint64_t CHMAPEXIST:1;
      uint64_t MPEXIST:1;
      uint64_t RES2:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCFG;

  uint8_t res0[504];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TRWORD:3;
      uint64_t PAENTRY:9;
      uint64_t RES10:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCHMAPN;

  uint8_t res1[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:3;
      uint64_t RES18:1;
      uint64_t E1:3;
      uint64_t RES17:1;
      uint64_t E2:3;
      uint64_t RES16:1;
      uint64_t E3:3;
      uint64_t RES15:1;
      uint64_t E4:3;
      uint64_t RES14:1;
      uint64_t E5:3;
      uint64_t RES13:1;
      uint64_t E6:3;
      uint64_t RES12:1;
      uint64_t E7:3;
      uint64_t RES11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAQNUMN;

