iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:3;
      uint64_t RES26:1;
      uint64_t E1:3;
      uint64_t RES25:1;
      uint64_t E2:3;
      uint64_t RES24:1;
      uint64_t E3:3;
      uint64_t RES23:1;
      uint64_t E4:3;
      uint64_t RES22:1;
      uint64_t E5:3;
      uint64_t RES21:1;
      uint64_t E6:3;
      uint64_t RES20:1;
      uint64_t E7:3;
      uint64_t RES19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QDMAQNUM;

  uint8_t res3[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCNUMQ0:3;
      uint64_t RES28:1;
      uint64_t TCNUMQ1:3;
      uint64_t RES27:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QUETCMAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRIQ0:3;
      uint64_t RES30:1;
      uint64_t PRIQ1:3;
      uint64_t RES29:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QUEPRI;

  uint8_t res4[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMCRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES31:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES32:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QTHRXCD0:1;
      uint64_t QTHRXCD1:1;
      uint64_t QTHRXCD2:1;
      uint64_t QTHRXCD3:1;
      uint64_t QTHRXCD4:1;
      uint64_t QTHRXCD5:1;
      uint64_t QTHRXCD6:1;
      uint64_t QTHRXCD7:1;
      uint64_t RES34:8;
      uint64_t TCERR:1;
      uint64_t RES33:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QTHRXCD0:1;
      uint64_t QTHRXCD1:1;
      uint64_t QTHRXCD2:1;
      uint64_t QTHRXCD3:1;
      uint64_t QTHRXCD4:1;
      uint64_t QTHRXCD5:1;
      uint64_t QTHRXCD6:1;
      uint64_t QTHRXCD7:1;
      uint64_t RES36:8;
      uint64_t TCERR:1;
      uint64_t RES35:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCERRCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVAL:1;
      uint64_t SET:1;
      uint64_t RES37:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEVAL;

  uint8_t res5[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DRAEM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DRAEHM;

  uint8_t res6[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES38:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QRAEN;

