iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res7[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES39:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES40:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES41:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES42:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES43:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES44:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES45:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES46:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES47:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES48:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES49:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES50:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES51:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES52:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES53:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENUM:6;
      uint64_t ETYPE:2;
      uint64_t RES54:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QNE15;

  uint8_t res8[448];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRTPTR:4;
      uint64_t RES58:4;
      uint64_t NUMVAL:5;
      uint64_t RES57:3;
      uint64_t WM:5;
      uint64_t RES56:3;
      uint64_t THRXCD:1;
      uint64_t RES55:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSTATN;

  uint8_t res9[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Q0:5;
      uint64_t RES60:3;
      uint64_t Q1:5;
      uint64_t RES59:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QWMTHRA;

  uint8_t res10[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVTACTV:1;
      uint64_t QEVTACTV:1;
      uint64_t TRACTV:1;
      uint64_t RES64:1;
      uint64_t ACTV:1;
      uint64_t RES63:3;
      uint64_t COMPACTV:6;
      uint64_t RES62:2;
      uint64_t QUEACTV0:1;
      uint64_t QUEACTV1:1;
      uint64_t QUEACTV2:1;
      uint64_t QUEACTV3:1;
      uint64_t QUEACTV4:1;
      uint64_t QUEACTV5:1;
      uint64_t QUEACTV6:1;
      uint64_t QUEACTV7:1;
      uint64_t RES61:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCSTAT;

  uint8_t res11[188];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRTEVT:6;
      uint64_t TYPE:1;
      uint64_t RES66:1;
      uint64_t ENDINT:6;
      uint64_t RES65:17;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AETCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
      uint64_t RES67:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AETSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t RES68:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AETCMD;

  uint8_t res12[2292];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CERH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EERH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EECRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EESRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SECRH;

  uint8_t res13[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I0:1;
      uint64_t I1:1;
      uint64_t I2:1;
      uint64_t I3:1;
      uint64_t I4:1;
      uint64_t I5:1;
      uint64_t I6:1;
      uint64_t I7:1;
      uint64_t I8:1;
      uint64_t I9:1;
      uint64_t I10:1;
      uint64_t I11:1;
      uint64_t I12:1;
      uint64_t I13:1;
      uint64_t I14:1;
      uint64_t I15:1;
      uint64_t I16:1;
      uint64_t I17:1;
      uint64_t I18:1;
      uint64_t I19:1;
      uint64_t I20:1;
      uint64_t I21:1;
      uint64_t I22:1;
      uint64_t I23:1;
      uint64_t I24:1;
      uint64_t I25:1;
      uint64_t I26:1;
      uint64_t I27:1;
      uint64_t I28:1;
      uint64_t I29:1;
      uint64_t I30:1;
      uint64_t I31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I32:1;
      uint64_t I33:1;
      uint64_t I34:1;
      uint64_t I35:1;
      uint64_t I36:1;
      uint64_t I37:1;
      uint64_t I38:1;
      uint64_t I39:1;
      uint64_t I40:1;
      uint64_t I41:1;
      uint64_t I42:1;
      uint64_t I43:1;
      uint64_t I44:1;
      uint64_t I45:1;
      uint64_t I46:1;
      uint64_t I47:1;
      uint64_t I48:1;
      uint64_t I49:1;
      uint64_t I50:1;
      uint64_t I51:1;
      uint64_t I52:1;
      uint64_t I53:1;
      uint64_t I54:1;
      uint64_t I55:1;
      uint64_t I56:1;
      uint64_t I57:1;
      uint64_t I58:1;
      uint64_t I59:1;
      uint64_t I60:1;
      uint64_t I61:1;
      uint64_t I62:1;
      uint64_t I63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IERH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I0:1;
      uint64_t I1:1;
      uint64_t I2:1;
      uint64_t I3:1;
      uint64_t I4:1;
      uint64_t I5:1;
      uint64_t I6:1;
      uint64_t I7:1;
      uint64_t I8:1;
      uint64_t I9:1;
      uint64_t I10:1;
      uint64_t I11:1;
      uint64_t I12:1;
      uint64_t I13:1;
      uint64_t I14:1;
      uint64_t I15:1;
      uint64_t I16:1;
      uint64_t I17:1;
      uint64_t I18:1;
      uint64_t I19:1;
      uint64_t I20:1;
      uint64_t I21:1;
      uint64_t I22:1;
      uint64_t I23:1;
      uint64_t I24:1;
      uint64_t I25:1;
      uint64_t I26:1;
      uint64_t I27:1;
      uint64_t I28:1;
      uint64_t I29:1;
      uint64_t I30:1;
      uint64_t I31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I32:1;
      uint64_t I33:1;
      uint64_t I34:1;
      uint64_t I35:1;
      uint64_t I36:1;
      uint64_t I37:1;
      uint64_t I38:1;
      uint64_t I39:1;
      uint64_t I40:1;
      uint64_t I41:1;
      uint64_t I42:1;
      uint64_t I43:1;
      uint64_t I44:1;
      uint64_t I45:1;
      uint64_t I46:1;
      uint64_t I47:1;
      uint64_t I48:1;
      uint64_t I49:1;
      uint64_t I50:1;
      uint64_t I51:1;
      uint64_t I52:1;
      uint64_t I53:1;
      uint64_t I54:1;
      uint64_t I55:1;
      uint64_t I56:1;
      uint64_t I57:1;
      uint64_t I58:1;
      uint64_t I59:1;
      uint64_t I60:1;
      uint64_t I61:1;
      uint64_t I62:1;
      uint64_t I63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IECRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I0:1;
      uint64_t I1:1;
      uint64_t I2:1;
      uint64_t I3:1;
      uint64_t I4:1;
      uint64_t I5:1;
      uint64_t I6:1;
      uint64_t I7:1;
      uint64_t I8:1;
      uint64_t I9:1;
      uint64_t I10:1;
      uint64_t I11:1;
      uint64_t I12:1;
      uint64_t I13:1;
      uint64_t I14:1;
      uint64_t I15:1;
      uint64_t I16:1;
      uint64_t I17:1;
      uint64_t I18:1;
      uint64_t I19:1;
      uint64_t I20:1;
      uint64_t I21:1;
      uint64_t I22:1;
      uint64_t I23:1;
      uint64_t I24:1;
      uint64_t I25:1;
      uint64_t I26:1;
      uint64_t I27:1;
      uint64_t I28:1;
      uint64_t I29:1;
      uint64_t I30:1;
      uint64_t I31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IESR;

