iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t I32:1;
      uint64_t I33:1;
      uint64_t I34:1;
      uint64_t I35:1;
      uint64_t I36:1;
      uint64_t I37:1;
      uint64_t I38:1;
      uint64_t I39:1;
      uint64_t I40:1;
      uint64_t I41:1;
      uint64_t I42:1;
      uint64_t I43:1;
      uint64_t I44:1;
      uint64_t I45:1;
      uint64_t I46:1;
      uint64_t I47:1;
      uint64_t I48:1;
      uint64_t I49:1;
      uint64_t I50:1;
      uint64_t I51:1;
      uint64_t I52:1;
      uint64_t I53:1;
      uint64_t I54:1;
      uint64_t I55:1;
      uint64_t I56:1;
      uint64_t I57:1;
      uint64_t I58:1;
      uint64_t I59:1;
      uint64_t I60:1;
      uint64_t I61:1;
      uint64_t I62:1;
      uint64_t I63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IECRH_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I0:1;
      uint64_t I1:1;
      uint64_t I2:1;
      uint64_t I3:1;
      uint64_t I4:1;
      uint64_t I5:1;
      uint64_t I6:1;
      uint64_t I7:1;
      uint64_t I8:1;
      uint64_t I9:1;
      uint64_t I10:1;
      uint64_t I11:1;
      uint64_t I12:1;
      uint64_t I13:1;
      uint64_t I14:1;
      uint64_t I15:1;
      uint64_t I16:1;
      uint64_t I17:1;
      uint64_t I18:1;
      uint64_t I19:1;
      uint64_t I20:1;
      uint64_t I21:1;
      uint64_t I22:1;
      uint64_t I23:1;
      uint64_t I24:1;
      uint64_t I25:1;
      uint64_t I26:1;
      uint64_t I27:1;
      uint64_t I28:1;
      uint64_t I29:1;
      uint64_t I30:1;
      uint64_t I31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IESR_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I32:1;
      uint64_t I33:1;
      uint64_t I34:1;
      uint64_t I35:1;
      uint64_t I36:1;
      uint64_t I37:1;
      uint64_t I38:1;
      uint64_t I39:1;
      uint64_t I40:1;
      uint64_t I41:1;
      uint64_t I42:1;
      uint64_t I43:1;
      uint64_t I44:1;
      uint64_t I45:1;
      uint64_t I46:1;
      uint64_t I47:1;
      uint64_t I48:1;
      uint64_t I49:1;
      uint64_t I50:1;
      uint64_t I51:1;
      uint64_t I52:1;
      uint64_t I53:1;
      uint64_t I54:1;
      uint64_t I55:1;
      uint64_t I56:1;
      uint64_t I57:1;
      uint64_t I58:1;
      uint64_t I59:1;
      uint64_t I60:1;
      uint64_t I61:1;
      uint64_t I62:1;
      uint64_t I63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IESRH_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I0:1;
      uint64_t I1:1;
      uint64_t I2:1;
      uint64_t I3:1;
      uint64_t I4:1;
      uint64_t I5:1;
      uint64_t I6:1;
      uint64_t I7:1;
      uint64_t I8:1;
      uint64_t I9:1;
      uint64_t I10:1;
      uint64_t I11:1;
      uint64_t I12:1;
      uint64_t I13:1;
      uint64_t I14:1;
      uint64_t I15:1;
      uint64_t I16:1;
      uint64_t I17:1;
      uint64_t I18:1;
      uint64_t I19:1;
      uint64_t I20:1;
      uint64_t I21:1;
      uint64_t I22:1;
      uint64_t I23:1;
      uint64_t I24:1;
      uint64_t I25:1;
      uint64_t I26:1;
      uint64_t I27:1;
      uint64_t I28:1;
      uint64_t I29:1;
      uint64_t I30:1;
      uint64_t I31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I32:1;
      uint64_t I33:1;
      uint64_t I34:1;
      uint64_t I35:1;
      uint64_t I36:1;
      uint64_t I37:1;
      uint64_t I38:1;
      uint64_t I39:1;
      uint64_t I40:1;
      uint64_t I41:1;
      uint64_t I42:1;
      uint64_t I43:1;
      uint64_t I44:1;
      uint64_t I45:1;
      uint64_t I46:1;
      uint64_t I47:1;
      uint64_t I48:1;
      uint64_t I49:1;
      uint64_t I50:1;
      uint64_t I51:1;
      uint64_t I52:1;
      uint64_t I53:1;
      uint64_t I54:1;
      uint64_t I55:1;
      uint64_t I56:1;
      uint64_t I57:1;
      uint64_t I58:1;
      uint64_t I59:1;
      uint64_t I60:1;
      uint64_t I61:1;
      uint64_t I62:1;
      uint64_t I63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPRH_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I0:1;
      uint64_t I1:1;
      uint64_t I2:1;
      uint64_t I3:1;
      uint64_t I4:1;
      uint64_t I5:1;
      uint64_t I6:1;
      uint64_t I7:1;
      uint64_t I8:1;
      uint64_t I9:1;
      uint64_t I10:1;
      uint64_t I11:1;
      uint64_t I12:1;
      uint64_t I13:1;
      uint64_t I14:1;
      uint64_t I15:1;
      uint64_t I16:1;
      uint64_t I17:1;
      uint64_t I18:1;
      uint64_t I19:1;
      uint64_t I20:1;
      uint64_t I21:1;
      uint64_t I22:1;
      uint64_t I23:1;
      uint64_t I24:1;
      uint64_t I25:1;
      uint64_t I26:1;
      uint64_t I27:1;
      uint64_t I28:1;
      uint64_t I29:1;
      uint64_t I30:1;
      uint64_t I31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I32:1;
      uint64_t I33:1;
      uint64_t I34:1;
      uint64_t I35:1;
      uint64_t I36:1;
      uint64_t I37:1;
      uint64_t I38:1;
      uint64_t I39:1;
      uint64_t I40:1;
      uint64_t I41:1;
      uint64_t I42:1;
      uint64_t I43:1;
      uint64_t I44:1;
      uint64_t I45:1;
      uint64_t I46:1;
      uint64_t I47:1;
      uint64_t I48:1;
      uint64_t I49:1;
      uint64_t I50:1;
      uint64_t I51:1;
      uint64_t I52:1;
      uint64_t I53:1;
      uint64_t I54:1;
      uint64_t I55:1;
      uint64_t I56:1;
      uint64_t I57:1;
      uint64_t I58:1;
      uint64_t I59:1;
      uint64_t I60:1;
      uint64_t I61:1;
      uint64_t I62:1;
      uint64_t I63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICRH_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVAL:1;
      uint64_t SET:1;
      uint64_t RES76:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEVAL_RN;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES77:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QER_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES78:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEER_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES79:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEECR_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES80:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEESR_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES81:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSER_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES82:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSECR_RN;

