iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res7[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF15;

  uint8_t res8[3392];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b15_8:8;
      uint64_t b16_16:1;
      uint64_t b31_17:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WFIFOCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b31_8:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WFIFOSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b15_8:8;
      uint64_t b16_16:1;
      uint64_t b31_17:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFOCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b31_8:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFOSTS;

};

#define RCSS_MCASP_A (*(volatile struct RCSS_MCASP_A_tag *) 0x51e0000)

struct RCSS_MCASP_B_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b5_2:4;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRIDLESYSCONFIG;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t b24_4:21;
      uint64_t b25_25:1;
      uint64_t b26_26:1;
      uint64_t b27_27:1;
      uint64_t b28_28:1;
      uint64_t b29_29:1;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFUNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t b24_4:21;
      uint64_t b25_25:1;
      uint64_t b26_26:1;
      uint64_t b27_27:1;
      uint64_t b28_28:1;
      uint64_t b29_29:1;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t b24_4:21;
      uint64_t b25_25:1;
      uint64_t b26_26:1;
      uint64_t b27_27:1;
      uint64_t b28_28:1;
      uint64_t b29_29:1;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t b24_4:21;
      uint64_t b25_25:1;
      uint64_t b26_26:1;
      uint64_t b27_27:1;
      uint64_t b28_28:1;
      uint64_t b29_29:1;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t b24_4:21;
      uint64_t b25_25:1;
      uint64_t b26_26:1;
      uint64_t b27_27:1;
      uint64_t b28_28:1;
      uint64_t b29_29:1;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCLR;

  uint8_t res1[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b7_5:3;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b31_13:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GBLCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b31_13:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMUTE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b3_2:2;
      uint64_t b31_4:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLBCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b31_4:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITCTL;

