iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b7_5:3;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b31_13:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGBLCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t b3_3:1;
      uint64_t b7_4:4;
      uint64_t b12_8:5;
      uint64_t b14_13:2;
      uint64_t b15_15:1;
      uint64_t b17_16:2;
      uint64_t b31_18:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFMT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b6_5:2;
      uint64_t b15_7:9;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFSRCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b31_8:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACLKRCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b11_0:12;
      uint64_t b13_12:2;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHCLKRCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTDM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b31_8:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RINTCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b31_9:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b8_0:9;
      uint64_t b31_9:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSLOT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t b7_4:4;
      uint64_t b15_8:8;
      uint64_t b23_16:8;
      uint64_t b31_24:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCLKCHK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b31_1:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIDTCTL;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b7_5:3;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b31_13:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XGBLCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t b3_3:1;
      uint64_t b7_4:4;
      uint64_t b12_8:5;
      uint64_t b14_13:2;
      uint64_t b15_15:1;
      uint64_t b17_16:2;
      uint64_t b31_18:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFMT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b6_5:2;
      uint64_t b15_7:9;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFSXCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b31_8:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACLKXCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b11_0:12;
      uint64_t b13_12:2;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHCLKXCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XTDM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b31_8:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XINTCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b31_9:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b9_0:10;
      uint64_t b31_10:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XSLOT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t b7_4:4;
      uint64_t b15_8:8;
      uint64_t b23_16:8;
      uint64_t b31_24:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XCLKCHK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b31_1:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XEVTCTL;

  uint8_t res4[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITCSRA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITCSRA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITCSRA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITCSRA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITCSRA4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITCSRA5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITCSRB0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITCSRB1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITCSRB2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITCSRB3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITCSRB4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITCSRB5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITUDRA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITUDRA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITUDRA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITUDRA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITUDRA4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITUDRA5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITUDRB0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITUDRB1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITUDRB2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITUDRB3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITUDRB4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITUDRB5;

  uint8_t res5[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b31_6:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCTL15;

  uint8_t res6[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBUF15;

