iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res7[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBUF15;

  uint8_t res8[3392];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b15_8:8;
      uint64_t b16_16:1;
      uint64_t b31_17:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WFIFOCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b31_8:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WFIFOSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b15_8:8;
      uint64_t b16_16:1;
      uint64_t b31_17:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFOCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b31_8:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFOSTS;

};

#define RCSS_MCASP_C (*(volatile struct RCSS_MCASP_C_tag *) 0x5220000)

struct RCSS_ATL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b27_16:12;
      uint64_t b29_28:2;
      uint64_t b31_30:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REVISION;

  uint8_t res0[508];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b8_0:9;
      uint64_t reservedSpace0:6;
      uint64_t b15_15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL0_PPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL0_BBSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t b5_5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL0_ATLCR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL0_SWEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL0_BWSMUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL0_AWSMUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL0_PCLKMUX;

  uint8_t res2[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b8_0:9;
      uint64_t reservedSpace0:6;
      uint64_t b15_15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL1_PPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL1_BBSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t b5_5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL1_ATLCR;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL1_SWEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL1_BWSMUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL1_AWSMUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL1_PCLKMUX;

  uint8_t res4[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b8_0:9;
      uint64_t reservedSpace0:6;
      uint64_t b15_15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL2_PPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL2_BBSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t b5_5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL2_ATLCR;

