iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL2_SWEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL2_BWSMUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL2_AWSMUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL2_PCLKMUX;

  uint8_t res6[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b8_0:9;
      uint64_t reservedSpace0:6;
      uint64_t b15_15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL3_PPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL3_BBSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t b5_5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL3_ATLCR;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL3_SWEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL3_BWSMUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL3_AWSMUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATL3_PCLKMUX;

};

#define RCSS_ATL (*(volatile struct RCSS_ATL_tag *) 0x5240000)

struct RCSS_PCR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS0_PROT_SET:1;
      uint64_t PCS1_PROT_SET:1;
      uint64_t PCS2_PROT_SET:1;
      uint64_t PCS3_PROT_SET:1;
      uint64_t PCS4_PROT_SET:1;
      uint64_t PCS5_PROT_SET:1;
      uint64_t PCS6_PROT_SET:1;
      uint64_t PCS7_PROT_SET:1;
      uint64_t PCS8_PROT_SET:1;
      uint64_t PCS9_PROT_SET:1;
      uint64_t PCS10_PROT_SET:1;
      uint64_t PCS11_PROT_SET:1;
      uint64_t PCS12_PROT_SET:1;
      uint64_t PCS13_PROT_SET:1;
      uint64_t PCS14_PROT_SET:1;
      uint64_t PCS15_PROT_SET:1;
      uint64_t PCS16_PROT_SET:1;
      uint64_t PCS17_PROT_SET:1;
      uint64_t PCS18_PROT_SET:1;
      uint64_t PCS19_PROT_SET:1;
      uint64_t PCS20_PROT_SET:1;
      uint64_t PCS21_PROT_SET:1;
      uint64_t PCS22_PROT_SET:1;
      uint64_t PCS23_PROT_SET:1;
      uint64_t PCS24_PROT_SET:1;
      uint64_t PCS25_PROT_SET:1;
      uint64_t PCS26_PROT_SET:1;
      uint64_t PCS27_PROT_SET:1;
      uint64_t PCS28_PROT_SET:1;
      uint64_t PCS29_PROT_SET:1;
      uint64_t PCS30_PROT_SET:1;
      uint64_t PCS31_PROT_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTSET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS32_PROT_SET:1;
      uint64_t PCS33_PROT_SET:1;
      uint64_t PCS34_PROT_SET:1;
      uint64_t PCS35_PROT_SET:1;
      uint64_t PCS36_PROT_SET:1;
      uint64_t PCS37_PROT_SET:1;
      uint64_t PCS38_PROT_SET:1;
      uint64_t PCS39_PROT_SET:1;
      uint64_t PCS40_PROT_SET:1;
      uint64_t PCS41_PROT_SET:1;
      uint64_t PCS42_PROT_SET:1;
      uint64_t PCS43_PROT_SET:1;
      uint64_t PCS44_PROT_SET:1;
      uint64_t PCS45_PROT_SET:1;
      uint64_t PCS46_PROT_SET:1;
      uint64_t PCS47_PROT_SET:1;
      uint64_t PCS48_PROT_SET:1;
      uint64_t PCS49_PROT_SET:1;
      uint64_t PCS50_PROT_SET:1;
      uint64_t PCS51_PROT_SET:1;
      uint64_t PCS52_PROT_SET:1;
      uint64_t PCS53_PROT_SET:1;
      uint64_t PCS54_PROT_SET:1;
      uint64_t PCS55_PROT_SET:1;
      uint64_t PCS56_PROT_SET:1;
      uint64_t PCS57_PROT_SET:1;
      uint64_t PCS58_PROT_SET:1;
      uint64_t PCS59_PROT_SET:1;
      uint64_t PCS60_PROT_SET:1;
      uint64_t PCS61_PROT_SET:1;
      uint64_t PCS62_PROT_SET:1;
      uint64_t PCS63_PROT_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTSET1;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS0_PROT_CLR:1;
      uint64_t PCS1_PROT_CLR:1;
      uint64_t PCS2_PROT_CLR:1;
      uint64_t PCS3_PROT_CLR:1;
      uint64_t PCS4_PROT_CLR:1;
      uint64_t PCS5_PROT_CLR:1;
      uint64_t PCS6_PROT_CLR:1;
      uint64_t PCS7_PROT_CLR:1;
      uint64_t PCS8_PROT_CLR:1;
      uint64_t PCS9_PROT_CLR:1;
      uint64_t PCS10_PROT_CLR:1;
      uint64_t PCS11_PROT_CLR:1;
      uint64_t PCS12_PROT_CLR:1;
      uint64_t PCS13_PROT_CLR:1;
      uint64_t PCS14_PROT_CLR:1;
      uint64_t PCS15_PROT_CLR:1;
      uint64_t PCS16_PROT_CLR:1;
      uint64_t PCS17_PROT_CLR:1;
      uint64_t PCS18_PROT_CLR:1;
      uint64_t PCS19_PROT_CLR:1;
      uint64_t PCS20_PROT_CLR:1;
      uint64_t PCS21_PROT_CLR:1;
      uint64_t PCS22_PROT_CLR:1;
      uint64_t PCS23_PROT_CLR:1;
      uint64_t PCS24_PROT_CLR:1;
      uint64_t PCS25_PROT_CLR:1;
      uint64_t PCS26_PROT_CLR:1;
      uint64_t PCS27_PROT_CLR:1;
      uint64_t PCS28_PROT_CLR:1;
      uint64_t PCS29_PROT_CLR:1;
      uint64_t PCS30_PROT_CLR:1;
      uint64_t PCS31_PROT_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTCLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS32_PROT_CLR:1;
      uint64_t PCS33_PROT_CLR:1;
      uint64_t PCS34_PROT_CLR:1;
      uint64_t PCS35_PROT_CLR:1;
      uint64_t PCS36_PROT_CLR:1;
      uint64_t PCS37_PROT_CLR:1;
      uint64_t PCS38_PROT_CLR:1;
      uint64_t PCS39_PROT_CLR:1;
      uint64_t PCS40_PROT_CLR:1;
      uint64_t PCS41_PROT_CLR:1;
      uint64_t PCS42_PROT_CLR:1;
      uint64_t PCS43_PROT_CLR:1;
      uint64_t PCS44_PROT_CLR:1;
      uint64_t PCS45_PROT_CLR:1;
      uint64_t PCS46_PROT_CLR:1;
      uint64_t PCS47_PROT_CLR:1;
      uint64_t PCS48_PROT_CLR:1;
      uint64_t PCS49_PROT_CLR:1;
      uint64_t PCS50_PROT_CLR:1;
      uint64_t PCS51_PROT_CLR:1;
      uint64_t PCS52_PROT_CLR:1;
      uint64_t PCS53_PROT_CLR:1;
      uint64_t PCS54_PROT_CLR:1;
      uint64_t PCS55_PROT_CLR:1;
      uint64_t PCS56_PROT_CLR:1;
      uint64_t PCS57_PROT_CLR:1;
      uint64_t PCS58_PROT_CLR:1;
      uint64_t PCS59_PROT_CLR:1;
      uint64_t PCS60_PROT_CLR:1;
      uint64_t PCS61_PROT_CLR:1;
      uint64_t PCS62_PROT_CLR:1;
      uint64_t PCS63_PROT_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTCLR1;

