iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS50MSTID:16;
      uint64_t PCS51MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS25MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS52MSTID:16;
      uint64_t PCS53MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS26MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS54MSTID:16;
      uint64_t PCS55MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS27MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS56MSTID:16;
      uint64_t PCS57MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS28MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS58MSTID:16;
      uint64_t PCS59MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS29MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS60MSTID:16;
      uint64_t PCS61MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS30MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS62MSTID:16;
      uint64_t PCS63MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS31MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS0MSTID:16;
      uint64_t PPCS1MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS0MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS2MSTID:16;
      uint64_t PPCS3MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS1MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS4MSTID:16;
      uint64_t PPCS5MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS2MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS6MSTID:16;
      uint64_t PPCS7MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS3MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS8MSTID:16;
      uint64_t PPCS9MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS4MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS10MSTID:16;
      uint64_t PPCS11MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS5MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS12MSTID:16;
      uint64_t PPCS13MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS6MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS14MSTID:16;
      uint64_t PPCS15MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS7MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCREXT_MSTID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCREXTMSTID;

};

#define RCSS_PCR (*(volatile struct RCSS_PCR_tag *) 0x5f78000)

struct RCSS_ECAP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSCTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSCTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTRPHS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRPHS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP4;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPUTSEL:7;
      uint64_t NU_1:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP1POL:1;
      uint64_t CTRRST1:1;
      uint64_t CAP2POL:1;
      uint64_t CTRRST2:1;
      uint64_t CAP3POL:1;
      uint64_t CTRRST3:1;
      uint64_t CAP4POL:1;
      uint64_t CTRRST4:1;
      uint64_t CAPLDEN:1;
      uint64_t PRESCALE:5;
      uint64_t FREE_SOFT:2;
      uint64_t CONT_ONESHT:1;
      uint64_t STOP_WRAP:2;
      uint64_t REARM:1;
      uint64_t TSCTRSTOP:1;
      uint64_t SYNCI_EN:1;
      uint64_t SYNCO_SEL:2;
      uint64_t SWSYNC:1;
      uint64_t CAP_APWM:1;
      uint64_t APWMPOL:1;
      uint64_t CTRFILTRESET:1;
      uint64_t DMAEVTSEL:2;
      uint64_t MODCNTRSTS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCTL1_ECCTL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU_2:1;
      uint64_t CEVT1:1;
      uint64_t CEVT2:1;
      uint64_t CEVT3:1;
      uint64_t CEVT4:1;
      uint64_t CTROVF:1;
      uint64_t CTR_EQ_PRD:1;
      uint64_t CTR_EQ_CMP:1;
      uint64_t HRERROR:1;
      uint64_t NU_3:7;
      uint64_t INT_FLG:1;
      uint64_t CEVT1_FLG:1;
      uint64_t CEVT2_FLG:1;
      uint64_t CEVT3_FLG:1;
      uint64_t CEVT4_FLG:1;
      uint64_t CTROVF_FLG:1;
      uint64_t CTR_PRD_FLG:1;
      uint64_t CTR_CMP_FLG:1;
      uint64_t HRERROR_FLG:1;
      uint64_t NU_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECEINT_ECFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:1;
      uint64_t CEVT1:1;
      uint64_t CEVT2:1;
      uint64_t CEVT3:1;
      uint64_t CEVT4:1;
      uint64_t CTROVF:1;
      uint64_t CTR_PRD:1;
      uint64_t CTR_CMP:1;
      uint64_t HRERROR:1;
      uint64_t NU_5:8;
      uint64_t CEVT1_FRC:1;
      uint64_t CEVT2_FRC:1;
      uint64_t CEVT3_FRC:1;
      uint64_t CEVT4_FRC:1;
      uint64_t CTROVF_FRC:1;
      uint64_t CTR_PRD_FRC:1;
      uint64_t CTR_CMP_FRC:1;
      uint64_t HRERROR_FRC:1;
      uint64_t NU_6:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCLR_ECFRC;

