iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define RCSS_GIO (*(volatile struct RCSS_GIO_tag *) 0x5f7b400)

struct RCSS_SPIA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t nRESET:1;
      uint64_t NU:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIGCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASTER:1;
      uint64_t CLKMOD:1;
      uint64_t NU1:6;
      uint64_t POWERDOWN:1;
      uint64_t NU2:7;
      uint64_t LOOPBACK:1;
      uint64_t NU3:7;
      uint64_t SPIEN:1;
      uint64_t NU4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIGCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLENERRENA:1;
      uint64_t TIMEOUTENA:1;
      uint64_t PARERRENA:1;
      uint64_t DESYNCENA:1;
      uint64_t BITERRENA:1;
      uint64_t NU1:1;
      uint64_t OVRNINTENA:1;
      uint64_t NU2:1;
      uint64_t RXINTENA:1;
      uint64_t TXINTENA:1;
      uint64_t NU3:6;
      uint64_t DMAREQEN:1;
      uint64_t NU4:7;
      uint64_t ENABLEHIGHZ:1;
      uint64_t NU5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIINT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLENERRLVL:1;
      uint64_t TIMEOUTLVL:1;
      uint64_t PARERRLVL:1;
      uint64_t DESYNCLVL:1;
      uint64_t BITERRLVL:1;
      uint64_t NU1:1;
      uint64_t OVRNINTLVL:1;
      uint64_t NU2:1;
      uint64_t RXINTLVL:1;
      uint64_t TXINTLVL:1;
      uint64_t NU3:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPILVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLENERRFLG:1;
      uint64_t TIMEOUTFLG:1;
      uint64_t PARERRFLG:1;
      uint64_t DESYNCFLG:1;
      uint64_t BITERRFLG:1;
      uint64_t NU1:1;
      uint64_t OVRNINTFLG:1;
      uint64_t NU2:1;
      uint64_t RXINTFLG:1;
      uint64_t TXINTFLG:1;
      uint64_t NU3:14;
      uint64_t BUFINITACTIVE:1;
      uint64_t NU4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSFUN:8;
      uint64_t ENAFUN:1;
      uint64_t CLKFUN:1;
      uint64_t SIMOFUN0:1;
      uint64_t SOMIFUN0:1;
      uint64_t NU:4;
      uint64_t SIMOFUN:8;
      uint64_t SOMIFUN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSDIR:8;
      uint64_t ENADIR:1;
      uint64_t CLKDIR:1;
      uint64_t SIMODIR0:1;
      uint64_t SOMIDIR0:1;
      uint64_t NU:4;
      uint64_t SIMODIR:8;
      uint64_t SOMIDIR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSDIN:8;
      uint64_t ENADIN:1;
      uint64_t CLKDIN:1;
      uint64_t SIMODIN0:1;
      uint64_t SOMIDIN0:1;
      uint64_t NU:4;
      uint64_t SIMODIN:8;
      uint64_t SOMIDIN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSDOUT:8;
      uint64_t ENADOUT:1;
      uint64_t CLKDOUT:1;
      uint64_t SIMODOUT0:1;
      uint64_t SOMIDOUT0:1;
      uint64_t NU:4;
      uint64_t SIMODOUT:8;
      uint64_t SOMIDOUT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSSET:8;
      uint64_t ENASET:1;
      uint64_t CLKSET:1;
      uint64_t SIMOSET0:1;
      uint64_t SOMISET0:1;
      uint64_t NU:4;
      uint64_t SIMOSET:8;
      uint64_t SOMISET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSCLR:8;
      uint64_t ENACLR:1;
      uint64_t CLKCLR:1;
      uint64_t SIMOCLR0:1;
      uint64_t SOMICLR0:1;
      uint64_t NU:4;
      uint64_t SIMOCLR:8;
      uint64_t SOMICLR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSPDR:8;
      uint64_t ENAPDR:1;
      uint64_t CLKPDR:1;
      uint64_t SIMOPDR0:1;
      uint64_t SOMIPDR0:1;
      uint64_t NU:4;
      uint64_t SIMOPDR:8;
      uint64_t SOMIPDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC6;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIDAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t NU1:1;
      uint64_t CSHOLD:1;
      uint64_t NU2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIDAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLENERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIBUF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLENERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIEMU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2EDELAY:8;
      uint64_t T2EDELAY:8;
      uint64_t T2CDELAY:8;
      uint64_t C2TDELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIDELAY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSDEF0:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIDEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARLEN:5;
      uint64_t NU:3;
      uint64_t PRESCALE:8;
      uint64_t PHASE:1;
      uint64_t POLARITY:1;
      uint64_t DISCSTIMERS:1;
      uint64_t HDUPLEX_ENA:1;
      uint64_t SHIFTDIR:1;
      uint64_t WAITENA:1;
      uint64_t PARITYENA:1;
      uint64_t PARPOL:1;
      uint64_t WDELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARLEN:5;
      uint64_t NU:3;
      uint64_t PRESCALE:8;
      uint64_t PHASE:1;
      uint64_t POLARITY:1;
      uint64_t DISCSTIMERS:1;
      uint64_t HDUPLEX_ENA:1;
      uint64_t SHIFTDIR:1;
      uint64_t WAITENA:1;
      uint64_t PARITYENA:1;
      uint64_t PARPOL:1;
      uint64_t WDELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFMT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARLEN:5;
      uint64_t NU:3;
      uint64_t PRESCALE:8;
      uint64_t PHASE:1;
      uint64_t POLARITY:1;
      uint64_t DISCSTIMERS:1;
      uint64_t HDUPLEX_ENA:1;
      uint64_t SHIFTDIR:1;
      uint64_t WAITENA:1;
      uint64_t PARITYENA:1;
      uint64_t PARPOL:1;
      uint64_t WDELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFMT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARLEN:5;
      uint64_t NU:3;
      uint64_t PRESCALE:8;
      uint64_t PHASE:1;
      uint64_t POLARITY:1;
      uint64_t DISCSTIMERS:1;
      uint64_t HDUPLEX_ENA:1;
      uint64_t SHIFTDIR:1;
      uint64_t WAITENA:1;
      uint64_t PARITYENA:1;
      uint64_t PARPOL:1;
      uint64_t WDELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFMT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUSPEND0:1;
      uint64_t INTVECT0:5;
      uint64_t NU:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGINTVECT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUSPEND1:1;
      uint64_t INTVECT1:5;
      uint64_t NU:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGINTVECT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSSRS:8;
      uint64_t ENASRS:1;
      uint64_t CLKSRS:1;
      uint64_t SIMOSRS0:1;
      uint64_t SOMISRS0:1;
      uint64_t NU:4;
      uint64_t SIMOSRS7:8;
      uint64_t SOMISRS7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PMODE0:2;
      uint64_t MMODE0:3;
      uint64_t MODCLKPOL0:1;
      uint64_t HSM_MODE0:1;
      uint64_t NU1:1;
      uint64_t PMODE1:2;
      uint64_t MMODE1:3;
      uint64_t MODCLKPOL1:1;
      uint64_t HSM_MODE1:1;
      uint64_t NU2:1;
      uint64_t PMODE2:2;
      uint64_t MMODE2:3;
      uint64_t MODCLKPOL2:1;
      uint64_t HSM_MODE2:1;
      uint64_t NU3:1;
      uint64_t PMODE3:2;
      uint64_t MMODE3:3;
      uint64_t MODCLKPOL3:1;
      uint64_t HSM_MODE3:1;
      uint64_t NU4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSPIENA:1;
      uint64_t NU1:7;
      uint64_t EXTENDED_BUF_ENA:4;
      uint64_t NU2:4;
      uint64_t RXRAMACCESS:1;
      uint64_t NU3:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIBSPIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETINTENSUS:16;
      uint64_t SETINTENRDY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGITENST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRINTENSUS:16;
      uint64_t CLRINTENRDY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGITENCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETINTLVLSUS:16;
      uint64_t SETINTLVLRDY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGITLVST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRINTLVLSUS:16;
      uint64_t CLRINTLVLRDY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGITLVCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTFLGSUS:16;
      uint64_t INTFLGRDY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGINTFLAG;

