iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LARGE_COUNT:1;
      uint64_t NU:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACNTLEN;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDEN:4;
      uint64_t NU1:4;
      uint64_t PTESTEN:1;
      uint64_t NU2:7;
      uint64_t EDAC_MODE:4;
      uint64_t NU3:4;
      uint64_t SBE_EVT_EN:4;
      uint64_t NU4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAR_ECC_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UERR_FLG0:1;
      uint64_t UERR_FLG1:1;
      uint64_t NU1:6;
      uint64_t SBE_FLG0:1;
      uint64_t SBE_FLG1:1;
      uint64_t NU2:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAR_ECC_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UERRADDR1:11;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UERRADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UERRADDR0:11;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UERRADDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXOVRN_BUF_ADDR:11;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXOVRN_BUF_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPENA:1;
      uint64_t LPBKTYPE:1;
      uint64_t CTRLSCSPINERR:1;
      uint64_t ERRSCSPIN:3;
      uint64_t NU1:2;
      uint64_t IOLPBKTSTENA:4;
      uint64_t NU2:4;
      uint64_t CTRLDLENERR:1;
      uint64_t CTRLTIMEOUT:1;
      uint64_t CTRLPARERR:1;
      uint64_t CTRLDESYNC:1;
      uint64_t CTRLBITERR:1;
      uint64_t NU3:3;
      uint64_t SCSFAILFLG:1;
      uint64_t NU4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOLPBKTSTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPRESCLAE_FMT0:11;
      uint64_t NU1:5;
      uint64_t EPRESCLAE_FMT1:11;
      uint64_t NU2:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTENDED_PRESCALE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPRESCLAE_FMT2:11;
      uint64_t NU3:5;
      uint64_t EPRESCLAE_FMT3:11;
      uint64_t NU4:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTENDED_PRESCALE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECCDIAG_EN:4;
      uint64_t NU:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCDIAG_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEFLG0:1;
      uint64_t SEFLG1:1;
      uint64_t NU1:14;
      uint64_t DEFLG0:1;
      uint64_t DEFLG1:1;
      uint64_t NU2:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCDIAG_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBERRADDR1:11;
      uint64_t NU1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SBERRADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBERRADDR0:11;
      uint64_t NU2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SBERRADDR0;

  uint8_t res7[172];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR:6;
      uint64_t CUSTOM:2;
      uint64_t MAJOR:3;
      uint64_t RTL:5;
      uint64_t FUNC:12;
      uint64_t NU:2;
      uint64_t SCHEME:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIREV;

};

#define RCSS_SPIA (*(volatile struct RCSS_SPIA_tag *) 0x5f7e800)

struct RCSS_SPIB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t nRESET:1;
      uint64_t NU:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIGCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASTER:1;
      uint64_t CLKMOD:1;
      uint64_t NU1:6;
      uint64_t POWERDOWN:1;
      uint64_t NU2:7;
      uint64_t LOOPBACK:1;
      uint64_t NU3:7;
      uint64_t SPIEN:1;
      uint64_t NU4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIGCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLENERRENA:1;
      uint64_t TIMEOUTENA:1;
      uint64_t PARERRENA:1;
      uint64_t DESYNCENA:1;
      uint64_t BITERRENA:1;
      uint64_t NU1:1;
      uint64_t OVRNINTENA:1;
      uint64_t NU2:1;
      uint64_t RXINTENA:1;
      uint64_t TXINTENA:1;
      uint64_t NU3:6;
      uint64_t DMAREQEN:1;
      uint64_t NU4:7;
      uint64_t ENABLEHIGHZ:1;
      uint64_t NU5:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIINT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLENERRLVL:1;
      uint64_t TIMEOUTLVL:1;
      uint64_t PARERRLVL:1;
      uint64_t DESYNCLVL:1;
      uint64_t BITERRLVL:1;
      uint64_t NU1:1;
      uint64_t OVRNINTLVL:1;
      uint64_t NU2:1;
      uint64_t RXINTLVL:1;
      uint64_t TXINTLVL:1;
      uint64_t NU3:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPILVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLENERRFLG:1;
      uint64_t TIMEOUTFLG:1;
      uint64_t PARERRFLG:1;
      uint64_t DESYNCFLG:1;
      uint64_t BITERRFLG:1;
      uint64_t NU1:1;
      uint64_t OVRNINTFLG:1;
      uint64_t NU2:1;
      uint64_t RXINTFLG:1;
      uint64_t TXINTFLG:1;
      uint64_t NU3:14;
      uint64_t BUFINITACTIVE:1;
      uint64_t NU4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSFUN:8;
      uint64_t ENAFUN:1;
      uint64_t CLKFUN:1;
      uint64_t SIMOFUN0:1;
      uint64_t SOMIFUN0:1;
      uint64_t NU:4;
      uint64_t SIMOFUN:8;
      uint64_t SOMIFUN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSDIR:8;
      uint64_t ENADIR:1;
      uint64_t CLKDIR:1;
      uint64_t SIMODIR0:1;
      uint64_t SOMIDIR0:1;
      uint64_t NU:4;
      uint64_t SIMODIR:8;
      uint64_t SOMIDIR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSDIN:8;
      uint64_t ENADIN:1;
      uint64_t CLKDIN:1;
      uint64_t SIMODIN0:1;
      uint64_t SOMIDIN0:1;
      uint64_t NU:4;
      uint64_t SIMODIN:8;
      uint64_t SOMIDIN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSDOUT:8;
      uint64_t ENADOUT:1;
      uint64_t CLKDOUT:1;
      uint64_t SIMODOUT0:1;
      uint64_t SOMIDOUT0:1;
      uint64_t NU:4;
      uint64_t SIMODOUT:8;
      uint64_t SOMIDOUT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSSET:8;
      uint64_t ENASET:1;
      uint64_t CLKSET:1;
      uint64_t SIMOSET0:1;
      uint64_t SOMISET0:1;
      uint64_t NU:4;
      uint64_t SIMOSET:8;
      uint64_t SOMISET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSCLR:8;
      uint64_t ENACLR:1;
      uint64_t CLKCLR:1;
      uint64_t SIMOCLR0:1;
      uint64_t SOMICLR0:1;
      uint64_t NU:4;
      uint64_t SIMOCLR:8;
      uint64_t SOMICLR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSPDR:8;
      uint64_t ENAPDR:1;
      uint64_t CLKPDR:1;
      uint64_t SIMOPDR0:1;
      uint64_t SOMIPDR0:1;
      uint64_t NU:4;
      uint64_t SIMOPDR:8;
      uint64_t SOMIPDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC6;

