iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIDAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t NU1:1;
      uint64_t CSHOLD:1;
      uint64_t NU2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIDAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLENERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIBUF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLENERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIEMU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2EDELAY:8;
      uint64_t T2EDELAY:8;
      uint64_t T2CDELAY:8;
      uint64_t C2TDELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIDELAY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSDEF0:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIDEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARLEN:5;
      uint64_t NU:3;
      uint64_t PRESCALE:8;
      uint64_t PHASE:1;
      uint64_t POLARITY:1;
      uint64_t DISCSTIMERS:1;
      uint64_t HDUPLEX_ENA:1;
      uint64_t SHIFTDIR:1;
      uint64_t WAITENA:1;
      uint64_t PARITYENA:1;
      uint64_t PARPOL:1;
      uint64_t WDELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARLEN:5;
      uint64_t NU:3;
      uint64_t PRESCALE:8;
      uint64_t PHASE:1;
      uint64_t POLARITY:1;
      uint64_t DISCSTIMERS:1;
      uint64_t HDUPLEX_ENA:1;
      uint64_t SHIFTDIR:1;
      uint64_t WAITENA:1;
      uint64_t PARITYENA:1;
      uint64_t PARPOL:1;
      uint64_t WDELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFMT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARLEN:5;
      uint64_t NU:3;
      uint64_t PRESCALE:8;
      uint64_t PHASE:1;
      uint64_t POLARITY:1;
      uint64_t DISCSTIMERS:1;
      uint64_t HDUPLEX_ENA:1;
      uint64_t SHIFTDIR:1;
      uint64_t WAITENA:1;
      uint64_t PARITYENA:1;
      uint64_t PARPOL:1;
      uint64_t WDELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFMT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARLEN:5;
      uint64_t NU:3;
      uint64_t PRESCALE:8;
      uint64_t PHASE:1;
      uint64_t POLARITY:1;
      uint64_t DISCSTIMERS:1;
      uint64_t HDUPLEX_ENA:1;
      uint64_t SHIFTDIR:1;
      uint64_t WAITENA:1;
      uint64_t PARITYENA:1;
      uint64_t PARPOL:1;
      uint64_t WDELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFMT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUSPEND0:1;
      uint64_t INTVECT0:5;
      uint64_t NU:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGINTVECT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUSPEND1:1;
      uint64_t INTVECT1:5;
      uint64_t NU:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGINTVECT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSSRS:8;
      uint64_t ENASRS:1;
      uint64_t CLKSRS:1;
      uint64_t SIMOSRS0:1;
      uint64_t SOMISRS0:1;
      uint64_t NU:4;
      uint64_t SIMOSRS7:8;
      uint64_t SOMISRS7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PMODE0:2;
      uint64_t MMODE0:3;
      uint64_t MODCLKPOL0:1;
      uint64_t HSM_MODE0:1;
      uint64_t NU1:1;
      uint64_t PMODE1:2;
      uint64_t MMODE1:3;
      uint64_t MODCLKPOL1:1;
      uint64_t HSM_MODE1:1;
      uint64_t NU2:1;
      uint64_t PMODE2:2;
      uint64_t MMODE2:3;
      uint64_t MODCLKPOL2:1;
      uint64_t HSM_MODE2:1;
      uint64_t NU3:1;
      uint64_t PMODE3:2;
      uint64_t MMODE3:3;
      uint64_t MODCLKPOL3:1;
      uint64_t HSM_MODE3:1;
      uint64_t NU4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSPIENA:1;
      uint64_t NU1:7;
      uint64_t EXTENDED_BUF_ENA:4;
      uint64_t NU2:4;
      uint64_t RXRAMACCESS:1;
      uint64_t NU3:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIBSPIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETINTENSUS:16;
      uint64_t SETINTENRDY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGITENST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRINTENSUS:16;
      uint64_t CLRINTENRDY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGITENCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETINTLVLSUS:16;
      uint64_t SETINTLVLRDY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGITLVST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRINTLVLSUS:16;
      uint64_t CLRINTLVLRDY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGITLVCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTFLGSUS:16;
      uint64_t INTFLGRDY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGINTFLAG;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TICKVALUE:16;
      uint64_t NU:12;
      uint64_t CLKCTRL:2;
      uint64_t RELOAD:1;
      uint64_t TICKENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TICKCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU1:8;
      uint64_t LPEND:8;
      uint64_t NU2:8;
      uint64_t TGINSERVICE:5;
      uint64_t NU3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTGPEND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG0CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG1CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG2CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG3CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG4CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG5CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG6CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:8;
      uint64_t PSTART:8;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t NU:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG7CTRL;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:6;
      uint64_t COUNTBIT17:1;
      uint64_t BUFID7:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA0CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:6;
      uint64_t COUNTBIT17:1;
      uint64_t BUFID7:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:6;
      uint64_t COUNTBIT17:1;
      uint64_t BUFID7:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:6;
      uint64_t COUNTBIT17:1;
      uint64_t BUFID7:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA3CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:6;
      uint64_t COUNTBIT17:1;
      uint64_t BUFID7:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA4CTRL;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ICOUNT2;

  uint8_t res4[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT4;

