iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LARGE_COUNT:1;
      uint64_t NU:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACNTLEN;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDEN:4;
      uint64_t NU1:4;
      uint64_t PTESTEN:1;
      uint64_t NU2:7;
      uint64_t EDAC_MODE:4;
      uint64_t NU3:4;
      uint64_t SBE_EVT_EN:4;
      uint64_t NU4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAR_ECC_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UERR_FLG0:1;
      uint64_t UERR_FLG1:1;
      uint64_t NU1:6;
      uint64_t SBE_FLG0:1;
      uint64_t SBE_FLG1:1;
      uint64_t NU2:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAR_ECC_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UERRADDR1:11;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UERRADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UERRADDR0:11;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UERRADDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXOVRN_BUF_ADDR:11;
      uint64_t NU:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXOVRN_BUF_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPENA:1;
      uint64_t LPBKTYPE:1;
      uint64_t CTRLSCSPINERR:1;
      uint64_t ERRSCSPIN:3;
      uint64_t NU1:2;
      uint64_t IOLPBKTSTENA:4;
      uint64_t NU2:4;
      uint64_t CTRLDLENERR:1;
      uint64_t CTRLTIMEOUT:1;
      uint64_t CTRLPARERR:1;
      uint64_t CTRLDESYNC:1;
      uint64_t CTRLBITERR:1;
      uint64_t NU3:3;
      uint64_t SCSFAILFLG:1;
      uint64_t NU4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOLPBKTSTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPRESCLAE_FMT0:11;
      uint64_t NU1:5;
      uint64_t EPRESCLAE_FMT1:11;
      uint64_t NU2:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTENDED_PRESCALE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPRESCLAE_FMT2:11;
      uint64_t NU3:5;
      uint64_t EPRESCLAE_FMT3:11;
      uint64_t NU4:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTENDED_PRESCALE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECCDIAG_EN:4;
      uint64_t NU:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCDIAG_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEFLG0:1;
      uint64_t SEFLG1:1;
      uint64_t NU1:14;
      uint64_t DEFLG0:1;
      uint64_t DEFLG1:1;
      uint64_t NU2:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCDIAG_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBERRADDR1:11;
      uint64_t NU1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SBERRADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBERRADDR0:11;
      uint64_t NU2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SBERRADDR0;

  uint8_t res7[172];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR:6;
      uint64_t CUSTOM:2;
      uint64_t MAJOR:3;
      uint64_t RTL:5;
      uint64_t FUNC:12;
      uint64_t NU:2;
      uint64_t SCHEME:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIREV;

};

#define RCSS_SPIB (*(volatile struct RCSS_SPIB_tag *) 0x5f7ea00)

struct RCSS_I2CA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A9_A0:10;
      uint64_t NU:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AL:1;
      uint64_t NACK:1;
      uint64_t ARDY:1;
      uint64_t ICRRDY:1;
      uint64_t ICXRDY:1;
      uint64_t SCD:1;
      uint64_t AAS:1;
      uint64_t NU:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AL:1;
      uint64_t NACK:1;
      uint64_t ARDY:1;
      uint64_t ICRRDY:1;
      uint64_t ICXRDY:1;
      uint64_t SCD:1;
      uint64_t NU1:2;
      uint64_t AD0:1;
      uint64_t AAS:1;
      uint64_t XSMT:1;
      uint64_t RSFULL:1;
      uint64_t BB:1;
      uint64_t NACKSNT:1;
      uint64_t SDIR:1;
      uint64_t NU2:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICCL15_ICCL0:16;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICCLKL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICCH15_ICCLH0:16;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICCLKH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICDC15_ICDC0:16;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D7_D0:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A9_A0:10;
      uint64_t NU:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D7_D0:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDXR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BC2_BC1_BC0:3;
      uint64_t FDF:1;
      uint64_t STB:1;
      uint64_t IRS:1;
      uint64_t DLB:1;
      uint64_t RM:1;
      uint64_t XA:1;
      uint64_t TRX:1;
      uint64_t MST:1;
      uint64_t STP:1;
      uint64_t NU1:1;
      uint64_t STT:1;
      uint64_t FREE:1;
      uint64_t NACKMOD:1;
      uint64_t NU2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTCODE:3;
      uint64_t NU1:5;
      uint64_t TESTMD:4;
      uint64_t NU2:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BCM:1;
      uint64_t IGNACK:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICEMDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPSC7_IPSC0:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REVISION:8;
      uint64_t CLASS:8;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TYPE:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDMAEN:1;
      uint64_t TXDMAEN:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDMAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_RESERVED1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_RESERVED2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFUNC0:1;
      uint64_t NU:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPFUNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIR0:1;
      uint64_t PDIR1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIN0:1;
      uint64_t PDIN1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDOUT0:1;
      uint64_t PDOUT1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDSET0:1;
      uint64_t PDSET1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDCLR0:1;
      uint64_t PDCLR1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDRV0:1;
      uint64_t PDRV1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDRV;

