iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define RCSS_I2CA (*(volatile struct RCSS_I2CA_tag *) 0x5f7ec00)

struct RCSS_I2CB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A9_A0:10;
      uint64_t NU:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AL:1;
      uint64_t NACK:1;
      uint64_t ARDY:1;
      uint64_t ICRRDY:1;
      uint64_t ICXRDY:1;
      uint64_t SCD:1;
      uint64_t AAS:1;
      uint64_t NU:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AL:1;
      uint64_t NACK:1;
      uint64_t ARDY:1;
      uint64_t ICRRDY:1;
      uint64_t ICXRDY:1;
      uint64_t SCD:1;
      uint64_t NU1:2;
      uint64_t AD0:1;
      uint64_t AAS:1;
      uint64_t XSMT:1;
      uint64_t RSFULL:1;
      uint64_t BB:1;
      uint64_t NACKSNT:1;
      uint64_t SDIR:1;
      uint64_t NU2:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICCL15_ICCL0:16;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICCLKL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICCH15_ICCLH0:16;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICCLKH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICDC15_ICDC0:16;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D7_D0:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A9_A0:10;
      uint64_t NU:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D7_D0:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDXR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BC2_BC1_BC0:3;
      uint64_t FDF:1;
      uint64_t STB:1;
      uint64_t IRS:1;
      uint64_t DLB:1;
      uint64_t RM:1;
      uint64_t XA:1;
      uint64_t TRX:1;
      uint64_t MST:1;
      uint64_t STP:1;
      uint64_t NU1:1;
      uint64_t STT:1;
      uint64_t FREE:1;
      uint64_t NACKMOD:1;
      uint64_t NU2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTCODE:3;
      uint64_t NU1:5;
      uint64_t TESTMD:4;
      uint64_t NU2:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BCM:1;
      uint64_t IGNACK:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICEMDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPSC7_IPSC0:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REVISION:8;
      uint64_t CLASS:8;
      uint64_t NU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TYPE:8;
      uint64_t NU:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDMAEN:1;
      uint64_t TXDMAEN:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICDMAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_RESERVED1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_RESERVED2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFUNC0:1;
      uint64_t NU:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPFUNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIR0:1;
      uint64_t PDIR1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIN0:1;
      uint64_t PDIN1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDOUT0:1;
      uint64_t PDOUT1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDSET0:1;
      uint64_t PDSET1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDCLR0:1;
      uint64_t PDCLR1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDRV0:1;
      uint64_t PDRV1:1;
      uint64_t NU:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPDRV;

};

#define RCSS_I2CB (*(volatile struct RCSS_I2CB_tag *) 0x5f7f000)

struct DSS_RCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREVIOUS_NAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t interrupt_mask:1;
      uint64_t reservedSpace0:3;
      uint64_t proc_halt:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t wakeup_trigger:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_TRIGGER_WAKUP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t sleep_trigger:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_TRIGGER_SLEEP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t proc_halted:1;
      uint64_t reservedSpace0:3;
      uint64_t pd_status:2;
      uint64_t reservedSpace1:2;
      uint64_t pwrsm_dbg_ovrd:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t pwrsm_porrst_assertcnt:6;
      uint64_t pwrsm_grst_assertcnt:6;
      uint64_t pwrsm_lrst_assertcnt:6;
      uint64_t pwrsm_porrst_deassertcnt:6;
      uint64_t pwrsm_grst_deassertcnt:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_CTRL_MISC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t pwrsm_lrst_deassertcnt:6;
      uint64_t pwrsm_clkstop_deassertcnt:6;
      uint64_t pwrsm_isoen_assertcnt:6;
      uint64_t pwrsm_lresetout_mask:1;
      uint64_t reservedSpace0:1;
      uint64_t rst_sync_bypass:3;
      uint64_t reservedSpace1:1;
      uint64_t iso_sync_bypass:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_CTRL_MISC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t state:6;
      uint64_t reservedSpace0:1;
      uint64_t pwrsm_ponout:1;
      uint64_t pwrsm_pgoodout:1;
      uint64_t pwrsm_mem_ponout:1;
      uint64_t pwrsm_mem_pgoodout:1;
      uint64_t pwrsm_mem_aonout:1;
      uint64_t pwrsm_mem_agoodout:1;
      uint64_t pwrsm_sdma_scr2async_clkstop_req:1;
      uint64_t pwrsm_sdma_async2rcm_clkstop_req:1;
      uint64_t pwrsm_sdma_async2scr_clkstop_ack:1;
      uint64_t pwrsm_c66_clkstop_ack:1;
      uint64_t pwrsm_lrstout:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_STATUS_MISC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t wakeup_mask0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_WAKEUP_MASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t wakeup_mask1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_WAKEUP_MASK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t wakeup_mask2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_WAKEUP_MASK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t wakeup_status0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_WAKEUP_STATUS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t wakeup_status1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_WAKEUP_STATUS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t wakeup_status2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_WAKEUP_STATUS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t wakeup_status0_clr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_WAKEUP_STATUS0_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t wakeup_status1_clr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_WAKEUP_STATUS1_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t wakeup_status2_clr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_WAKEUP_STATUS2_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t missed_event_mask0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_MISSED_EVENT_MASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t missed_event_mask1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_MISSED_EVENT_MASK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t missed_event_mask2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_MISSED_EVENT_MASK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t missed_event_status0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_MISSED_EVENT_STATUS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t missed_event_status1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_MISSED_EVENT_STATUS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t missed_event_status2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_MISSED_EVENT_STATUS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t lrst_cause:8;
      uint64_t grst_cause:8;
      uint64_t por_cause:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_RST_CAUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clear:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_RST_CAUSE_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t mode_enable:2;
      uint64_t stc_boot_en:1;
      uint64_t proc_halt:1;
      uint64_t stc_clk_stp_ack_mask:1;
      uint64_t stc_b2b_en:1;
      uint64_t pbist_selftest_key:4;
      uint64_t pbist_tmode_vlct_deassertcnt:6;
      uint64_t pbist_tmode_vlct_assertcnt:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_STC_PBIST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t pbist_status:2;
      uint64_t stc_pbist_sm_status:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_STC_PBIST_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t byp_en:16;
      uint64_t byp_value:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_STC_PBIST_CTRL_MISC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t sm_ovr_en:1;
      uint64_t sm_ovr_val:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_STC_PBIST_CTRL_MISC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t sm_trig:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_STC_PBIST_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clear:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_STC_PBIST_STATUS_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_RTIA_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_RTIB_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_WDT_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clksrcsel:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_SCIA_CLK_SRC_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_RTIA_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_RTIB_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_WDT_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkdiv:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_SCIA_CLK_DIV_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_RTIA_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_RTIB_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_WDT_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_SCIA_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gated:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CBUFF_CLK_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_RTIA_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_RTIB_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_WDT_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clkinuse:8;
      uint64_t currdivider:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_SCIA_CLK_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert_por:3;
      uint64_t reservedSpace0:1;
      uint64_t assert_global:3;
      uint64_t reservedSpace1:1;
      uint64_t assert_local:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_ESM_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_SCIA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_RTIA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_RTIB_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_WDT_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DCCA_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DCCB_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MCRC_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t div_factor:4;
      uint64_t clk_disable:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_DFT_DIV_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_L2_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA0_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA1_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA2_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA3_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB0_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB1_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB2_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB3_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC0_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC1_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC2_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC3_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD0_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD1_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD2_PD_CTRL;

