iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t iso:3;
      uint64_t reservedSpace0:1;
      uint64_t aonin:3;
      uint64_t reservedSpace1:1;
      uint64_t agoodin:3;
      uint64_t reservedSpace2:1;
      uint64_t ponin:3;
      uint64_t reservedSpace3:1;
      uint64_t pgoodin:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_L2_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA0_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA1_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA2_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA3_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB0_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB1_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB2_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB3_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC0_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC1_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC2_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC3_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD0_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD1_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t aonin:1;
      uint64_t agoodin:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD2_PD_STATUS;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t aonout:1;
      uint64_t agoodout:1;
      uint64_t ponout:1;
      uint64_t pgoodout:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_PD_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t divratio:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_TRCCLK_DIVRATIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t divratio:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_TCLK_DIVRATIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t seed:28;
      uint64_t enable:3;
      uint64_t load:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_DITHERED_CLK_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t set:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_PD_CTRL_STICKYBIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t pwrsm_pgood_assertcnt:16;
      uint64_t pwrsm_agood_assertcnt:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_CTRL_MISC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t pwrs_pd_waitcnt:16;
      uint64_t lreset_req_gate:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_CTRL_MISC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bypass_val:24;
      uint64_t state_bypass_val:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_CTRL_OVERRIDE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bypass_en:24;
      uint64_t state_bypass_en:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_CTRL_OVERRIDE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t override_enable:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_PD_CTRL_OVERRIDE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_RST_CTRL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_RST_CTRL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_EDMA_RST_CTRL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_EDMA_RST_CTRL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert_tc0:3;
      uint64_t reservedSpace0:1;
      uint64_t assert_tc1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_EDMA_RST_CTRL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert_tc0:3;
      uint64_t reservedSpace0:1;
      uint64_t assert_tc1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_EDMA_RST_CTRL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert_tc0:3;
      uint64_t reservedSpace0:1;
      uint64_t assert_tc1:3;
      uint64_t reservedSpace1:1;
      uint64_t assert_tc2:3;
      uint64_t reservedSpace2:1;
      uint64_t assert_tc3:3;
      uint64_t reservedSpace3:1;
      uint64_t assert_tc4:3;
      uint64_t reservedSpace4:1;
      uint64_t assert_tc5:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTCC_RST_CTRL;

  uint8_t res2[3564];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_wph:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_WPH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rec0:1;
      uint64_t hw_spare_rec1:1;
      uint64_t hw_spare_rec2:1;
      uint64_t hw_spare_rec3:1;
      uint64_t hw_spare_rec4:1;
      uint64_t hw_spare_rec5:1;
      uint64_t hw_spare_rec6:1;
      uint64_t hw_spare_rec7:1;
      uint64_t hw_spare_rec8:1;
      uint64_t hw_spare_rec9:1;
      uint64_t hw_spare_rec10:1;
      uint64_t hw_spare_rec11:1;
      uint64_t hw_spare_rec12:1;
      uint64_t hw_spare_rec13:1;
      uint64_t hw_spare_rec14:1;
      uint64_t hw_spare_rec15:1;
      uint64_t hw_spare_rec16:1;
      uint64_t hw_spare_rec17:1;
      uint64_t hw_spare_rec18:1;
      uint64_t hw_spare_rec19:1;
      uint64_t hw_spare_rec20:1;
      uint64_t hw_spare_rec21:1;
      uint64_t hw_spare_rec22:1;
      uint64_t hw_spare_rec23:1;
      uint64_t hw_spare_rec24:1;
      uint64_t hw_spare_rec25:1;
      uint64_t hw_spare_rec26:1;
      uint64_t hw_spare_rec27:1;
      uint64_t hw_spare_rec28:1;
      uint64_t hw_spare_rec29:1;
      uint64_t hw_spare_rec30:1;
      uint64_t hw_spare_rec31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REC;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_raw_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enabled_status_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eoi;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_type_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b19_8:12;
      uint64_t b31_20:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_attr_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_clear;

