iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define DSS_RCM (*(volatile struct DSS_RCM_tag *) 0x6000000)

struct DSS_CTRL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREVIOUS_NAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dss_swint:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_SW_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_errint:1;
      uint64_t tpcc_a_mpint:1;
      uint64_t tptc_a0_err:1;
      uint64_t tptc_a1_err:1;
      uint64_t reservedSpace0:4;
      uint64_t tpcc_a_parity_err:1;
      uint64_t reservedSpace1:7;
      uint64_t tpcc_a_write_access_error:1;
      uint64_t tptc_a0_write_access_error:1;
      uint64_t tptc_a1_write_access_error:1;
      uint64_t reservedSpace2:5;
      uint64_t tpcc_a_read_access_error:1;
      uint64_t tptc_a0_read_access_error:1;
      uint64_t tptc_a1_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_A_ERRAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_errint:1;
      uint64_t tpcc_a_mpint:1;
      uint64_t tptc_a0_err:1;
      uint64_t tptc_a1_err:1;
      uint64_t reservedSpace0:4;
      uint64_t tpcc_a_parity_err:1;
      uint64_t reservedSpace1:7;
      uint64_t tpcc_a_write_access_error:1;
      uint64_t tptc_a0_write_access_error:1;
      uint64_t tptc_a1_write_access_error:1;
      uint64_t reservedSpace2:5;
      uint64_t tpcc_a_read_access_error:1;
      uint64_t tptc_a0_read_access_error:1;
      uint64_t tptc_a1_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_A_ERRAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_errint:1;
      uint64_t tpcc_a_mpint:1;
      uint64_t tptc_a0_err:1;
      uint64_t tptc_a1_err:1;
      uint64_t reservedSpace0:4;
      uint64_t tpcc_a_parity_err:1;
      uint64_t reservedSpace1:7;
      uint64_t tpcc_a_write_access_error:1;
      uint64_t tptc_a0_write_access_error:1;
      uint64_t tptc_a1_write_access_error:1;
      uint64_t reservedSpace2:5;
      uint64_t tpcc_a_read_access_error:1;
      uint64_t tptc_a0_read_access_error:1;
      uint64_t tptc_a1_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_A_ERRAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_intg:1;
      uint64_t tpcc_a_int0:1;
      uint64_t tpcc_a_int1:1;
      uint64_t tpcc_a_int2:1;
      uint64_t tpcc_a_int3:1;
      uint64_t tpcc_a_int4:1;
      uint64_t tpcc_a_int5:1;
      uint64_t tpcc_a_int6:1;
      uint64_t tpcc_a_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_a0:1;
      uint64_t tptc_a1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_A_INTAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_intg:1;
      uint64_t tpcc_a_int0:1;
      uint64_t tpcc_a_int1:1;
      uint64_t tpcc_a_int2:1;
      uint64_t tpcc_a_int3:1;
      uint64_t tpcc_a_int4:1;
      uint64_t tpcc_a_int5:1;
      uint64_t tpcc_a_int6:1;
      uint64_t tpcc_a_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_a0:1;
      uint64_t tptc_a1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_A_INTAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_intg:1;
      uint64_t tpcc_a_int0:1;
      uint64_t tpcc_a_int1:1;
      uint64_t tpcc_a_int2:1;
      uint64_t tpcc_a_int3:1;
      uint64_t tpcc_a_int4:1;
      uint64_t tpcc_a_int5:1;
      uint64_t tpcc_a_int6:1;
      uint64_t tpcc_a_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_a0:1;
      uint64_t tptc_a1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_A_INTAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_b_errint:1;
      uint64_t tpcc_b_mpint:1;
      uint64_t tptc_b0_err:1;
      uint64_t tptc_b1_err:1;
      uint64_t reservedSpace0:4;
      uint64_t tpcc_b_parity_err:1;
      uint64_t reservedSpace1:7;
      uint64_t tpcc_b_write_access_error:1;
      uint64_t tptc_b0_write_access_error:1;
      uint64_t tptc_b1_write_access_error:1;
      uint64_t reservedSpace2:5;
      uint64_t tpcc_b_read_access_error:1;
      uint64_t tptc_b0_read_access_error:1;
      uint64_t tptc_b1_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_B_ERRAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_b_errint:1;
      uint64_t tpcc_b_mpint:1;
      uint64_t tptc_b0_err:1;
      uint64_t tptc_b1_err:1;
      uint64_t reservedSpace0:4;
      uint64_t tpcc_b_parity_err:1;
      uint64_t reservedSpace1:7;
      uint64_t tpcc_b_write_access_error:1;
      uint64_t tptc_b0_write_access_error:1;
      uint64_t tptc_b1_write_access_error:1;
      uint64_t reservedSpace2:5;
      uint64_t tpcc_b_read_access_error:1;
      uint64_t tptc_b0_read_access_error:1;
      uint64_t tptc_b1_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_B_ERRAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_b_errint:1;
      uint64_t tpcc_b_mpint:1;
      uint64_t tptc_b0_err:1;
      uint64_t tptc_b1_err:1;
      uint64_t reservedSpace0:4;
      uint64_t tpcc_b_parity_err:1;
      uint64_t reservedSpace1:7;
      uint64_t tpcc_b_write_access_error:1;
      uint64_t tptc_b0_write_access_error:1;
      uint64_t tptc_b1_write_access_error:1;
      uint64_t reservedSpace2:5;
      uint64_t tpcc_b_read_access_error:1;
      uint64_t tptc_b0_read_access_error:1;
      uint64_t tptc_b1_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_B_ERRAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_b_intg:1;
      uint64_t tpcc_b_int0:1;
      uint64_t tpcc_b_int1:1;
      uint64_t tpcc_b_int2:1;
      uint64_t tpcc_b_int3:1;
      uint64_t tpcc_b_int4:1;
      uint64_t tpcc_b_int5:1;
      uint64_t tpcc_b_int6:1;
      uint64_t tpcc_b_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_b0:1;
      uint64_t tptc_b1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_B_INTAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_b_intg:1;
      uint64_t tpcc_b_int0:1;
      uint64_t tpcc_b_int1:1;
      uint64_t tpcc_b_int2:1;
      uint64_t tpcc_b_int3:1;
      uint64_t tpcc_b_int4:1;
      uint64_t tpcc_b_int5:1;
      uint64_t tpcc_b_int6:1;
      uint64_t tpcc_b_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_b0:1;
      uint64_t tptc_b1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_B_INTAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_b_intg:1;
      uint64_t tpcc_b_int0:1;
      uint64_t tpcc_b_int1:1;
      uint64_t tpcc_b_int2:1;
      uint64_t tpcc_b_int3:1;
      uint64_t tpcc_b_int4:1;
      uint64_t tpcc_b_int5:1;
      uint64_t tpcc_b_int6:1;
      uint64_t tpcc_b_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_b0:1;
      uint64_t tptc_b1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_B_INTAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_c_errint:1;
      uint64_t tpcc_c_mpint:1;
      uint64_t tptc_c0_err:1;
      uint64_t tptc_c1_err:1;
      uint64_t tptc_c2_err:1;
      uint64_t tptc_c3_err:1;
      uint64_t tptc_c4_err:1;
      uint64_t tptc_c5_err:1;
      uint64_t tpcc_c_parity_err:1;
      uint64_t reservedSpace0:7;
      uint64_t tpcc_c_write_access_error:1;
      uint64_t tptc_c0_write_access_error:1;
      uint64_t tptc_c1_write_access_error:1;
      uint64_t tptc_c2_write_access_error:1;
      uint64_t tptc_c3_write_access_error:1;
      uint64_t tptc_c4_write_access_error:1;
      uint64_t tptc_c5_write_access_error:1;
      uint64_t reservedSpace1:1;
      uint64_t tpcc_c_read_access_error:1;
      uint64_t tptc_c0_read_access_error:1;
      uint64_t tptc_c1_read_access_error:1;
      uint64_t tptc_c2_read_access_error:1;
      uint64_t tptc_c3_read_access_error:1;
      uint64_t tptc_c4_read_access_error:1;
      uint64_t tptc_c5_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_C_ERRAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_c_errint:1;
      uint64_t tpcc_c_mpint:1;
      uint64_t tptc_c0_err:1;
      uint64_t tptc_c1_err:1;
      uint64_t tptc_c2_err:1;
      uint64_t tptc_c3_err:1;
      uint64_t tptc_c4_err:1;
      uint64_t tptc_c5_err:1;
      uint64_t tpcc_c_parity_err:1;
      uint64_t reservedSpace0:7;
      uint64_t tpcc_c_write_access_error:1;
      uint64_t tptc_c0_write_access_error:1;
      uint64_t tptc_c1_write_access_error:1;
      uint64_t tptc_c2_write_access_error:1;
      uint64_t tptc_c3_write_access_error:1;
      uint64_t tptc_c4_write_access_error:1;
      uint64_t tptc_c5_write_access_error:1;
      uint64_t reservedSpace1:1;
      uint64_t tpcc_c_read_access_error:1;
      uint64_t tptc_c0_read_access_error:1;
      uint64_t tptc_c1_read_access_error:1;
      uint64_t tptc_c2_read_access_error:1;
      uint64_t tptc_c3_read_access_error:1;
      uint64_t tptc_c4_read_access_error:1;
      uint64_t tptc_c5_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_C_ERRAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_c_errint:1;
      uint64_t tpcc_c_mpint:1;
      uint64_t tptc_c0_err:1;
      uint64_t tptc_c1_err:1;
      uint64_t tptc_c2_err:1;
      uint64_t tptc_c3_err:1;
      uint64_t tptc_c4_err:1;
      uint64_t tptc_c5_err:1;
      uint64_t tpcc_c_parity_err:1;
      uint64_t reservedSpace0:7;
      uint64_t tpcc_c_write_access_error:1;
      uint64_t tptc_c0_write_access_error:1;
      uint64_t tptc_c1_write_access_error:1;
      uint64_t tptc_c2_write_access_error:1;
      uint64_t tptc_c3_write_access_error:1;
      uint64_t tptc_c4_write_access_error:1;
      uint64_t tptc_c5_write_access_error:1;
      uint64_t reservedSpace1:1;
      uint64_t tpcc_c_read_access_error:1;
      uint64_t tptc_c0_read_access_error:1;
      uint64_t tptc_c1_read_access_error:1;
      uint64_t tptc_c2_read_access_error:1;
      uint64_t tptc_c3_read_access_error:1;
      uint64_t tptc_c4_read_access_error:1;
      uint64_t tptc_c5_read_access_error:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_C_ERRAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_c_intg:1;
      uint64_t tpcc_c_int0:1;
      uint64_t tpcc_c_int1:1;
      uint64_t tpcc_c_int2:1;
      uint64_t tpcc_c_int3:1;
      uint64_t tpcc_c_int4:1;
      uint64_t tpcc_c_int5:1;
      uint64_t tpcc_c_int6:1;
      uint64_t tpcc_c_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_c0:1;
      uint64_t tptc_c1:1;
      uint64_t tptc_c2:1;
      uint64_t tptc_c3:1;
      uint64_t tptc_c4:1;
      uint64_t tptc_c5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_C_INTAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_c_intg:1;
      uint64_t tpcc_c_int0:1;
      uint64_t tpcc_c_int1:1;
      uint64_t tpcc_c_int2:1;
      uint64_t tpcc_c_int3:1;
      uint64_t tpcc_c_int4:1;
      uint64_t tpcc_c_int5:1;
      uint64_t tpcc_c_int6:1;
      uint64_t tpcc_c_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_c0:1;
      uint64_t tptc_c1:1;
      uint64_t tptc_c2:1;
      uint64_t tptc_c3:1;
      uint64_t tptc_c4:1;
      uint64_t tptc_c5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_C_INTAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_c_intg:1;
      uint64_t tpcc_c_int0:1;
      uint64_t tpcc_c_int1:1;
      uint64_t tpcc_c_int2:1;
      uint64_t tpcc_c_int3:1;
      uint64_t tpcc_c_int4:1;
      uint64_t tpcc_c_int5:1;
      uint64_t tpcc_c_int6:1;
      uint64_t tpcc_c_int7:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_c0:1;
      uint64_t tptc_c1:1;
      uint64_t tptc_c2:1;
      uint64_t tptc_c3:1;
      uint64_t tptc_c4:1;
      uint64_t tptc_c5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_C_INTAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_meminit_start:1;
      uint64_t tpcc_b_meminit_start:1;
      uint64_t tpcc_c_meminit_start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_MEMINIT_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_meminit_status:1;
      uint64_t tpcc_b_meminit_status:1;
      uint64_t tpcc_c_meminit_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tpcc_a_meminit_done:1;
      uint64_t tpcc_b_meminit_done:1;
      uint64_t tpcc_c_meminit_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:8;
      uint64_t err_clear:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_L2RAM_PARITY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr0:12;
      uint64_t reservedSpace0:4;
      uint64_t addr1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_L2RAM_PARITY_ERR_STATUS_VB0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr0:12;
      uint64_t reservedSpace0:4;
      uint64_t addr1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_L2RAM_PARITY_ERR_STATUS_VB1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr0:12;
      uint64_t reservedSpace0:4;
      uint64_t addr1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_L2RAM_PARITY_ERR_STATUS_VB2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t addr0:12;
      uint64_t reservedSpace0:4;
      uint64_t addr1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_L2RAM_PARITY_ERR_STATUS_VB3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t vb00:1;
      uint64_t vb01:1;
      uint64_t vb10:1;
      uint64_t vb11:1;
      uint64_t vb20:1;
      uint64_t vb21:1;
      uint64_t vb30:1;
      uint64_t vb31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_L2RAM_MEMINIT_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t vb00:1;
      uint64_t vb01:1;
      uint64_t vb10:1;
      uint64_t vb11:1;
      uint64_t vb20:1;
      uint64_t vb21:1;
      uint64_t vb30:1;
      uint64_t vb31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_L2RAM_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t vb00:1;
      uint64_t vb01:1;
      uint64_t vb10:1;
      uint64_t vb11:1;
      uint64_t vb20:1;
      uint64_t vb21:1;
      uint64_t vb30:1;
      uint64_t vb31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_L2RAM_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t vb00:1;
      uint64_t vb01:1;
      uint64_t vb10:1;
      uint64_t vb11:1;
      uint64_t vb20:1;
      uint64_t vb21:1;
      uint64_t vb30:1;
      uint64_t vb31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_L2RAM_PARITY_MEMINIT_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t vb00:1;
      uint64_t vb01:1;
      uint64_t vb10:1;
      uint64_t vb11:1;
      uint64_t vb20:1;
      uint64_t vb21:1;
      uint64_t vb30:1;
      uint64_t vb31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_L2RAM_PARITY_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t vb00:1;
      uint64_t vb01:1;
      uint64_t vb10:1;
      uint64_t vb11:1;
      uint64_t vb20:1;
      uint64_t vb21:1;
      uint64_t vb30:1;
      uint64_t vb31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_L2RAM_PARITY_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t l3ram0_meminit_start:1;
      uint64_t l3ram1_meminit_start:1;
      uint64_t l3ram2_meminit_start:1;
      uint64_t l3ram3_meminit_start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3RAM_MEMINIT_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t l3ram0_meminit_status:1;
      uint64_t l3ram1_meminit_status:1;
      uint64_t l3ram2_meminit_status:1;
      uint64_t l3ram3_meminit_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3RAM_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t l3ram0_meminit_done:1;
      uint64_t l3ram1_meminit_done:1;
      uint64_t l3ram2_meminit_done:1;
      uint64_t l3ram3_meminit_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3RAM_MEMINIT_DONE;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t meminit_start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MAILBOX_MEMINIT_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t meminit_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MAILBOX_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t meminit_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MAILBOX_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t parity_en:1;
      uint64_t parity_testen:1;
      uint64_t parity_err_clr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_A_PARITY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t parity_en:1;
      uint64_t parity_testen:1;
      uint64_t parity_err_clr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_B_PARITY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t parity_en:1;
      uint64_t parity_testen:1;
      uint64_t parity_err_clr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_C_PARITY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t parity_addr:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_A_PARITY_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t parity_addr:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_B_PARITY_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t parity_addr:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPCC_C_PARITY_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tptc_a0:2;
      uint64_t tptc_a1:2;
      uint64_t tptc_b0:2;
      uint64_t tptc_b1:2;
      uint64_t tptc_c0:2;
      uint64_t tptc_c1:2;
      uint64_t tptc_c2:2;
      uint64_t tptc_c3:2;
      uint64_t tptc_c4:2;
      uint64_t tptc_c5:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPTC_DBS_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISTP_RST_VAL:22;
      uint64_t reservedSpace0:2;
      uint64_t L1D_CACHE_MODE:1;
      uint64_t L1P_CACHE_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_BOOTCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gate:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_NMI_GATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dss_pbist_st_key:4;
      uint64_t dss_pbist_st_reset:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PBIST_KEY_RESET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dss_pbist_reg0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PBIST_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dss_pbist_reg1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PBIST_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tptc_a0_size:6;
      uint64_t reservedSpace0:2;
      uint64_t tptc_a1_size:6;
      uint64_t reservedSpace1:2;
      uint64_t tptc_b0_size:6;
      uint64_t reservedSpace2:2;
      uint64_t tptc_b1_size:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_BOUNDARY_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tptc_c0_size:6;
      uint64_t reservedSpace0:2;
      uint64_t tptc_c1_size:6;
      uint64_t reservedSpace1:2;
      uint64_t tptc_c2_size:6;
      uint64_t reservedSpace2:2;
      uint64_t tptc_c3_size:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_BOUNDARY_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tptc_c4_size:6;
      uint64_t reservedSpace0:2;
      uint64_t tptc_c5_size:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_BOUNDARY_CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tptc_a0_disable:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_a1_disable:1;
      uint64_t reservedSpace1:7;
      uint64_t tptc_b0_disable:1;
      uint64_t reservedSpace2:7;
      uint64_t tptc_b1_disable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_XID_REORDER_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tptc_c0_disable:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_c1_disable:1;
      uint64_t reservedSpace1:7;
      uint64_t tptc_c2_disable:1;
      uint64_t reservedSpace2:7;
      uint64_t tptc_c3_disable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_XID_REORDER_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tptc_c4_disable:1;
      uint64_t reservedSpace0:7;
      uint64_t tptc_c5_disable:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_XID_REORDER_CFG2;

