iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t esm_gating:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESM_GATING0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t esm_gating:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESM_GATING1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t esm_gating:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESM_GATING2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t esm_gating:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESM_GATING3;

  uint8_t res2[1096];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dss_rcm_rd:1;
      uint64_t dss_rcm_wr:1;
      uint64_t dss_ctrl_rd:1;
      uint64_t dss_ctrl_wr:1;
      uint64_t dss_cm4_ctrl_rd:1;
      uint64_t dss_cm4_ctrl_wr:1;
      uint64_t dss_hwa_cfg_rd:1;
      uint64_t dss_hwa_cfg_wr:1;
      uint64_t rcss_rcm_rd:1;
      uint64_t rcss_rcm_wr:1;
      uint64_t rcss_ctrl_rd:1;
      uint64_t rcss_ctrl_wr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PERIPH_ERRAGG_MASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dss_rcm_rd:1;
      uint64_t dss_rcm_wr:1;
      uint64_t dss_ctrl_rd:1;
      uint64_t dss_ctrl_wr:1;
      uint64_t dss_cm4_ctrl_rd:1;
      uint64_t dss_cm4_ctrl_wr:1;
      uint64_t dss_hwa_cfg_rd:1;
      uint64_t dss_hwa_cfg_wr:1;
      uint64_t rcss_rcm_rd:1;
      uint64_t rcss_rcm_wr:1;
      uint64_t rcss_ctrl_rd:1;
      uint64_t rcss_ctrl_wr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PERIPH_ERRAGG_STATUS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dss_rcm_rd:1;
      uint64_t dss_rcm_wr:1;
      uint64_t dss_ctrl_rd:1;
      uint64_t dss_ctrl_wr:1;
      uint64_t dss_cm4_ctrl_rd:1;
      uint64_t dss_cm4_ctrl_wr:1;
      uint64_t dss_hwa_cfg_rd:1;
      uint64_t dss_hwa_cfg_wr:1;
      uint64_t rcss_rcm_rd:1;
      uint64_t rcss_rcm_wr:1;
      uint64_t rcss_ctrl_rd:1;
      uint64_t rcss_ctrl_wr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PERIPH_ERRAGG_STATUS_RAW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t proc_0:1;
      uint64_t reservedSpace0:3;
      uint64_t proc_1:1;
      uint64_t reservedSpace1:3;
      uint64_t proc_2:1;
      uint64_t reservedSpace2:3;
      uint64_t proc_3:1;
      uint64_t reservedSpace3:3;
      uint64_t proc_4:1;
      uint64_t reservedSpace4:3;
      uint64_t proc_5:1;
      uint64_t reservedSpace5:3;
      uint64_t proc_6:1;
      uint64_t reservedSpace6:3;
      uint64_t proc_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_MBOX_WRITE_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t proc_0:1;
      uint64_t reservedSpace0:3;
      uint64_t proc_1:1;
      uint64_t reservedSpace1:3;
      uint64_t proc_2:1;
      uint64_t reservedSpace2:3;
      uint64_t proc_3:1;
      uint64_t reservedSpace3:3;
      uint64_t proc_4:1;
      uint64_t reservedSpace4:3;
      uint64_t proc_5:1;
      uint64_t reservedSpace5:3;
      uint64_t proc_6:1;
      uint64_t reservedSpace6:3;
      uint64_t proc_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_MBOX_READ_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t proc_0:1;
      uint64_t reservedSpace0:3;
      uint64_t proc_1:1;
      uint64_t reservedSpace1:3;
      uint64_t proc_2:1;
      uint64_t reservedSpace2:3;
      uint64_t proc_3:1;
      uint64_t reservedSpace3:3;
      uint64_t proc_4:1;
      uint64_t reservedSpace4:3;
      uint64_t proc_5:1;
      uint64_t reservedSpace5:3;
      uint64_t proc_6:1;
      uint64_t reservedSpace6:3;
      uint64_t proc_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_MBOX_READ_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cap0:7;
      uint64_t reservedSpace0:1;
      uint64_t cap1:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_WDT_EVENT_CAPTURE_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cap0:7;
      uint64_t reservedSpace0:1;
      uint64_t cap1:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_RTIA_EVENT_CAPTURE_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cap0:7;
      uint64_t reservedSpace0:1;
      uint64_t cap1:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_RTIB_EVENT_CAPTURE_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t sel:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBG_ACK_CPU_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSS_DCCA_bitfield:3;
      uint64_t reservedSpace0:1;
      uint64_t DSS_DCCB_bitfield:3;
      uint64_t reservedSpace1:1;
      uint64_t DSS_RTIA_bitfield:3;
      uint64_t reservedSpace2:1;
      uint64_t DSS_RTIB_bitfield:3;
      uint64_t reservedSpace3:1;
      uint64_t DSS_SCIA_bitfield:3;
      uint64_t reservedSpace4:1;
      uint64_t DSS_WDT_bitfield:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBG_ACK_CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t DSS_MCRC_bitfield:3;
      uint64_t reservedSpace1:1;
      uint64_t DSS_HWA:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBG_ACK_CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCSS_CSI2_ICSSM:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_INT_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t sel:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CBUFF_TRIGGER_SEL;

  uint8_t res3[616];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:1;
      uint64_t clk_disable:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSS_DSP_MDMA:1;
      uint64_t DSS_L3_BANKA:1;
      uint64_t DSS_L3_BANKB:1;
      uint64_t DSS_L3_BANKC:1;
      uint64_t DSS_L3_BANKD:1;
      uint64_t DSS_DSP_SDMA:1;
      uint64_t DSS_TPTC_A0_RD:1;
      uint64_t DSS_TPTC_A1_RD:1;
      uint64_t DSS_TPTC_B0_RD:1;
      uint64_t DSS_TPTC_B1_RD:1;
      uint64_t DSS_TPTC_C0_RD:1;
      uint64_t DSS_TPTC_C1_RD:1;
      uint64_t DSS_TPTC_C2_RD:1;
      uint64_t DSS_TPTC_C3_RD:1;
      uint64_t DSS_TPTC_C4_RD:1;
      uint64_t DSS_TPTC_C5_RD:1;
      uint64_t DSS_TPTC_A0_WR:1;
      uint64_t DSS_TPTC_A1_WR:1;
      uint64_t DSS_TPTC_B0_WR:1;
      uint64_t DSS_TPTC_B1_WR:1;
      uint64_t DSS_TPTC_C0_WR:1;
      uint64_t DSS_TPTC_C1_WR:1;
      uint64_t DSS_TPTC_C2_WR:1;
      uint64_t DSS_TPTC_C3_WR:1;
      uint64_t DSS_TPTC_C4_WR:1;
      uint64_t DSS_TPTC_C5_WR:1;
      uint64_t DSS_PCR_bitfield:1;
      uint64_t DSS_CBUFF_FIFO:1;
      uint64_t DSS_MDO_FIFO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_BUS_SAFETY_SEC_ERR_STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSS_MCRC_bitfield:1;
      uint64_t DSS_HWA_DMA0:1;
      uint64_t DSS_HWA_DMA1:1;
      uint64_t DSS_CM4_M:1;
      uint64_t DSS_CM4_S:1;
      uint64_t DSS_MBOX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_BUS_SAFETY_SEC_ERR_STAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_MDMA_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_MDMA_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_MDMA_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_MDMA_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d4:8;
      uint64_t d5:8;
      uint64_t d6:8;
      uint64_t d7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_MDMA_BUS_SAFETY_ERR_STAT_DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_MDMA_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_MDMA_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_MDMA_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_MDMA_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d4:8;
      uint64_t d5:8;
      uint64_t d6:8;
      uint64_t d7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA_BUS_SAFETY_ERR_STAT_DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKA_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d4:8;
      uint64_t d5:8;
      uint64_t d6:8;
      uint64_t d7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB_BUS_SAFETY_ERR_STAT_DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKB_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d4:8;
      uint64_t d5:8;
      uint64_t d6:8;
      uint64_t d7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC_BUS_SAFETY_ERR_STAT_DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKC_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d4:8;
      uint64_t d5:8;
      uint64_t d6:8;
      uint64_t d7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD_BUS_SAFETY_ERR_STAT_DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_L3_BANKD_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_SDMA_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_SDMA_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_SDMA_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_SDMA_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_SDMA_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_SDMA_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_SDMA_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_DSP_SDMA_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A0_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A0_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A0_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A0_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A0_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A0_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A1_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A1_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A1_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A1_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A1_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A1_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B0_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B0_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B0_RD_BUS_SAFETY_ERR;

