iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B0_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B0_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B0_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B1_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B1_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B1_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B1_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B1_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B1_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C0_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C0_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C0_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C0_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C0_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C0_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C1_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C1_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C1_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C1_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C1_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C1_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C2_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C2_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C2_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C2_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C2_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C2_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C3_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C3_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C3_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C3_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C3_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C3_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C4_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C4_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C4_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C4_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C4_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C4_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C5_RD_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C5_RD_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C5_RD_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C5_RD_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C5_RD_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C5_RD_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A0_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A0_WR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A0_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A0_WR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A0_WR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A0_WR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A0_WR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A1_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A1_WR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A1_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A1_WR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A1_WR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A1_WR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_A1_WR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B0_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B0_WR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B0_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B0_WR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B0_WR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B0_WR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B0_WR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B1_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B1_WR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B1_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B1_WR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B1_WR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B1_WR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_B1_WR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C0_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C0_WR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C0_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C0_WR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C0_WR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C0_WR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C0_WR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C1_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C1_WR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C1_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C1_WR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C1_WR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C1_WR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C1_WR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C2_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C2_WR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C2_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C2_WR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C2_WR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C2_WR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C2_WR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C3_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C3_WR_BUS_SAFETY_FI;

