iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C3_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C3_WR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C3_WR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C3_WR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C3_WR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C4_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C4_WR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C4_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C4_WR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C4_WR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C4_WR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C4_WR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C5_WR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C5_WR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C5_WR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C5_WR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C5_WR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C5_WR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_TPTC_C5_WR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MDO_FIFO_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MDO_FIFO_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MDO_FIFO_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MDO_FIFO_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MDO_FIFO_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MDO_FIFO_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MDO_FIFO_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MDO_FIFO_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CBUFF_FIFO_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CBUFF_FIFO_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CBUFF_FIFO_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CBUFF_FIFO_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CBUFF_FIFO_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CBUFF_FIFO_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CBUFF_FIFO_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CBUFF_FIFO_BUS_SAFETY_ERR_STAT_WRITERESP;

  uint8_t res4[160];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MCRC_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MCRC_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MCRC_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MCRC_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MCRC_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MCRC_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MCRC_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MCRC_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PCR_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PCR_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PCR_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PCR_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PCR_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PCR_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PCR_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_PCR_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA0_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA0_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA0_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA0_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA0_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA0_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA0_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA0_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA1_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA1_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA1_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA1_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA1_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA1_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA1_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_HWA_DMA1_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_M_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_M_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_M_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_M_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_M_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_M_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_M_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_M_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_S_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_S_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_S_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_S_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_S_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_S_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_S_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_CM4_S_BUS_SAFETY_ERR_STAT_WRITERESP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MBOX_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MBOX_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MBOX_BUS_SAFETY_ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
      uint64_t d2:8;
      uint64_t d3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MBOX_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MBOX_BUS_SAFETY_ERR_STAT_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MBOX_BUS_SAFETY_ERR_STAT_WRITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MBOX_BUS_SAFETY_ERR_STAT_READ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSS_MBOX_BUS_SAFETY_ERR_STAT_WRITERESP;

  uint8_t res5[808];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_wph:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_WPH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rec0:1;
      uint64_t hw_spare_rec1:1;
      uint64_t hw_spare_rec2:1;
      uint64_t hw_spare_rec3:1;
      uint64_t hw_spare_rec4:1;
      uint64_t hw_spare_rec5:1;
      uint64_t hw_spare_rec6:1;
      uint64_t hw_spare_rec7:1;
      uint64_t hw_spare_rec8:1;
      uint64_t hw_spare_rec9:1;
      uint64_t hw_spare_rec10:1;
      uint64_t hw_spare_rec11:1;
      uint64_t hw_spare_rec12:1;
      uint64_t hw_spare_rec13:1;
      uint64_t hw_spare_rec14:1;
      uint64_t hw_spare_rec15:1;
      uint64_t hw_spare_rec16:1;
      uint64_t hw_spare_rec17:1;
      uint64_t hw_spare_rec18:1;
      uint64_t hw_spare_rec19:1;
      uint64_t hw_spare_rec20:1;
      uint64_t hw_spare_rec21:1;
      uint64_t hw_spare_rec22:1;
      uint64_t hw_spare_rec23:1;
      uint64_t hw_spare_rec24:1;
      uint64_t hw_spare_rec25:1;
      uint64_t hw_spare_rec26:1;
      uint64_t hw_spare_rec27:1;
      uint64_t hw_spare_rec28:1;
      uint64_t hw_spare_rec29:1;
      uint64_t hw_spare_rec30:1;
      uint64_t hw_spare_rec31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REC;

  uint8_t res6[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK0;

