iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_raw_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enabled_status_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eoi;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_type_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b19_8:12;
      uint64_t b31_20:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_attr_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_clear;

};

#define DSS_CTRL (*(volatile struct DSS_CTRL_tag *) 0x6020000)

struct DSS_CBUFF_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_1LVDS_0CSI:1;
      uint64_t CFG_ECC_EN:1;
      uint64_t cftrigen:1;
      uint64_t CFG_SW_TRIG_EN:1;
      uint64_t NU1:4;
      uint64_t ccfwlen:1;
      uint64_t crdthsel:1;
      uint64_t cvc0en:2;
      uint64_t cvc1en:2;
      uint64_t cvc2en:2;
      uint64_t cvc3en:2;
      uint64_t ccfwpen:1;
      uint64_t dbusen:1;
      uint64_t CFG_VBUSP_BURST_EN:4;
      uint64_t CFG_CHIRP_AVAIL_TRIG:1;
      uint64_t CFG_FRAME_START_TRIG:1;
      uint64_t cswlrst:1;
      uint64_t cswcrst:1;
      uint64_t dbussel:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_REG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_SPHDR_ADDRESS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_SPHDR_ADDRESS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_CMD_HSVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_CMD_HSVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_CMD_HEVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_CMD_HEVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_CMD_VSVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_CMD_VSVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_CMD_VEVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_CMD_VEVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_LPHDR_ADDRESS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_LPHDR_ADDRESS;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_CHIRPS_PER_FRAME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_CHIRPS_PER_FRAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_FIFO_FREE_THRESHOLD0:8;
      uint64_t CFG_FIFO_FREE_THRESHOLD1:8;
      uint64_t CFG_FIFO_FREE_THRESHOLD2:8;
      uint64_t CFG_FIFO_FREE_THRESHOLD3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_FIFO_FREE_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_LPPYLD_ADDRESS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_LPPYLD_ADDRESS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_SPHDR_DELAY:8;
      uint64_t CFG_LPHDR_DELAY:8;
      uint64_t CFG_DATA_WR_DELAY:8;
      uint64_t NU:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DELAY_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL0_VALID:1;
      uint64_t LL0_HE:1;
      uint64_t LL0_HS:1;
      uint64_t LL0_VCNUM:2;
      uint64_t LL0_FMT:2;
      uint64_t LL0_FMT_MAP:1;
      uint64_t LL0_FMT_IN:1;
      uint64_t LL0_SIZE:14;
      uint64_t LL0_BITPOS_SEL:3;
      uint64_t LL0_WAITFOR_PKTSENT:1;
      uint64_t LL0_LPHDR_EN:1;
      uint64_t LL0_CRC_EN:1;
      uint64_t LL0_SHORT_PKT_DELAY_EN:1;
      uint64_t LL0_LONG_PKT_DELAY_EN:1;
      uint64_t LL0_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL0_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL0_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL0_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL0_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll0dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL0_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL1_VALID:1;
      uint64_t LL1_HE:1;
      uint64_t LL1_HS:1;
      uint64_t LL1_VCNUM:2;
      uint64_t LL1_FMT:2;
      uint64_t LL1_FMT_MAP:1;
      uint64_t LL1_FMT_IN:1;
      uint64_t LL1_SIZE:14;
      uint64_t LL1_BITPOS_SEL:3;
      uint64_t LL1_WAITFOR_PKTSENT:1;
      uint64_t LL1_LPHDR_EN:1;
      uint64_t LL1_CRC_EN:1;
      uint64_t LL1_SHORT_PKT_DELAY_EN:1;
      uint64_t LL1_LONG_PKT_DELAY_EN:1;
      uint64_t LL1_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL1_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL1_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL1_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL1_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll1dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL1_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL2_VALID:1;
      uint64_t LL2_HE:1;
      uint64_t LL2_HS:1;
      uint64_t LL2_VCNUM:2;
      uint64_t LL2_FMT:2;
      uint64_t LL2_FMT_MAP:1;
      uint64_t LL2_FMT_IN:1;
      uint64_t LL2_SIZE:14;
      uint64_t LL2_BITPOS_SEL:3;
      uint64_t LL2_WAITFOR_PKTSENT:1;
      uint64_t LL2_LPHDR_EN:1;
      uint64_t LL2_CRC_EN:1;
      uint64_t LL2_SHORT_PKT_DELAY_EN:1;
      uint64_t LL2_LONG_PKT_DELAY_EN:1;
      uint64_t LL2_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL2_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL2_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL2_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL2_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll2dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL2_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL3_VALID:1;
      uint64_t LL3_HE:1;
      uint64_t LL3_HS:1;
      uint64_t LL3_VCNUM:2;
      uint64_t LL3_FMT:2;
      uint64_t LL3_FMT_MAP:1;
      uint64_t LL3_FMT_IN:1;
      uint64_t LL3_SIZE:14;
      uint64_t LL3_BITPOS_SEL:3;
      uint64_t LL3_WAITFOR_PKTSENT:1;
      uint64_t LL3_LPHDR_EN:1;
      uint64_t LL3_CRC_EN:1;
      uint64_t LL3_SHORT_PKT_DELAY_EN:1;
      uint64_t LL3_LONG_PKT_DELAY_EN:1;
      uint64_t LL3_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL3_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL3_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL3_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL3_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll3dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL3_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL4_VALID:1;
      uint64_t LL4_HE:1;
      uint64_t LL4_HS:1;
      uint64_t LL4_VCNUM:2;
      uint64_t LL4_FMT:2;
      uint64_t LL4_FMT_MAP:1;
      uint64_t LL4_FMT_IN:1;
      uint64_t LL4_SIZE:14;
      uint64_t LL4_BITPOS_SEL:3;
      uint64_t LL4_WAITFOR_PKTSENT:1;
      uint64_t LL4_LPHDR_EN:1;
      uint64_t LL4_CRC_EN:1;
      uint64_t LL4_SHORT_PKT_DELAY_EN:1;
      uint64_t LL4_LONG_PKT_DELAY_EN:1;
      uint64_t LL4_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL4_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL4_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL4_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL4_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll4dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL4_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL5_VALID:1;
      uint64_t LL5_HE:1;
      uint64_t LL5_HS:1;
      uint64_t LL5_VCNUM:2;
      uint64_t LL5_FMT:2;
      uint64_t LL5_FMT_MAP:1;
      uint64_t LL5_FMT_IN:1;
      uint64_t LL5_SIZE:14;
      uint64_t LL5_BITPOS_SEL:3;
      uint64_t LL5_WAITFOR_PKTSENT:1;
      uint64_t LL5_LPHDR_EN:1;
      uint64_t LL5_CRC_EN:1;
      uint64_t LL5_SHORT_PKT_DELAY_EN:1;
      uint64_t LL5_LONG_PKT_DELAY_EN:1;
      uint64_t LL5_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL5_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL5_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL5_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL5_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll5dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL5_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL6_VALID:1;
      uint64_t LL6_HE:1;
      uint64_t LL6_HS:1;
      uint64_t LL6_VCNUM:2;
      uint64_t LL6_FMT:2;
      uint64_t LL6_FMT_MAP:1;
      uint64_t LL6_FMT_IN:1;
      uint64_t LL6_SIZE:14;
      uint64_t LL6_BITPOS_SEL:3;
      uint64_t LL6_WAITFOR_PKTSENT:1;
      uint64_t LL6_LPHDR_EN:1;
      uint64_t LL6_CRC_EN:1;
      uint64_t LL6_SHORT_PKT_DELAY_EN:1;
      uint64_t LL6_LONG_PKT_DELAY_EN:1;
      uint64_t LL6_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL6_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL6_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL6_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL6_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll6dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL6_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL7_VALID:1;
      uint64_t LL7_HE:1;
      uint64_t LL7_HS:1;
      uint64_t LL7_VCNUM:2;
      uint64_t LL7_FMT:2;
      uint64_t LL7_FMT_MAP:1;
      uint64_t LL7_FMT_IN:1;
      uint64_t LL7_SIZE:14;
      uint64_t LL7_BITPOS_SEL:3;
      uint64_t LL7_WAITFOR_PKTSENT:1;
      uint64_t LL7_LPHDR_EN:1;
      uint64_t LL7_CRC_EN:1;
      uint64_t LL7_SHORT_PKT_DELAY_EN:1;
      uint64_t LL7_LONG_PKT_DELAY_EN:1;
      uint64_t LL7_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL7_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL7_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL7_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL7_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll7dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL7_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL8_VALID:1;
      uint64_t LL8_HE:1;
      uint64_t LL8_HS:1;
      uint64_t LL8_VCNUM:2;
      uint64_t LL8_FMT:2;
      uint64_t LL8_FMT_MAP:1;
      uint64_t LL8_FMT_IN:1;
      uint64_t LL8_SIZE:14;
      uint64_t LL8_BITPOS_SEL:3;
      uint64_t LL8_WAITFOR_PKTSENT:1;
      uint64_t LL8_LPHDR_EN:1;
      uint64_t LL8_CRC_EN:1;
      uint64_t LL8_SHORT_PKT_DELAY_EN:1;
      uint64_t LL8_LONG_PKT_DELAY_EN:1;
      uint64_t LL8_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL8_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL8_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL8_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL8_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll8dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL8_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL9_VALID:1;
      uint64_t LL9_HE:1;
      uint64_t LL9_HS:1;
      uint64_t LL9_VCNUM:2;
      uint64_t LL9_FMT:2;
      uint64_t LL9_FMT_MAP:1;
      uint64_t LL9_FMT_IN:1;
      uint64_t LL9_SIZE:14;
      uint64_t LL9_BITPOS_SEL:3;
      uint64_t LL9_WAITFOR_PKTSENT:1;
      uint64_t LL9_LPHDR_EN:1;
      uint64_t LL9_CRC_EN:1;
      uint64_t LL9_SHORT_PKT_DELAY_EN:1;
      uint64_t LL9_LONG_PKT_DELAY_EN:1;
      uint64_t LL9_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL9_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL9_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL9_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL9_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll9dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL9_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL10_VALID:1;
      uint64_t LL10_HE:1;
      uint64_t LL10_HS:1;
      uint64_t LL10_VCNUM:2;
      uint64_t LL10_FMT:2;
      uint64_t LL10_FMT_MAP:1;
      uint64_t LL10_FMT_IN:1;
      uint64_t LL10_SIZE:14;
      uint64_t LL10_BITPOS_SEL:3;
      uint64_t LL10_WAITFOR_PKTSENT:1;
      uint64_t LL10_LPHDR_EN:1;
      uint64_t LL10_CRC_EN:1;
      uint64_t LL10_SHORT_PKT_DELAY_EN:1;
      uint64_t LL10_LONG_PKT_DELAY_EN:1;
      uint64_t LL10_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL10_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL10_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL10_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL10_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll10dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL10_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL11_VALID:1;
      uint64_t LL11_HE:1;
      uint64_t LL11_HS:1;
      uint64_t LL11_VCNUM:2;
      uint64_t LL11_FMT:2;
      uint64_t LL11_FMT_MAP:1;
      uint64_t LL11_FMT_IN:1;
      uint64_t LL11_SIZE:14;
      uint64_t LL11_BITPOS_SEL:3;
      uint64_t LL11_WAITFOR_PKTSENT:1;
      uint64_t LL11_LPHDR_EN:1;
      uint64_t LL11_CRC_EN:1;
      uint64_t LL11_SHORT_PKT_DELAY_EN:1;
      uint64_t LL11_LONG_PKT_DELAY_EN:1;
      uint64_t LL11_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL11_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL11_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL11_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL11_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll11dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL11_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL12_VALID:1;
      uint64_t LL12_HE:1;
      uint64_t LL12_HS:1;
      uint64_t LL12_VCNUM:2;
      uint64_t LL12_FMT:2;
      uint64_t LL12_FMT_MAP:1;
      uint64_t LL12_FMT_IN:1;
      uint64_t LL12_SIZE:14;
      uint64_t LL12_BITPOS_SEL:3;
      uint64_t LL12_WAITFOR_PKTSENT:1;
      uint64_t LL12_LPHDR_EN:1;
      uint64_t LL12_CRC_EN:1;
      uint64_t LL12_SHORT_PKT_DELAY_EN:1;
      uint64_t LL12_LONG_PKT_DELAY_EN:1;
      uint64_t LL12_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL12_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL12_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL12_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL12_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll12dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL12_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL13_VALID:1;
      uint64_t LL13_HE:1;
      uint64_t LL13_HS:1;
      uint64_t LL13_VCNUM:2;
      uint64_t LL13_FMT:2;
      uint64_t LL13_FMT_MAP:1;
      uint64_t LL13_FMT_IN:1;
      uint64_t LL13_SIZE:14;
      uint64_t LL13_BITPOS_SEL:3;
      uint64_t LL13_WAITFOR_PKTSENT:1;
      uint64_t LL13_LPHDR_EN:1;
      uint64_t LL13_CRC_EN:1;
      uint64_t LL13_SHORT_PKT_DELAY_EN:1;
      uint64_t LL13_LONG_PKT_DELAY_EN:1;
      uint64_t LL13_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL13_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL13_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL13_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL13_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll13dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL13_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL14_VALID:1;
      uint64_t LL14_HE:1;
      uint64_t LL14_HS:1;
      uint64_t LL14_VCNUM:2;
      uint64_t LL14_FMT:2;
      uint64_t LL14_FMT_MAP:1;
      uint64_t LL14_FMT_IN:1;
      uint64_t LL14_SIZE:14;
      uint64_t LL14_BITPOS_SEL:3;
      uint64_t LL14_WAITFOR_PKTSENT:1;
      uint64_t LL14_LPHDR_EN:1;
      uint64_t LL14_CRC_EN:1;
      uint64_t LL14_SHORT_PKT_DELAY_EN:1;
      uint64_t LL14_LONG_PKT_DELAY_EN:1;
      uint64_t LL14_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL14_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL14_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL14_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL14_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll14dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL14_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL15_VALID:1;
      uint64_t LL15_HE:1;
      uint64_t LL15_HS:1;
      uint64_t LL15_VCNUM:2;
      uint64_t LL15_FMT:2;
      uint64_t LL15_FMT_MAP:1;
      uint64_t LL15_FMT_IN:1;
      uint64_t LL15_SIZE:14;
      uint64_t LL15_BITPOS_SEL:3;
      uint64_t LL15_WAITFOR_PKTSENT:1;
      uint64_t LL15_LPHDR_EN:1;
      uint64_t LL15_CRC_EN:1;
      uint64_t LL15_SHORT_PKT_DELAY_EN:1;
      uint64_t LL15_LONG_PKT_DELAY_EN:1;
      uint64_t LL15_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL15_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL15_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL15_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL15_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll15dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL15_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL16_VALID:1;
      uint64_t LL16_HE:1;
      uint64_t LL16_HS:1;
      uint64_t LL16_VCNUM:2;
      uint64_t LL16_FMT:2;
      uint64_t LL16_FMT_MAP:1;
      uint64_t LL16_FMT_IN:1;
      uint64_t LL16_SIZE:14;
      uint64_t LL16_BITPOS_SEL:3;
      uint64_t LL16_WAITFOR_PKTSENT:1;
      uint64_t LL16_LPHDR_EN:1;
      uint64_t LL16_CRC_EN:1;
      uint64_t LL16_SHORT_PKT_DELAY_EN:1;
      uint64_t LL16_LONG_PKT_DELAY_EN:1;
      uint64_t LL16_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL16_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL16_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL16_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL16_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll16dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL16_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL17_VALID:1;
      uint64_t LL17_HE:1;
      uint64_t LL17_HS:1;
      uint64_t LL17_VCNUM:2;
      uint64_t LL17_FMT:2;
      uint64_t LL17_FMT_MAP:1;
      uint64_t LL17_FMT_IN:1;
      uint64_t LL17_SIZE:14;
      uint64_t LL17_BITPOS_SEL:3;
      uint64_t LL17_WAITFOR_PKTSENT:1;
      uint64_t LL17_LPHDR_EN:1;
      uint64_t LL17_CRC_EN:1;
      uint64_t LL17_SHORT_PKT_DELAY_EN:1;
      uint64_t LL17_LONG_PKT_DELAY_EN:1;
      uint64_t LL17_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL17_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL17_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL17_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL17_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll17dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL17_THRESHOLD;

