iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL18_VALID:1;
      uint64_t LL18_HE:1;
      uint64_t LL18_HS:1;
      uint64_t LL18_VCNUM:2;
      uint64_t LL18_FMT:2;
      uint64_t LL18_FMT_MAP:1;
      uint64_t LL18_FMT_IN:1;
      uint64_t LL18_SIZE:14;
      uint64_t LL18_BITPOS_SEL:3;
      uint64_t LL18_WAITFOR_PKTSENT:1;
      uint64_t LL18_LPHDR_EN:1;
      uint64_t LL18_CRC_EN:1;
      uint64_t LL18_SHORT_PKT_DELAY_EN:1;
      uint64_t LL18_LONG_PKT_DELAY_EN:1;
      uint64_t LL18_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL18_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL18_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL18_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL18_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll18dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL18_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL19_VALID:1;
      uint64_t LL19_HE:1;
      uint64_t LL19_HS:1;
      uint64_t LL19_VCNUM:2;
      uint64_t LL19_FMT:2;
      uint64_t LL19_FMT_MAP:1;
      uint64_t LL19_FMT_IN:1;
      uint64_t LL19_SIZE:14;
      uint64_t LL19_BITPOS_SEL:3;
      uint64_t LL19_WAITFOR_PKTSENT:1;
      uint64_t LL19_LPHDR_EN:1;
      uint64_t LL19_CRC_EN:1;
      uint64_t LL19_SHORT_PKT_DELAY_EN:1;
      uint64_t LL19_LONG_PKT_DELAY_EN:1;
      uint64_t LL19_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL19_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL19_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL19_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL19_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll19dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL19_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL20_VALID:1;
      uint64_t LL20_HE:1;
      uint64_t LL20_HS:1;
      uint64_t LL20_VCNUM:2;
      uint64_t LL20_FMT:2;
      uint64_t LL20_FMT_MAP:1;
      uint64_t LL20_FMT_IN:1;
      uint64_t LL20_SIZE:14;
      uint64_t LL20_BITPOS_SEL:3;
      uint64_t LL20_WAITFOR_PKTSENT:1;
      uint64_t LL20_LPHDR_EN:1;
      uint64_t LL20_CRC_EN:1;
      uint64_t LL20_SHORT_PKT_DELAY_EN:1;
      uint64_t LL20_LONG_PKT_DELAY_EN:1;
      uint64_t LL20_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL20_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL20_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL20_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL20_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll20dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL20_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL21_VALID:1;
      uint64_t LL21_HE:1;
      uint64_t LL21_HS:1;
      uint64_t LL21_VCNUM:2;
      uint64_t LL21_FMT:2;
      uint64_t LL21_FMT_MAP:1;
      uint64_t LL21_FMT_IN:1;
      uint64_t LL21_SIZE:14;
      uint64_t LL21_BITPOS_SEL:3;
      uint64_t LL21_WAITFOR_PKTSENT:1;
      uint64_t LL21_LPHDR_EN:1;
      uint64_t LL21_CRC_EN:1;
      uint64_t LL21_SHORT_PKT_DELAY_EN:1;
      uint64_t LL21_LONG_PKT_DELAY_EN:1;
      uint64_t LL21_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL21_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL21_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL21_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL21_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll21dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL21_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL22_VALID:1;
      uint64_t LL22_HE:1;
      uint64_t LL22_HS:1;
      uint64_t LL22_VCNUM:2;
      uint64_t LL22_FMT:2;
      uint64_t LL22_FMT_MAP:1;
      uint64_t LL22_FMT_IN:1;
      uint64_t LL22_SIZE:14;
      uint64_t LL22_BITPOS_SEL:3;
      uint64_t LL22_WAITFOR_PKTSENT:1;
      uint64_t LL22_LPHDR_EN:1;
      uint64_t LL22_CRC_EN:1;
      uint64_t LL22_SHORT_PKT_DELAY_EN:1;
      uint64_t LL22_LONG_PKT_DELAY_EN:1;
      uint64_t LL22_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL22_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL22_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL22_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL22_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll22dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL22_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL23_VALID:1;
      uint64_t LL23_HE:1;
      uint64_t LL23_HS:1;
      uint64_t LL23_VCNUM:2;
      uint64_t LL23_FMT:2;
      uint64_t LL23_FMT_MAP:1;
      uint64_t LL23_FMT_IN:1;
      uint64_t LL23_SIZE:14;
      uint64_t LL23_BITPOS_SEL:3;
      uint64_t LL23_WAITFOR_PKTSENT:1;
      uint64_t LL23_LPHDR_EN:1;
      uint64_t LL23_CRC_EN:1;
      uint64_t LL23_SHORT_PKT_DELAY_EN:1;
      uint64_t LL23_LONG_PKT_DELAY_EN:1;
      uint64_t LL23_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL23_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL23_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL23_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL23_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll23dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL23_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL24_VALID:1;
      uint64_t LL24_HE:1;
      uint64_t LL24_HS:1;
      uint64_t LL24_VCNUM:2;
      uint64_t LL24_FMT:2;
      uint64_t LL24_FMT_MAP:1;
      uint64_t LL24_FMT_IN:1;
      uint64_t LL24_SIZE:14;
      uint64_t LL24_BITPOS_SEL:3;
      uint64_t LL24_WAITFOR_PKTSENT:1;
      uint64_t LL24_LPHDR_EN:1;
      uint64_t LL24_CRC_EN:1;
      uint64_t LL24_SHORT_PKT_DELAY_EN:1;
      uint64_t LL24_LONG_PKT_DELAY_EN:1;
      uint64_t LL24_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL24_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL24_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL24_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL24_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll24dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL24_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL25_VALID:1;
      uint64_t LL25_HE:1;
      uint64_t LL25_HS:1;
      uint64_t LL25_VCNUM:2;
      uint64_t LL25_FMT:2;
      uint64_t LL25_FMT_MAP:1;
      uint64_t LL25_FMT_IN:1;
      uint64_t LL25_SIZE:14;
      uint64_t LL25_BITPOS_SEL:3;
      uint64_t LL25_WAITFOR_PKTSENT:1;
      uint64_t LL25_LPHDR_EN:1;
      uint64_t LL25_CRC_EN:1;
      uint64_t LL25_SHORT_PKT_DELAY_EN:1;
      uint64_t LL25_LONG_PKT_DELAY_EN:1;
      uint64_t LL25_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL25_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL25_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL25_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL25_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll25dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL25_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL26_VALID:1;
      uint64_t LL26_HE:1;
      uint64_t LL26_HS:1;
      uint64_t LL26_VCNUM:2;
      uint64_t LL26_FMT:2;
      uint64_t LL26_FMT_MAP:1;
      uint64_t LL26_FMT_IN:1;
      uint64_t LL26_SIZE:14;
      uint64_t LL26_BITPOS_SEL:3;
      uint64_t LL26_WAITFOR_PKTSENT:1;
      uint64_t LL26_LPHDR_EN:1;
      uint64_t LL26_CRC_EN:1;
      uint64_t LL26_SHORT_PKT_DELAY_EN:1;
      uint64_t LL26_LONG_PKT_DELAY_EN:1;
      uint64_t LL26_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL26_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL26_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL26_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL26_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll26dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL26_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL27_VALID:1;
      uint64_t LL27_HE:1;
      uint64_t LL27_HS:1;
      uint64_t LL27_VCNUM:2;
      uint64_t LL27_FMT:2;
      uint64_t LL27_FMT_MAP:1;
      uint64_t LL27_FMT_IN:1;
      uint64_t LL27_SIZE:14;
      uint64_t LL27_BITPOS_SEL:3;
      uint64_t LL27_WAITFOR_PKTSENT:1;
      uint64_t LL27_LPHDR_EN:1;
      uint64_t LL27_CRC_EN:1;
      uint64_t LL27_SHORT_PKT_DELAY_EN:1;
      uint64_t LL27_LONG_PKT_DELAY_EN:1;
      uint64_t LL27_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL27_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL27_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL27_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL27_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll27dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL27_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL28_VALID:1;
      uint64_t LL28_HE:1;
      uint64_t LL28_HS:1;
      uint64_t LL28_VCNUM:2;
      uint64_t LL28_FMT:2;
      uint64_t LL28_FMT_MAP:1;
      uint64_t LL28_FMT_IN:1;
      uint64_t LL28_SIZE:14;
      uint64_t LL28_BITPOS_SEL:3;
      uint64_t LL28_WAITFOR_PKTSENT:1;
      uint64_t LL28_LPHDR_EN:1;
      uint64_t LL28_CRC_EN:1;
      uint64_t LL28_SHORT_PKT_DELAY_EN:1;
      uint64_t LL28_LONG_PKT_DELAY_EN:1;
      uint64_t LL28_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL28_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL28_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL28_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL28_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll28dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL28_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL29_VALID:1;
      uint64_t LL29_HE:1;
      uint64_t LL29_HS:1;
      uint64_t LL29_VCNUM:2;
      uint64_t LL29_FMT:2;
      uint64_t LL29_FMT_MAP:1;
      uint64_t LL29_FMT_IN:1;
      uint64_t LL29_SIZE:14;
      uint64_t LL29_BITPOS_SEL:3;
      uint64_t LL29_WAITFOR_PKTSENT:1;
      uint64_t LL29_LPHDR_EN:1;
      uint64_t LL29_CRC_EN:1;
      uint64_t LL29_SHORT_PKT_DELAY_EN:1;
      uint64_t LL29_LONG_PKT_DELAY_EN:1;
      uint64_t LL29_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL29_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL29_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL29_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL29_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll29dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL29_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL30_VALID:1;
      uint64_t LL30_HE:1;
      uint64_t LL30_HS:1;
      uint64_t LL30_VCNUM:2;
      uint64_t LL30_FMT:2;
      uint64_t LL30_FMT_MAP:1;
      uint64_t LL30_FMT_IN:1;
      uint64_t LL30_SIZE:14;
      uint64_t LL30_BITPOS_SEL:3;
      uint64_t LL30_WAITFOR_PKTSENT:1;
      uint64_t LL30_LPHDR_EN:1;
      uint64_t LL30_CRC_EN:1;
      uint64_t LL30_SHORT_PKT_DELAY_EN:1;
      uint64_t LL30_LONG_PKT_DELAY_EN:1;
      uint64_t LL30_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL30_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL30_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL30_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL30_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll30dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL30_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL31_VALID:1;
      uint64_t LL31_HE:1;
      uint64_t LL31_HS:1;
      uint64_t LL31_VCNUM:2;
      uint64_t LL31_FMT:2;
      uint64_t LL31_FMT_MAP:1;
      uint64_t LL31_FMT_IN:1;
      uint64_t LL31_SIZE:14;
      uint64_t LL31_BITPOS_SEL:3;
      uint64_t LL31_WAITFOR_PKTSENT:1;
      uint64_t LL31_LPHDR_EN:1;
      uint64_t LL31_CRC_EN:1;
      uint64_t LL31_SHORT_PKT_DELAY_EN:1;
      uint64_t LL31_LONG_PKT_DELAY_EN:1;
      uint64_t LL31_DATA_WR_DELAY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL31_LPHDR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL31_LPHDR_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL31_RD_THRESHOLD:7;
      uint64_t NU1:1;
      uint64_t LL31_WR_THRESHOLD:7;
      uint64_t NU2:1;
      uint64_t ll31dman:3;
      uint64_t NU3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_DATA_LL31_THRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_0_A:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_0_B:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_0_C:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_0_D:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_0_E:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_0_F:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_0_G:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_0_H:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_LVDS_MAPPING_LANE0_FMT_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_0_A:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_0_B:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_0_C:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_0_D:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_0_E:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_0_F:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_0_G:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_0_H:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_LVDS_MAPPING_LANE1_FMT_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_0_A:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_0_B:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_0_C:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_0_D:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_0_E:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_0_F:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_0_G:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_0_H:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_LVDS_MAPPING_LANE2_FMT_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_0_A:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_0_B:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_0_C:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_0_D:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_0_E:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_0_F:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_0_G:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_0_H:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_LVDS_MAPPING_LANE3_FMT_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_1_A:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_1_B:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_1_C:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_1_D:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_1_E:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_1_F:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_1_G:4;
      uint64_t CFG_LVDS_MAPPING_LANE0_FMT_1_H:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_LVDS_MAPPING_LANE0_FMT_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_1_A:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_1_B:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_1_C:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_1_D:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_1_E:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_1_F:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_1_G:4;
      uint64_t CFG_LVDS_MAPPING_LANE1_FMT_1_H:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_LVDS_MAPPING_LANE1_FMT_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_1_A:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_1_B:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_1_C:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_1_D:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_1_E:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_1_F:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_1_G:4;
      uint64_t CFG_LVDS_MAPPING_LANE2_FMT_1_H:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_LVDS_MAPPING_LANE2_FMT_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_1_A:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_1_B:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_1_C:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_1_D:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_1_E:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_1_F:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_1_G:4;
      uint64_t CFG_LVDS_MAPPING_LANE3_FMT_1_H:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_LVDS_MAPPING_LANE3_FMT_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_LVDS_LANE0_EN:1;
      uint64_t CFG_LVDS_LANE1_EN:1;
      uint64_t CFG_LVDS_LANE2_EN:1;
      uint64_t CFG_LVDS_LANE3_EN:1;
      uint64_t CFG_8B10B_EN:1;
      uint64_t ctc2en:1;
      uint64_t cacdsel:1;
      uint64_t cpkfmt:1;
      uint64_t CFG_LINE_MODE:2;
      uint64_t CFG_BIT_CLK_MODE:1;
      uint64_t ccsmen:1;
      uint64_t ckchar:2;
      uint64_t cclksel:1;
      uint64_t cclksel1:1;
      uint64_t cckdiv:6;
      uint64_t cpossel:1;
      uint64_t cmsbf:1;
      uint64_t cfdly:4;
      uint64_t cbcrcen:1;
      uint64_t cblpen:1;
      uint64_t cpz:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_LVDS_GEN_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ctpen:1;
      uint64_t csdrinv:1;
      uint64_t c3c3l:1;
      uint64_t NU3:1;
      uint64_t ctiddly:3;
      uint64_t NU1:1;
      uint64_t ctpsel0:2;
      uint64_t ctpsel1:2;
      uint64_t ctpsel2:2;
      uint64_t ctpsel3:2;
      uint64_t clfven:1;
      uint64_t cfcpol:1;
      uint64_t cgbcen:1;
      uint64_t NU2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_LVDS_GEN_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_LVDS_GEN_2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_LVDS_GEN_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_MASK_REG0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_MASK_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_MASK_REG1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_MASK_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_MASK_REG2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_MASK_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_MASK_REG3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_MASK_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_CSI_PKT_RCVD:1;
      uint64_t S_CSI_PKT_VS_RCVD_STATE:1;
      uint64_t S_CSI_PKT_VE_RCVD_STATE:1;
      uint64_t S_CSI_PKT_HS_RCVD_STATE:1;
      uint64_t S_CSI_PKT_HE_RCVD_STATE:1;
      uint64_t S_CSI_PKT_LP_RCVD_STATE:1;
      uint64_t S_LL_INDEX:5;
      uint64_t S_CHIRP_DONE:1;
      uint64_t S_FRAME_DONE:1;
      uint64_t STAT_CBUFF_REG0_OTHERS:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT_CBUFF_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_LCLFSM_ERR:1;
      uint64_t S_LCLPOP_ERR:1;
      uint64_t S_LCLPUSH_ERR:1;
      uint64_t S1_UNUSED1:5;
      uint64_t S_CBPOP_ERR:1;
      uint64_t S_CBPUSH_ERR:1;
      uint64_t S_CBFIFO_FULL:1;
      uint64_t S_CBFIFO_EMPTY:1;
      uint64_t S1_UNUSED2:4;
      uint64_t S_CHIRP_ERR:1;
      uint64_t S_FRAME_ERR:1;
      uint64_t S_PKTRCV_ERR:1;
      uint64_t S_CBFIFO_EMPTY_IN_FSM:1;
      uint64_t S_CBFIFO_READY_IN_FSM:1;
      uint64_t S1_UNUSED3:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT_CBUFF_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT_CBUFF_REG2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT_CBUFF_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT_CBUFF_REG3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT_CBUFF_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT_LVDS_REG0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT_LVDS_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT_LVDS_REG1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT_LVDS_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT_LVDS_REG2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT_LVDS_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT_LVDS_REG3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT_LVDS_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C_CSI_PKT_RCVD:1;
      uint64_t C_CSI_PKT_VS_RCVD_STATE:1;
      uint64_t C_CSI_PKT_VE_RCVD_STATE:1;
      uint64_t C_CSI_PKT_HS_RCVD_STATE:1;
      uint64_t C_CSI_PKT_HE_RCVD_STATE:1;
      uint64_t C_CSI_PKT_LP_RCVD_STATE:1;
      uint64_t C_LL_INDEX:5;
      uint64_t C_CHIRP_DONE:1;
      uint64_t C_FRAME_DONE:1;
      uint64_t CLR_CBUFF_REG0_OTHERS:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_CBUFF_REG0;

