iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_CBUFF_REG1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_CBUFF_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_LVDS_REG0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_LVDS_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_LVDS_REG1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_LVDS_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t seccadd:6;
      uint64_t NU1:2;
      uint64_t seccsbe:1;
      uint64_t seccdbe:1;
      uint64_t NU2:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT_CBUFF_ECC_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU1:8;
      uint64_t meccsbe:1;
      uint64_t meccdbe:1;
      uint64_t NU2:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_CBUFF_ECC_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ceccadd:1;
      uint64_t NU1:7;
      uint64_t ceccsbe:1;
      uint64_t ceccdbe:1;
      uint64_t NU2:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_CBUFF_ECC_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAF_CRC:8;
      uint64_t SAF_CHIRP_ERR:1;
      uint64_t SAF_UNUSED1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT_SAFETY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK_SAFETY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_SAFETY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_SAFETY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_SAFETY;

};

#define DSS_CBUFF (*(volatile struct DSS_CBUFF_tag *) 0x6040000)

struct DSS_HWA_CFG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t param_start_idx:10;
      uint64_t reservedSpace0:6;
      uint64_t param_end_idx:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM_RAM_IDX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t numloops:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM_RAM_LOOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t param_start_idx:10;
      uint64_t reservedSpace0:6;
      uint64_t param_end_idx:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM_RAM_IDX_ALT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t numloops:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM_RAM_LOOP_ALT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwa_en:3;
      uint64_t reservedSpace0:5;
      uint64_t hwa_clk_en:3;
      uint64_t reservedSpace1:5;
      uint64_t hwa_reset:3;
      uint64_t reservedSpace2:5;
      uint64_t hwa_dyn_clk_en:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREVIOUS_NAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cs_enable:1;
      uint64_t reservedSpace0:7;
      uint64_t cs_trigmode:4;
      uint64_t reservedSpace1:4;
      uint64_t cs_trgsrc:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CS_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fw2dma_trigger:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FW2DMA_TRIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dma2hwa_trigger:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2HWA_TRIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH0DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH0DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH1DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH1DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH2DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH2DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH3DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH3DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH4DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH4DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH5DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH5DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH6DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH6DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH7DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH7DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH8DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH8DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH9DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH9DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH10DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH10DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH11DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH11DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH12DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH12DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH13DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH13DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH14DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH14DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH15DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH15DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH16DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH16DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH17DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH17DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH18DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH18DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH19DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH19DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH20DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH20DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH21DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH21DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH22DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH22DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH23DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH23DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH24DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH24DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH25DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH25DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH26DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH26DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH27DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH27DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH28DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH28DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH29DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH29DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH30DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH30DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGDMACH31DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGDMACH31DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fw2hwa_trigger_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FW2HWA_TRIG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fw2hwa_trigger_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FW2HWA_TRIG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fw2hwa_trigger_cs:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CS_FW2ACC_TRIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bpm_pattern_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BPM_PATTERN_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bpm_pattern_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BPM_PATTERN_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bpm_pattern_2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BPM_PATTERN_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bpm_pattern_3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BPM_PATTERN_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bpm_pattern_4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BPM_PATTERN_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bpm_pattern_5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BPM_PATTERN_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bpm_pattern_6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BPM_PATTERN_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bpm_pattern_7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BPM_PATTERN_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bpm_rate:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BPM_RATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t param_done_set_status_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM_DONE_SET_STATUS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t param_done_set_status_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM_DONE_SET_STATUS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t param_done_status_clr_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM_DONE_CLR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t param_done_status_clr_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM_DONE_CLR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t trigger_set_status_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIGGER_SET_STATUS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t trigger_set_status_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIGGER_SET_STATUS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t trigger_set_in_clr_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIGGER_SET_IN_CLR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t trigger_set_in_clr_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIGGER_SET_IN_CLR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_reset_sw:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_RESET_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_scale:9;
      uint64_t reservedSpace0:7;
      uint64_t dc_est_shift:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_i_0_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_I_0_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_i_1_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_I_1_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_i_2_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_I_2_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_i_3_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_I_3_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_i_4_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_I_4_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_i_5_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_I_5_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_i_6_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_I_6_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_i_7_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_I_7_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_i_8_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_I_8_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_i_9_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_I_9_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_i_10_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_I_10_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_i_11_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_I_11_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_q_0_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_Q_0_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_q_1_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_Q_1_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_q_2_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_Q_2_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_q_3_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_Q_3_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_q_4_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_Q_4_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_q_5_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_Q_5_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_q_6_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_Q_6_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_q_7_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_Q_7_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_q_8_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_Q_8_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_q_9_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_Q_9_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_q_10_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_Q_10_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_q_11_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_Q_11_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_0_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_0_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_0_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_0_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_1_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_1_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_1_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_1_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_2_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_2_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_2_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_2_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_3_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_3_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_3_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_3_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_4_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_4_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_4_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_4_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_5_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_5_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_5_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_5_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_6_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_6_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_6_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_6_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_7_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_7_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_7_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_7_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_8_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_8_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_8_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_8_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_9_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_9_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_9_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_9_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_10_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_10_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_10_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_10_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_11_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_11_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_i_11_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_I_11_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_0_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_0_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_0_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_0_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_1_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_1_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_1_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_1_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_2_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_2_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_2_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_2_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_3_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_3_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_3_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_3_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_4_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_4_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_4_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_4_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_5_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_5_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_5_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_5_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_6_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_6_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_6_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_6_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_7_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_7_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_7_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_7_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_8_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_8_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_8_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_8_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_9_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_9_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_9_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_9_VAL_MSB;

