iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_10_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_10_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_10_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_10_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_11_val_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_11_VAL_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_q_11_val_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_Q_11_VAL_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_acc_clip_status:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_ACC_CLIP_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_est_clip_status:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_EST_CLIP_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_i0_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_I0_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_i1_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_I1_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_i2_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_I2_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_i3_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_I3_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_i4_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_I4_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_i5_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_I5_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_i6_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_I6_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_i7_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_I7_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_i8_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_I8_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_i9_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_I9_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_i10_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_I10_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_i11_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_I11_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_q0_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_Q0_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_q1_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_Q1_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_q2_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_Q2_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_q3_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_Q3_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_q4_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_Q4_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_q5_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_Q5_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_q6_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_Q6_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_q7_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_Q7_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_q8_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_Q8_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_q9_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_Q9_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_q10_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_Q10_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_q11_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_Q11_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DC_SUB_CLIP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_SUB_CLIP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_sub_reserved_2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_RESERVED_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_sub_reserved_3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_RESERVED_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_sub_reserved_4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_RESERVED_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dc_sub_reserved_5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_RESERVED_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_reset_sw:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_RESET_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_shift:3;
      uint64_t reservedSpace0:1;
      uint64_t intf_stats_magdiff_shift:3;
      uint64_t reservedSpace1:9;
      uint64_t intf_stats_mag_scale:8;
      uint64_t intf_stats_magdiff_scale:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag0_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG0_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag1_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG1_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag2_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG2_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag3_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG3_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag4_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG4_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag5_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG5_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag6_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG6_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag7_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG7_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag8_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG8_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag9_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG9_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag10_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG10_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag11_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG11_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff0_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF0_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff1_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF1_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff2_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF2_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff3_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF3_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff4_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF4_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff5_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF5_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff6_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF6_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff7_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF7_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff8_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF8_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff9_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF9_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff10_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF10_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff11_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF11_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_count_all_chirp:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_COUNT_ALL_CHIRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_count_all_frame:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_COUNT_ALL_FRAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_0_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_0_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_0_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_0_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_1_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_1_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_1_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_1_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_2_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_2_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_2_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_2_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_3_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_3_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_3_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_3_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_4_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_4_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_4_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_4_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_5_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_5_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_5_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_5_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_6_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_6_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_6_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_6_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_7_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_7_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_7_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_7_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_8_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_8_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_8_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_8_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_9_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_9_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_9_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_9_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_10_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_10_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_10_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_10_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_11_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_11_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_acc_11_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAG_ACC_11_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_0_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_0_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_0_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_0_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_1_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_1_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_1_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_1_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_2_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_2_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_2_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_2_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_3_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_3_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_3_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_3_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_4_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_4_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_4_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_4_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_5_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_5_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_5_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_5_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_6_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_6_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_6_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_6_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_7_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_7_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_7_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_7_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_8_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_8_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_8_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_8_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_9_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_9_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_9_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_9_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_10_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_10_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_10_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_10_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_11_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_11_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_magdiff_acc_11_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_MAGDIFF_ACC_11_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag0_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG0_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag1_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG1_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag2_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG2_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag3_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG3_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag4_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG4_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag5_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG5_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag6_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG6_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag7_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG7_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag8_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG8_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag9_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG9_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag10_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG10_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_mag11_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAG11_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff0_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF0_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff1_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF1_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff2_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF2_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff3_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF3_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff4_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF4_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff5_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF5_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff6_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF6_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff7_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF7_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff8_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF8_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff9_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF9_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff10_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF10_SW;

