iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_loc_thresh_magdiff11_sw:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_LOC_THRESH_MAGDIFF11_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_mag_accumulator_clip_status:12;
      uint64_t reservedSpace0:4;
      uint64_t intf_stats_magdiff_accumulator_clip_status:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_ACC_CLIP_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_thresh_mag_clip_status:12;
      uint64_t reservedSpace0:4;
      uint64_t intf_stats_thresh_magdiff_clip_status:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_THRESH_CLIP_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_mitg_window_param_0:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_MITG_WINDOW_PARAM_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_mitg_window_param_1:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_MITG_WINDOW_PARAM_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_mitg_window_param_2:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_MITG_WINDOW_PARAM_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_mitg_window_param_3:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_MITG_WINDOW_PARAM_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_mitg_window_param_4:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_MITG_WINDOW_PARAM_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_sum_mag_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_SUM_MAG_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_sum_mag_val_clip_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_SUM_MAG_VAL_CLIP_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_sum_magdiff_val:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_SUM_MAGDIFF_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intf_stats_sum_magdiff_val_clip_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF_STATS_SUM_MAGDIFF_VAL_CLIP_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t interf_reserved_5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTERF_RESERVED_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t icmult_scale0:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMULT_SCALE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t icmult_scale1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMULT_SCALE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t icmult_scale2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMULT_SCALE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t icmult_scale3:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMULT_SCALE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t icmult_scale4:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMULT_SCALE4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t icmult_scale5:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMULT_SCALE5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t icmult_scale6:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMULT_SCALE6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t icmult_scale7:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMULT_SCALE7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t icmult_scale8:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMULT_SCALE8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t icmult_scale9:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMULT_SCALE9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t icmult_scale10:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMULT_SCALE10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t icmult_scale11:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICMULT_SCALE11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t qcmult_scale0:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCMULT_SCALE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t qcmult_scale1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCMULT_SCALE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t qcmult_scale2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCMULT_SCALE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t qcmult_scale3:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCMULT_SCALE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t qcmult_scale4:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCMULT_SCALE4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t qcmult_scale5:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCMULT_SCALE5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t qcmult_scale6:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCMULT_SCALE6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t qcmult_scale7:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCMULT_SCALE7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t qcmult_scale8:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCMULT_SCALE8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t qcmult_scale9:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCMULT_SCALE9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t qcmult_scale10:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCMULT_SCALE10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t qcmult_scale11:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCMULT_SCALE11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t twid_incr_delta_frac:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWID_INCR_DELTA_FRAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t recwin_reset_sw:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RECWIN_RESET_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t twid_incr_delta_frac_reset_sw:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWID_INCR_DELTA_FRAC_RESET_SW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t twid_incr_delta_frac_clip_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWID_INCR_DELTA_FRAC_CLIP_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t recwin_init_kval:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RECWIN_INIT_KVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cmult_reserved_2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMULT_RESERVED_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t chan_comb_size:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_COMB_SIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t chan_comb_vec_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_COMB_VEC_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t chan_comb_vec_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_COMB_VEC_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t chan_comb_vec_2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_COMB_VEC_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t chan_comb_vec_3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_COMB_VEC_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t chan_comb_vec_4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_COMB_VEC_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t chan_comb_vec_5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_COMB_VEC_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t chan_comb_vec_6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_COMB_VEC_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t chan_comb_vec_7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHAN_COMB_VEC_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t channel_comb_clip_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANNEL_COMB_CLIP_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t zero_insert_num:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZERO_INSERT_NUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t zero_insert_mask_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZERO_INSERT_MASK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t zero_insert_mask_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZERO_INSERT_MASK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t zero_insert_mask_2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZERO_INSERT_MASK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t zero_insert_mask_3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZERO_INSERT_MASK_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t zero_insert_mask_4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZERO_INSERT_MASK_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t zero_insert_mask_5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZERO_INSERT_MASK_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t zero_insert_mask_6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZERO_INSERT_MASK_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t zero_insert_mask_7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZERO_INSERT_MASK_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t zero_insert_reserved_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZERO_INSERT_RESERVED_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t zero_insert_reserved_2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZERO_INSERT_RESERVED_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t zero_insert_reserved_3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZERO_INSERT_RESERVED_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t zero_insert_reserved_4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZERO_INSERT_RESERVED_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t lfsr_seed:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFSR_SEED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t lfsr_load:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFSR_LOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dither_twid_en:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITHER_TWID_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fft_clip:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FFT_CLIP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clr_fftclip:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_FFTCLIP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clr_clip_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_CLIP_MISC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ip_formatter_clip_status:1;
      uint64_t reservedSpace0:15;
      uint64_t op_formatter_clip_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IP_OP_FORMATTER_CLIP_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fft_reserved_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FFT_RESERVED_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fft_reserved_2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FFT_RESERVED_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fft_reserved_3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FFT_RESERVED_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t max1_value:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAX1_VALUE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t max2_value:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAX2_VALUE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t max3_value:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAX3_VALUE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t max4_value:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAX4_VALUE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t max1_index:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAX1_INDEX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t max2_index:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAX2_INDEX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t max3_index:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAX3_INDEX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t max4_index:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAX4_INDEX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t i_sum1_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I_SUM1_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t i_sum1_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I_SUM1_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t i_sum2_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I_SUM2_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t i_sum2_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I_SUM2_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t i_sum3_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I_SUM3_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t i_sum3_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I_SUM3_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t i_sum4_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I_SUM4_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t i_sum4_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I_SUM4_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t q_sum1_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Q_SUM1_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t q_sum1_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Q_SUM1_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t q_sum2_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Q_SUM2_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t q_sum2_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Q_SUM2_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t q_sum3_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Q_SUM3_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t q_sum3_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Q_SUM3_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t q_sum4_lsb:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Q_SUM4_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t q_sum4_msb:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Q_SUM4_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fftsumdiv:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FFTSUMDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t max2d_offset_dim1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAX2D_OFFSET_DIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t max2d_offset_dim2:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAX2D_OFFSET_DIM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cdf_cnt_thresh:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDF_CNT_THRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stats_reserved_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATS_RESERVED_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stats_reserved_2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATS_RESERVED_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stats_reserved_3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATS_RESERVED_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stats_reserved_4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATS_RESERVED_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t stats_reserved_5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATS_RESERVED_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cfar_peakcnt:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFAR_PEAKCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cfar_det_thr:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFAR_DET_THR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cfar_test_reg:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFAR_TEST_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cfar_thresh:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFAR_THRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cfar_reserved_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFAR_RESERVED_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cfar_reserved_2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFAR_RESERVED_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cfar_reserved_3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFAR_RESERVED_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cfar_reserved_4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFAR_RESERVED_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cmp_ege_k0:5;
      uint64_t reservedSpace0:3;
      uint64_t cmp_ege_k1:5;
      uint64_t reservedSpace1:3;
      uint64_t cmp_ege_k2:5;
      uint64_t reservedSpace2:3;
      uint64_t cmp_ege_k3:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP_EGE_K0123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cmp_ege_k4:5;
      uint64_t reservedSpace0:3;
      uint64_t cmp_ege_k5:5;
      uint64_t reservedSpace1:3;
      uint64_t cmp_ege_k6:5;
      uint64_t reservedSpace2:3;
      uint64_t cmp_ege_k7:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP_EGE_K4567;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem0:1;
      uint64_t dmem1:1;
      uint64_t dmem2:1;
      uint64_t dmem3:1;
      uint64_t dmem4:1;
      uint64_t dmem5:1;
      uint64_t dmem6:1;
      uint64_t dmem7:1;
      uint64_t param_ram:1;
      uint64_t window_ram:1;
      uint64_t per_sample_max_val_even_ram:1;
      uint64_t per_sample_max_val_odd_ram:1;
      uint64_t per_iter_max_val_ram:1;
      uint64_t hist_even_ram:1;
      uint64_t hist_odd_ram:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEM_INIT_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem0:1;
      uint64_t dmem1:1;
      uint64_t dmem2:1;
      uint64_t dmem3:1;
      uint64_t dmem4:1;
      uint64_t dmem5:1;
      uint64_t dmem6:1;
      uint64_t dmem7:1;
      uint64_t param_ram:1;
      uint64_t window_ram:1;
      uint64_t per_sample_max_val_even_ram:1;
      uint64_t per_sample_max_val_odd_ram:1;
      uint64_t per_iteration_max_val_ram:1;
      uint64_t hist_even_ram:1;
      uint64_t hist_odd_ram:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEM_INIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem0:1;
      uint64_t dmem1:1;
      uint64_t dmem2:1;
      uint64_t dmem3:1;
      uint64_t dmem4:1;
      uint64_t dmem5:1;
      uint64_t dmem6:1;
      uint64_t dmem7:1;
      uint64_t param_ram:1;
      uint64_t window_ram:1;
      uint64_t per_sample_max_val_even_ram:1;
      uint64_t per_sample_max_val_odd_ram:1;
      uint64_t per_iteration_max_val_ram:1;
      uint64_t hist_even_ram:1;
      uint64_t hist_odd_ram:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEM_INIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dimb_thresh_val:16;
      uint64_t dimc_thresh_val:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LM_THRESH_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t base_addr_dimb:12;
      uint64_t reservedSpace0:4;
      uint64_t base_addr_dimc:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LM_2DSTATS_BASE_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cfg_fsm_lockstep_en:1;
      uint64_t cfg_fsm_lockstep_inv_en:1;
      uint64_t cfg_window_ram_parity_en:1;
      uint64_t cfg_dmem_parity_en:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_SAFETY_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem0:1;
      uint64_t dmem1:1;
      uint64_t dmem2:1;
      uint64_t dmem3:1;
      uint64_t dmem4:1;
      uint64_t dmem5:1;
      uint64_t dmem6:1;
      uint64_t dmem7:1;
      uint64_t window_ram:1;
      uint64_t fsm_lockstep:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_SAFETY_ERR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem0:1;
      uint64_t dmem1:1;
      uint64_t dmem2:1;
      uint64_t dmem3:1;
      uint64_t dmem4:1;
      uint64_t dmem5:1;
      uint64_t dmem6:1;
      uint64_t dmem7:1;
      uint64_t window_ram:1;
      uint64_t fsm_lockstep:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_SAFETY_ERR_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem0:1;
      uint64_t dmem1:1;
      uint64_t dmem2:1;
      uint64_t dmem3:1;
      uint64_t dmem4:1;
      uint64_t dmem5:1;
      uint64_t dmem6:1;
      uint64_t dmem7:1;
      uint64_t window_ram:1;
      uint64_t fsm_lockstep:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_SAFETY_ERR_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem0_err_addr:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_SAFETY_DMEM0_ERR_ADDR;

