iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem1_err_addr:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_SAFETY_DMEM1_ERR_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem2_err_addr:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_SAFETY_DMEM2_ERR_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem3_err_addr:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_SAFETY_DMEM3_ERR_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem4_err_addr:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_SAFETY_DMEM4_ERR_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem5_err_addr:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_SAFETY_DMEM5_ERR_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem6_err_addr:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_SAFETY_DMEM6_ERR_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem7_err_addr:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_SAFETY_DMEM7_ERR_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t window_ram_err_addr:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_SAFETY_WINDOW_RAM_ERR_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dmem0:1;
      uint64_t dmem1:1;
      uint64_t dmem2:1;
      uint64_t dmem3:1;
      uint64_t dmem4:1;
      uint64_t dmem5:1;
      uint64_t dmem6:1;
      uint64_t dmem7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEM_ACCESS_ERR_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t loop_cnt:12;
      uint64_t reservedSpace0:4;
      uint64_t loop_cnt_alt:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOOP_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t paramaddr:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAMADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t paramaddr:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAMADDR_CPUINTR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t paramaddr:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAMADDR_CPUINTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fsm_state:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t single_step_en:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SINGLE_STEP_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t single_step_trig:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SINGLE_STEP_TRIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_DMEM_A_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_DMEM_A_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_DMEM_A_BUS_SAFETY_ERR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_DMEM_A_BUS_SAFETY_ERR_STAT_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enable:3;
      uint64_t reservedSpace0:5;
      uint64_t err_clear:1;
      uint64_t reservedSpace1:7;
      uint64_t type:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_DMEM_B_BUS_SAFETY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t global_main:1;
      uint64_t global_safe:1;
      uint64_t global_main_req:1;
      uint64_t global_safe_req:1;
      uint64_t sec:1;
      uint64_t ded:1;
      uint64_t reservedSpace0:2;
      uint64_t data:8;
      uint64_t main:8;
      uint64_t safe:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_DMEM_B_BUS_SAFETY_FI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t comp_err:8;
      uint64_t comp_check:8;
      uint64_t sec:8;
      uint64_t ded:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_DMEM_B_BUS_SAFETY_ERR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t d0:8;
      uint64_t d1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_DMEM_B_BUS_SAFETY_ERR_STAT_DATA0;

  uint8_t res2[2368];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_wph:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_WPH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rec0:1;
      uint64_t hw_spare_rec1:1;
      uint64_t hw_spare_rec2:1;
      uint64_t hw_spare_rec3:1;
      uint64_t hw_spare_rec4:1;
      uint64_t hw_spare_rec5:1;
      uint64_t hw_spare_rec6:1;
      uint64_t hw_spare_rec7:1;
      uint64_t hw_spare_rec8:1;
      uint64_t hw_spare_rec9:1;
      uint64_t hw_spare_rec10:1;
      uint64_t hw_spare_rec11:1;
      uint64_t hw_spare_rec12:1;
      uint64_t hw_spare_rec13:1;
      uint64_t hw_spare_rec14:1;
      uint64_t hw_spare_rec15:1;
      uint64_t hw_spare_rec16:1;
      uint64_t hw_spare_rec17:1;
      uint64_t hw_spare_rec18:1;
      uint64_t hw_spare_rec19:1;
      uint64_t hw_spare_rec20:1;
      uint64_t hw_spare_rec21:1;
      uint64_t hw_spare_rec22:1;
      uint64_t hw_spare_rec23:1;
      uint64_t hw_spare_rec24:1;
      uint64_t hw_spare_rec25:1;
      uint64_t hw_spare_rec26:1;
      uint64_t hw_spare_rec27:1;
      uint64_t hw_spare_rec28:1;
      uint64_t hw_spare_rec29:1;
      uint64_t hw_spare_rec30:1;
      uint64_t hw_spare_rec31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REC;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_raw_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enabled_status_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eoi;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_type_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b19_8:12;
      uint64_t b31_20:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_attr_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_clear;

