iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res12[2292];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CERH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EERH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EECRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EESRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t E8:1;
      uint64_t E9:1;
      uint64_t E10:1;
      uint64_t E11:1;
      uint64_t E12:1;
      uint64_t E13:1;
      uint64_t E14:1;
      uint64_t E15:1;
      uint64_t E16:1;
      uint64_t E17:1;
      uint64_t E18:1;
      uint64_t E19:1;
      uint64_t E20:1;
      uint64_t E21:1;
      uint64_t E22:1;
      uint64_t E23:1;
      uint64_t E24:1;
      uint64_t E25:1;
      uint64_t E26:1;
      uint64_t E27:1;
      uint64_t E28:1;
      uint64_t E29:1;
      uint64_t E30:1;
      uint64_t E31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E32:1;
      uint64_t E33:1;
      uint64_t E34:1;
      uint64_t E35:1;
      uint64_t E36:1;
      uint64_t E37:1;
      uint64_t E38:1;
      uint64_t E39:1;
      uint64_t E40:1;
      uint64_t E41:1;
      uint64_t E42:1;
      uint64_t E43:1;
      uint64_t E44:1;
      uint64_t E45:1;
      uint64_t E46:1;
      uint64_t E47:1;
      uint64_t E48:1;
      uint64_t E49:1;
      uint64_t E50:1;
      uint64_t E51:1;
      uint64_t E52:1;
      uint64_t E53:1;
      uint64_t E54:1;
      uint64_t E55:1;
      uint64_t E56:1;
      uint64_t E57:1;
      uint64_t E58:1;
      uint64_t E59:1;
      uint64_t E60:1;
      uint64_t E61:1;
      uint64_t E62:1;
      uint64_t E63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SECRH;

  uint8_t res13[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I0:1;
      uint64_t I1:1;
      uint64_t I2:1;
      uint64_t I3:1;
      uint64_t I4:1;
      uint64_t I5:1;
      uint64_t I6:1;
      uint64_t I7:1;
      uint64_t I8:1;
      uint64_t I9:1;
      uint64_t I10:1;
      uint64_t I11:1;
      uint64_t I12:1;
      uint64_t I13:1;
      uint64_t I14:1;
      uint64_t I15:1;
      uint64_t I16:1;
      uint64_t I17:1;
      uint64_t I18:1;
      uint64_t I19:1;
      uint64_t I20:1;
      uint64_t I21:1;
      uint64_t I22:1;
      uint64_t I23:1;
      uint64_t I24:1;
      uint64_t I25:1;
      uint64_t I26:1;
      uint64_t I27:1;
      uint64_t I28:1;
      uint64_t I29:1;
      uint64_t I30:1;
      uint64_t I31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I32:1;
      uint64_t I33:1;
      uint64_t I34:1;
      uint64_t I35:1;
      uint64_t I36:1;
      uint64_t I37:1;
      uint64_t I38:1;
      uint64_t I39:1;
      uint64_t I40:1;
      uint64_t I41:1;
      uint64_t I42:1;
      uint64_t I43:1;
      uint64_t I44:1;
      uint64_t I45:1;
      uint64_t I46:1;
      uint64_t I47:1;
      uint64_t I48:1;
      uint64_t I49:1;
      uint64_t I50:1;
      uint64_t I51:1;
      uint64_t I52:1;
      uint64_t I53:1;
      uint64_t I54:1;
      uint64_t I55:1;
      uint64_t I56:1;
      uint64_t I57:1;
      uint64_t I58:1;
      uint64_t I59:1;
      uint64_t I60:1;
      uint64_t I61:1;
      uint64_t I62:1;
      uint64_t I63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IERH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I0:1;
      uint64_t I1:1;
      uint64_t I2:1;
      uint64_t I3:1;
      uint64_t I4:1;
      uint64_t I5:1;
      uint64_t I6:1;
      uint64_t I7:1;
      uint64_t I8:1;
      uint64_t I9:1;
      uint64_t I10:1;
      uint64_t I11:1;
      uint64_t I12:1;
      uint64_t I13:1;
      uint64_t I14:1;
      uint64_t I15:1;
      uint64_t I16:1;
      uint64_t I17:1;
      uint64_t I18:1;
      uint64_t I19:1;
      uint64_t I20:1;
      uint64_t I21:1;
      uint64_t I22:1;
      uint64_t I23:1;
      uint64_t I24:1;
      uint64_t I25:1;
      uint64_t I26:1;
      uint64_t I27:1;
      uint64_t I28:1;
      uint64_t I29:1;
      uint64_t I30:1;
      uint64_t I31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I32:1;
      uint64_t I33:1;
      uint64_t I34:1;
      uint64_t I35:1;
      uint64_t I36:1;
      uint64_t I37:1;
      uint64_t I38:1;
      uint64_t I39:1;
      uint64_t I40:1;
      uint64_t I41:1;
      uint64_t I42:1;
      uint64_t I43:1;
      uint64_t I44:1;
      uint64_t I45:1;
      uint64_t I46:1;
      uint64_t I47:1;
      uint64_t I48:1;
      uint64_t I49:1;
      uint64_t I50:1;
      uint64_t I51:1;
      uint64_t I52:1;
      uint64_t I53:1;
      uint64_t I54:1;
      uint64_t I55:1;
      uint64_t I56:1;
      uint64_t I57:1;
      uint64_t I58:1;
      uint64_t I59:1;
      uint64_t I60:1;
      uint64_t I61:1;
      uint64_t I62:1;
      uint64_t I63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IECRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I0:1;
      uint64_t I1:1;
      uint64_t I2:1;
      uint64_t I3:1;
      uint64_t I4:1;
      uint64_t I5:1;
      uint64_t I6:1;
      uint64_t I7:1;
      uint64_t I8:1;
      uint64_t I9:1;
      uint64_t I10:1;
      uint64_t I11:1;
      uint64_t I12:1;
      uint64_t I13:1;
      uint64_t I14:1;
      uint64_t I15:1;
      uint64_t I16:1;
      uint64_t I17:1;
      uint64_t I18:1;
      uint64_t I19:1;
      uint64_t I20:1;
      uint64_t I21:1;
      uint64_t I22:1;
      uint64_t I23:1;
      uint64_t I24:1;
      uint64_t I25:1;
      uint64_t I26:1;
      uint64_t I27:1;
      uint64_t I28:1;
      uint64_t I29:1;
      uint64_t I30:1;
      uint64_t I31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I32:1;
      uint64_t I33:1;
      uint64_t I34:1;
      uint64_t I35:1;
      uint64_t I36:1;
      uint64_t I37:1;
      uint64_t I38:1;
      uint64_t I39:1;
      uint64_t I40:1;
      uint64_t I41:1;
      uint64_t I42:1;
      uint64_t I43:1;
      uint64_t I44:1;
      uint64_t I45:1;
      uint64_t I46:1;
      uint64_t I47:1;
      uint64_t I48:1;
      uint64_t I49:1;
      uint64_t I50:1;
      uint64_t I51:1;
      uint64_t I52:1;
      uint64_t I53:1;
      uint64_t I54:1;
      uint64_t I55:1;
      uint64_t I56:1;
      uint64_t I57:1;
      uint64_t I58:1;
      uint64_t I59:1;
      uint64_t I60:1;
      uint64_t I61:1;
      uint64_t I62:1;
      uint64_t I63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IESRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I0:1;
      uint64_t I1:1;
      uint64_t I2:1;
      uint64_t I3:1;
      uint64_t I4:1;
      uint64_t I5:1;
      uint64_t I6:1;
      uint64_t I7:1;
      uint64_t I8:1;
      uint64_t I9:1;
      uint64_t I10:1;
      uint64_t I11:1;
      uint64_t I12:1;
      uint64_t I13:1;
      uint64_t I14:1;
      uint64_t I15:1;
      uint64_t I16:1;
      uint64_t I17:1;
      uint64_t I18:1;
      uint64_t I19:1;
      uint64_t I20:1;
      uint64_t I21:1;
      uint64_t I22:1;
      uint64_t I23:1;
      uint64_t I24:1;
      uint64_t I25:1;
      uint64_t I26:1;
      uint64_t I27:1;
      uint64_t I28:1;
      uint64_t I29:1;
      uint64_t I30:1;
      uint64_t I31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I32:1;
      uint64_t I33:1;
      uint64_t I34:1;
      uint64_t I35:1;
      uint64_t I36:1;
      uint64_t I37:1;
      uint64_t I38:1;
      uint64_t I39:1;
      uint64_t I40:1;
      uint64_t I41:1;
      uint64_t I42:1;
      uint64_t I43:1;
      uint64_t I44:1;
      uint64_t I45:1;
      uint64_t I46:1;
      uint64_t I47:1;
      uint64_t I48:1;
      uint64_t I49:1;
      uint64_t I50:1;
      uint64_t I51:1;
      uint64_t I52:1;
      uint64_t I53:1;
      uint64_t I54:1;
      uint64_t I55:1;
      uint64_t I56:1;
      uint64_t I57:1;
      uint64_t I58:1;
      uint64_t I59:1;
      uint64_t I60:1;
      uint64_t I61:1;
      uint64_t I62:1;
      uint64_t I63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I0:1;
      uint64_t I1:1;
      uint64_t I2:1;
      uint64_t I3:1;
      uint64_t I4:1;
      uint64_t I5:1;
      uint64_t I6:1;
      uint64_t I7:1;
      uint64_t I8:1;
      uint64_t I9:1;
      uint64_t I10:1;
      uint64_t I11:1;
      uint64_t I12:1;
      uint64_t I13:1;
      uint64_t I14:1;
      uint64_t I15:1;
      uint64_t I16:1;
      uint64_t I17:1;
      uint64_t I18:1;
      uint64_t I19:1;
      uint64_t I20:1;
      uint64_t I21:1;
      uint64_t I22:1;
      uint64_t I23:1;
      uint64_t I24:1;
      uint64_t I25:1;
      uint64_t I26:1;
      uint64_t I27:1;
      uint64_t I28:1;
      uint64_t I29:1;
      uint64_t I30:1;
      uint64_t I31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I32:1;
      uint64_t I33:1;
      uint64_t I34:1;
      uint64_t I35:1;
      uint64_t I36:1;
      uint64_t I37:1;
      uint64_t I38:1;
      uint64_t I39:1;
      uint64_t I40:1;
      uint64_t I41:1;
      uint64_t I42:1;
      uint64_t I43:1;
      uint64_t I44:1;
      uint64_t I45:1;
      uint64_t I46:1;
      uint64_t I47:1;
      uint64_t I48:1;
      uint64_t I49:1;
      uint64_t I50:1;
      uint64_t I51:1;
      uint64_t I52:1;
      uint64_t I53:1;
      uint64_t I54:1;
      uint64_t I55:1;
      uint64_t I56:1;
      uint64_t I57:1;
      uint64_t I58:1;
      uint64_t I59:1;
      uint64_t I60:1;
      uint64_t I61:1;
      uint64_t I62:1;
      uint64_t I63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVAL:1;
      uint64_t SET:1;
      uint64_t RES69:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEVAL;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES70:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES71:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEER;

