iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t I32:1;
      uint64_t I33:1;
      uint64_t I34:1;
      uint64_t I35:1;
      uint64_t I36:1;
      uint64_t I37:1;
      uint64_t I38:1;
      uint64_t I39:1;
      uint64_t I40:1;
      uint64_t I41:1;
      uint64_t I42:1;
      uint64_t I43:1;
      uint64_t I44:1;
      uint64_t I45:1;
      uint64_t I46:1;
      uint64_t I47:1;
      uint64_t I48:1;
      uint64_t I49:1;
      uint64_t I50:1;
      uint64_t I51:1;
      uint64_t I52:1;
      uint64_t I53:1;
      uint64_t I54:1;
      uint64_t I55:1;
      uint64_t I56:1;
      uint64_t I57:1;
      uint64_t I58:1;
      uint64_t I59:1;
      uint64_t I60:1;
      uint64_t I61:1;
      uint64_t I62:1;
      uint64_t I63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICRH_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVAL:1;
      uint64_t SET:1;
      uint64_t RES76:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEVAL_RN;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES77:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QER_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES78:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEER_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES79:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEECR_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES80:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QEESR_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES81:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSER_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t E0:1;
      uint64_t E1:1;
      uint64_t E2:1;
      uint64_t E3:1;
      uint64_t E4:1;
      uint64_t E5:1;
      uint64_t E6:1;
      uint64_t E7:1;
      uint64_t RES82:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSECR_RN;

};

#define DSS_TPCC_C (*(volatile struct DSS_TPCC_C_tag *) 0x6140000)

struct DSS_TPTC_A0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b27_16:12;
      uint64_t reservedSpace0:2;
      uint64_t b31_30:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:1;
      uint64_t b5_4:2;
      uint64_t reservedSpace1:2;
      uint64_t b9_8:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCCFG;

  uint8_t res0[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t reservedSpace0:1;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b8_8:1;
      uint64_t reservedSpace2:3;
      uint64_t b13_12:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCMD;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t reservedSpace0:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t reservedSpace0:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERREN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t reservedSpace0:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:4;
      uint64_t b13_8:6;
      uint64_t reservedSpace1:2;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRDET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRCMD;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDRATE;

  uint8_t res3[188];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t reservedSpace0:2;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b17_12:6;
      uint64_t reservedSpace3:2;
      uint64_t b20_20:1;
      uint64_t reservedSpace4:1;
      uint64_t b22_22:1;
      uint64_t reservedSpace5:5;
      uint64_t b29_28:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBIDX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:4;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPPRXY;

  uint8_t res4[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t reservedSpace0:2;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b17_12:6;
      uint64_t reservedSpace3:2;
      uint64_t b20_20:1;
      uint64_t reservedSpace4:1;
      uint64_t b22_22:1;
      uint64_t reservedSpace5:5;
      uint64_t b29_28:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAOPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SASRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b22_0:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SACNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SABIDX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:4;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMPPRXY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SACNTRLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SASRCBREF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADSTBREF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SABCNT;

