iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDRATE;

  uint8_t res3[188];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t reservedSpace0:2;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b17_12:6;
      uint64_t reservedSpace3:2;
      uint64_t b20_20:1;
      uint64_t reservedSpace4:1;
      uint64_t b22_22:1;
      uint64_t reservedSpace5:5;
      uint64_t b29_28:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBIDX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:4;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPPRXY;

  uint8_t res4[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t reservedSpace0:2;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b17_12:6;
      uint64_t reservedSpace3:2;
      uint64_t b20_20:1;
      uint64_t reservedSpace4:1;
      uint64_t b22_22:1;
      uint64_t reservedSpace5:5;
      uint64_t b29_28:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAOPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SASRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b22_0:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SACNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SABIDX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:4;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMPPRXY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SACNTRLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SASRCBREF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADSTBREF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SABCNT;

  uint8_t res5[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFCNTRLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSRCBREF;

  uint8_t res6[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t reservedSpace0:2;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b17_12:6;
      uint64_t reservedSpace3:2;
      uint64_t b20_20:1;
      uint64_t reservedSpace4:1;
      uint64_t b22_22:1;
      uint64_t reservedSpace5:5;
      uint64_t b29_28:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFOPT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b22_0:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFACNT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFDST0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFBIDX0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:4;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFMPPRXY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFBCNT0;

  uint8_t res7[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t reservedSpace0:2;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b17_12:6;
      uint64_t reservedSpace3:2;
      uint64_t b20_20:1;
      uint64_t reservedSpace4:1;
      uint64_t b22_22:1;
      uint64_t reservedSpace5:5;
      uint64_t b29_28:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFOPT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b22_0:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFACNT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFDST1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFBIDX1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:4;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFMPPRXY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFBCNT1;

