iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define DSS_TPTC_C3 (*(volatile struct DSS_TPTC_C3_tag *) 0x6240000)

struct DSS_TPTC_C4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b27_16:12;
      uint64_t reservedSpace0:2;
      uint64_t b31_30:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:1;
      uint64_t b5_4:2;
      uint64_t reservedSpace1:2;
      uint64_t b9_8:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCCFG;

  uint8_t res0[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t reservedSpace0:1;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b8_8:1;
      uint64_t reservedSpace2:3;
      uint64_t b13_12:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCMD;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t reservedSpace0:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t reservedSpace0:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERREN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t reservedSpace0:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:4;
      uint64_t b13_8:6;
      uint64_t reservedSpace1:2;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRDET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRCMD;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDRATE;

  uint8_t res3[188];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t reservedSpace0:2;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b17_12:6;
      uint64_t reservedSpace3:2;
      uint64_t b20_20:1;
      uint64_t reservedSpace4:1;
      uint64_t b22_22:1;
      uint64_t reservedSpace5:5;
      uint64_t b29_28:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBIDX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:4;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPPRXY;

  uint8_t res4[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t reservedSpace0:2;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b17_12:6;
      uint64_t reservedSpace3:2;
      uint64_t b20_20:1;
      uint64_t reservedSpace4:1;
      uint64_t b22_22:1;
      uint64_t reservedSpace5:5;
      uint64_t b29_28:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAOPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SASRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b22_0:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SACNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SABIDX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:4;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMPPRXY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SACNTRLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SASRCBREF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADSTBREF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SABCNT;

