iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS50MSTID:16;
      uint64_t PCS51MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS25MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS52MSTID:16;
      uint64_t PCS53MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS26MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS54MSTID:16;
      uint64_t PCS55MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS27MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS56MSTID:16;
      uint64_t PCS57MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS28MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS58MSTID:16;
      uint64_t PCS59MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS29MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS60MSTID:16;
      uint64_t PCS61MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS30MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS62MSTID:16;
      uint64_t PCS63MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS31MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS0MSTID:16;
      uint64_t PPCS1MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS0MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS2MSTID:16;
      uint64_t PPCS3MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS1MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS4MSTID:16;
      uint64_t PPCS5MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS2MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS6MSTID:16;
      uint64_t PPCS7MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS3MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS8MSTID:16;
      uint64_t PPCS9MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS4MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS10MSTID:16;
      uint64_t PPCS11MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS5MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS12MSTID:16;
      uint64_t PPCS13MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS6MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPCS14MSTID:16;
      uint64_t PPCS15MSTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCS7MSTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCREXT_MSTID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCREXTMSTID;

};

#define DSS_PCR (*(volatile struct DSS_PCR_tag *) 0x6f78000)

struct DSS_DSP_PBIST_tag
{
  uint32_t PBIST_A0;
  uint32_t PBIST_A1;
  uint32_t PBIST_A2;
  uint32_t PBIST_A3;
  uint32_t PBIST_L0;
  uint32_t PBIST_L1;
  uint32_t PBIST_L2;
  uint32_t PBIST_L3;
  uint32_t PBIST_DD10;
  uint32_t PBIST_DE10;
  uint8_t res0[8];

  uint32_t PBIST_CA0;
  uint32_t PBIST_CA1;
  uint32_t PBIST_CA2;
  uint32_t PBIST_CA3;
  uint32_t PBIST_CL0;
  uint32_t PBIST_CL1;
  uint32_t PBIST_CL2;
  uint32_t PBIST_CL3;
  uint32_t PBIST_CI0;
  uint32_t PBIST_CI1;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PBIST_CI2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PBIST_CI2;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PBIST_CI3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PBIST_CI3;

  uint8_t res2[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM:8;
      uint64_t DWR:8;
      uint64_t RDS:8;
      uint64_t RGS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBIST_RAMT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DLR0:8;
      uint64_t DLR1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PBIST_DLR;

  uint8_t res3[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBIST_CMS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PBIST_CMS;

  uint8_t res4[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBIST_PC:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PBIST_PC;

  uint8_t res5[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCR0:8;
      uint64_t SCR1:8;
      uint64_t SCR2:8;
      uint64_t SCR3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBIST_SCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCR4:8;
      uint64_t SCR5:8;
      uint64_t SCR6:8;
      uint64_t SCR7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBIST_SCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CS0:8;
      uint64_t CS1:8;
      uint64_t CS2:8;
      uint64_t CS3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBIST_CS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBIST_FDLY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PBIST_FDLY;

  uint8_t res6[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBIST_PACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PBIST_PACT;

  uint8_t res7[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBIST_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PBIST_ID;

  uint8_t res8[3];

  uint32_t PBIST_OVR;
  uint8_t res9[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBIST_FSFR0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PBIST_FSFR0;

  uint8_t res10[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBIST_FSFR1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PBIST_FSFR1;

  uint8_t res11[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBIST_FSRCR0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PBIST_FSRCR0;

  uint8_t res12[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBIST_FSRCR1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PBIST_FSRCR1;

  uint8_t res13[3];

  uint32_t PBIST_FSRA0;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PBIST_FSRA1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PBIST_FSRA1;

  uint8_t res14[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PBIST_FSRDL0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBIST_FSRDL0;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PBIST_FSRDL1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBIST_FSRDL1;

  uint32_t PBIST_MARGIN;
  uint32_t PBIST_WRENZ;
  uint32_t PBIST_PGS;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBIST_ROM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PBIST_ROM;

  uint8_t res16[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALGO0:8;
      uint64_t ALGO1:8;
      uint64_t ALGO2:8;
      uint64_t ALGO3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBIST_ALGO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RINFOL0:8;
      uint64_t RINFOL1:8;
      uint64_t RINFOL2:8;
      uint64_t RINFOL3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBIST_RINFOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RINFOU0:8;
      uint64_t RINFOU1:8;
      uint64_t RINFOU2:8;
      uint64_t RINFOU3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBIST_RINFOU;

