iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define DSS_RTIA (*(volatile struct DSS_RTIA_tag *) 0x6f7a000)

struct DSS_RTIB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT0EN:1;
      uint64_t CNT1EN:1;
      uint64_t RESERVED1:13;
      uint64_t COS:1;
      uint64_t NTUSEL:4;
      uint64_t RESERVED2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIGCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBEXT:1;
      uint64_t INC:1;
      uint64_t RESERVED3:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTITBCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPCNTR0:1;
      uint64_t CAPCNTR1:1;
      uint64_t RESERVED4:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICAPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0SEL:1;
      uint64_t RESERVED5:3;
      uint64_t COMP1SEL:1;
      uint64_t RESERVED6:3;
      uint64_t COMP2SEL:1;
      uint64_t RESERVED7:3;
      uint64_t COMP3SEL:1;
      uint64_t RESERVED8:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRC0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIFRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UC0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIUC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPUC0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICPUC0;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAFRC0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICAFRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAUC0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICAUC0;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRC1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIFRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UC1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIUC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPUC1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICPUC1;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAFRC1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICAFRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAUC1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICAUC1;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDCP0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIUDCP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDCP1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIUDCP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDCP2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIUDCP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDCP3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIUDCP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBLCOMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTITBLCOMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBHCOMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTITBHCOMP;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETINT0:1;
      uint64_t SETINT1:1;
      uint64_t SETINT2:1;
      uint64_t SETINT3:1;
      uint64_t RESERVED9:4;
      uint64_t SETDMA0:1;
      uint64_t SETDMA1:1;
      uint64_t SETDMA2:1;
      uint64_t SETDMA3:1;
      uint64_t RESERVED10:4;
      uint64_t SETTBINT:1;
      uint64_t SETOVL0INT:1;
      uint64_t SETOVL1INT:1;
      uint64_t RESERVED11:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTISETINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLEARINT0:1;
      uint64_t CLEARINT1:1;
      uint64_t CLEARINT2:1;
      uint64_t CLEARINT3:1;
      uint64_t RESERVED12:4;
      uint64_t CLEARDMA0:1;
      uint64_t CLEARDMA1:1;
      uint64_t CLEARDMA2:1;
      uint64_t CLEARDMA3:1;
      uint64_t RESERVED13:4;
      uint64_t CLEARTBINT:1;
      uint64_t CLEAROVL0INT:1;
      uint64_t CLEAROVL1INT:1;
      uint64_t RESERVED14:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICLEARINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT0:1;
      uint64_t INT1:1;
      uint64_t INT2:1;
      uint64_t INT3:1;
      uint64_t RESERVED15:12;
      uint64_t TBINT:1;
      uint64_t OVL0INT:1;
      uint64_t OVL1INT:1;
      uint64_t RESERVED16:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIINTFLAG;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DWDCTRL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIDWDCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DWDPRLD:12;
      uint64_t RESERVED17:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIDWDPRLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWDST:1;
      uint64_t DWDST:1;
      uint64_t KEYST:1;
      uint64_t STARTTIMEVIOL:1;
      uint64_t ENDTIMEVIOL:1;
      uint64_t DWWD_ST:1;
      uint64_t RESERVED18:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIWDSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDKEY:16;
      uint64_t RESERVED19:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIWDKEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DWDCNTR:25;
      uint64_t RESERVED20:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIDWDCNTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WWDRXN:4;
      uint64_t RESERVED21:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIWWDRXNCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WWDSIZE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIWWDSIZECTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTCLRENABLE0:4;
      uint64_t RESERVED22:4;
      uint64_t INTCLRENABLE1:4;
      uint64_t RESERVED23:4;
      uint64_t INTCLRENABLE2:4;
      uint64_t RESERVED24:4;
      uint64_t INTCLRENABLE3:4;
      uint64_t RESERVED25:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIINTCLRENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMP0CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP1CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMP1CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP2CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMP2CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP3CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMP3CLR;

