iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define DSS_SCIA (*(volatile struct DSS_SCIA_tag *) 0x6f7b000)

struct DSS_ESM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIESR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIECR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPSF:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMEPSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTOFFH:9;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIOFFHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTOFFL:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIOFFLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTCP:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMLTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTCP:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMLTCPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EKEY:4;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMEKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPSR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIESR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIECR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILSR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSR4;

  uint8_t res0[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPSR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIESR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIECR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILSR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSR7;

  uint8_t res1[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPSR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIEPCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIESR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIECR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILSR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLVLCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMILCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMSR10;

};

#define DSS_ESM (*(volatile struct DSS_ESM_tag *) 0x6f7d000)

struct MSS_CPSW_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_IDVER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_SYNCE_COUNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_SYNCE_MUX_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_CONTROL_REG;

