iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b11_0:12;
      uint64_t reservedSpace0:4;
      uint64_t b21_16:6;
      uint64_t reservedSpace1:9;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_INT_CONTROL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_STATUS_REG;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b2_1:2;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_RGMII1_STATUS_REG;

  uint8_t res2[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_TH_THRESH_PULSE_EN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_TH_PULSE_EN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_FH_PULSE_EN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_MISC_EN_REG;

  uint8_t res3[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_TH_THRESH_PULSE_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_TH_PULSE_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_FH_PULSE_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_MISC_STATUS_REG;

  uint8_t res4[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_TH_IMAX_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS_FH_IMAX_REG;

  uint8_t res5[3608];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b27_16:12;
      uint64_t b29_28:2;
      uint64_t b31_30:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIO_VERSION_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t reservedSpace0:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
      uint64_t b20_20:1;
      uint64_t reservedSpace1:3;
      uint64_t b28_24:5;
      uint64_t reservedSpace2:1;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONTROL_REG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALIVE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINK_INT_RAW_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINK_INT_MASKED_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINK_INT_MASK_SET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINK_INT_MASK_CLEAR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USER_INT_RAW_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USER_INT_MASKED_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USER_INT_MASK_SET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USER_INT_MASK_CLEAR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MANUAL_IF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t reservedSpace0:22;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLL_EN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLAUS45_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USER_ADDR0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USER_ADDR1_REG;

  uint8_t res6[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b20_16:5;
      uint64_t b25_21:5;
      uint64_t reservedSpace0:3;
      uint64_t b29_29:1;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USER_ACCESS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USER_PHY_SEL_REG;

  uint8_t res7[127096];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSW_ID_VER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t reservedSpace0:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t reservedSpace1:12;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONTROL_REG_1;

  uint8_t res8[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EM_CONTROL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT_PORT_EN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:3;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTYPE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOFT_IDLE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:8;
      uint64_t b15_12:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRU_RATE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAP_THRESH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b10_0:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_START_WDS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b11_0:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEE_PRESCALE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t b7_4:4;
      uint64_t b11_8:4;
      uint64_t b15_12:4;
      uint64_t b19_16:4;
      uint64_t b23_20:4;
      uint64_t b27_24:4;
      uint64_t b31_28:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_G_OFLOW_THRESH_SET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t b7_4:4;
      uint64_t b11_8:4;
      uint64_t b15_12:4;
      uint64_t b19_16:4;
      uint64_t b23_20:4;
      uint64_t b27_24:4;
      uint64_t b31_28:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_G_OFLOW_THRESH_CLR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b15_8:8;
      uint64_t b23_16:8;
      uint64_t b31_24:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_G_BUF_THRESH_SET_L_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b15_8:8;
      uint64_t b23_16:8;
      uint64_t b31_24:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_G_BUF_THRESH_SET_H_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b15_8:8;
      uint64_t b23_16:8;
      uint64_t b31_24:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_G_BUF_THRESH_CLR_L_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b15_8:8;
      uint64_t b23_16:8;
      uint64_t b31_24:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_G_BUF_THRESH_CLR_H_REG;

  uint8_t res9[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VLAN_LTYPE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EST_TS_DOMAIN_REG;

  uint8_t res10[168];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b13_0:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_PRI0_MAXLEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b13_0:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_PRI1_MAXLEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b13_0:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_PRI2_MAXLEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b13_0:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_PRI3_MAXLEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b13_0:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_PRI4_MAXLEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b13_0:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_PRI5_MAXLEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b13_0:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_PRI6_MAXLEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b13_0:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_PRI7_MAXLEN_REG;

