iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res11[3812];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t reservedSpace0:11;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_CONTROL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b13_0:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_FLOW_ID_OFFSET_REG;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t reservedSpace0:2;
      uint64_t b12_8:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_BLK_CNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b11_0:12;
      uint64_t b12_12:1;
      uint64_t b15_13:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PORT_VLAN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:1;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b14_12:3;
      uint64_t reservedSpace3:1;
      uint64_t b18_16:3;
      uint64_t reservedSpace4:1;
      uint64_t b22_20:3;
      uint64_t reservedSpace5:1;
      uint64_t b26_24:3;
      uint64_t reservedSpace6:1;
      uint64_t b30_28:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_TX_PRI_MAP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t b8_8:1;
      uint64_t reservedSpace1:7;
      uint64_t b23_16:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_CTL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:1;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b14_12:3;
      uint64_t reservedSpace3:1;
      uint64_t b18_16:3;
      uint64_t reservedSpace4:1;
      uint64_t b22_20:3;
      uint64_t reservedSpace5:1;
      uint64_t b26_24:3;
      uint64_t reservedSpace6:1;
      uint64_t b30_28:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RX_PRI_MAP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b13_0:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RX_MAXLEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t b7_4:4;
      uint64_t b11_8:4;
      uint64_t b15_12:4;
      uint64_t b19_16:4;
      uint64_t b23_20:4;
      uint64_t b27_24:4;
      uint64_t b31_28:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_TX_BLKS_PRI_REG;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b23_0:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_IDLE2LPI_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b23_0:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_LPI2WAKE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_EEE_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t b7_4:4;
      uint64_t b11_8:4;
      uint64_t b15_12:4;
      uint64_t b19_16:4;
      uint64_t b23_20:4;
      uint64_t b27_24:4;
      uint64_t b31_28:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RX_PKTS_PRI_REG;

  uint8_t res14[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t reservedSpace0:8;
      uint64_t b25_16:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RX_GAP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_FIFO_STATUS_REG;

  uint8_t res15[204];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:1;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b14_12:3;
      uint64_t reservedSpace3:1;
      uint64_t b18_16:3;
      uint64_t reservedSpace4:1;
      uint64_t b22_20:3;
      uint64_t reservedSpace5:1;
      uint64_t b26_24:3;
      uint64_t reservedSpace6:1;
      uint64_t b30_28:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RX_DSCP_MAP_REG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:1;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b14_12:3;
      uint64_t reservedSpace3:1;
      uint64_t b18_16:3;
      uint64_t reservedSpace4:1;
      uint64_t b22_20:3;
      uint64_t reservedSpace5:1;
      uint64_t b26_24:3;
      uint64_t reservedSpace6:1;
      uint64_t b30_28:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RX_DSCP_MAP_REG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:1;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b14_12:3;
      uint64_t reservedSpace3:1;
      uint64_t b18_16:3;
      uint64_t reservedSpace4:1;
      uint64_t b22_20:3;
      uint64_t reservedSpace5:1;
      uint64_t b26_24:3;
      uint64_t reservedSpace6:1;
      uint64_t b30_28:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RX_DSCP_MAP_REG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:1;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b14_12:3;
      uint64_t reservedSpace3:1;
      uint64_t b18_16:3;
      uint64_t reservedSpace4:1;
      uint64_t b22_20:3;
      uint64_t reservedSpace5:1;
      uint64_t b26_24:3;
      uint64_t reservedSpace6:1;
      uint64_t b30_28:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RX_DSCP_MAP_REG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:1;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b14_12:3;
      uint64_t reservedSpace3:1;
      uint64_t b18_16:3;
      uint64_t reservedSpace4:1;
      uint64_t b22_20:3;
      uint64_t reservedSpace5:1;
      uint64_t b26_24:3;
      uint64_t reservedSpace6:1;
      uint64_t b30_28:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RX_DSCP_MAP_REG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:1;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b14_12:3;
      uint64_t reservedSpace3:1;
      uint64_t b18_16:3;
      uint64_t reservedSpace4:1;
      uint64_t b22_20:3;
      uint64_t reservedSpace5:1;
      uint64_t b26_24:3;
      uint64_t reservedSpace6:1;
      uint64_t b30_28:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RX_DSCP_MAP_REG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:1;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b14_12:3;
      uint64_t reservedSpace3:1;
      uint64_t b18_16:3;
      uint64_t reservedSpace4:1;
      uint64_t b22_20:3;
      uint64_t reservedSpace5:1;
      uint64_t b26_24:3;
      uint64_t reservedSpace6:1;
      uint64_t b30_28:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RX_DSCP_MAP_REG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:1;
      uint64_t b6_4:3;
      uint64_t reservedSpace1:1;
      uint64_t b10_8:3;
      uint64_t reservedSpace2:1;
      uint64_t b14_12:3;
      uint64_t reservedSpace3:1;
      uint64_t b18_16:3;
      uint64_t reservedSpace4:1;
      uint64_t b22_20:3;
      uint64_t reservedSpace5:1;
      uint64_t b26_24:3;
      uint64_t reservedSpace6:1;
      uint64_t b30_28:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RX_DSCP_MAP_REG_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_CIR_REG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_CIR_REG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_CIR_REG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_CIR_REG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_CIR_REG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_CIR_REG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_CIR_REG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_CIR_REG_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_EIR_REG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_EIR_REG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_EIR_REG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_EIR_REG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_EIR_REG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_EIR_REG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_EIR_REG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b27_0:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PRI_EIR_REG_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:3;
      uint64_t b12_8:5;
      uint64_t reservedSpace1:3;
      uint64_t b20_16:5;
      uint64_t reservedSpace2:3;
      uint64_t b28_24:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_TX_D_THRESH_SET_L_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:3;
      uint64_t b12_8:5;
      uint64_t reservedSpace1:3;
      uint64_t b20_16:5;
      uint64_t reservedSpace2:3;
      uint64_t b28_24:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_TX_D_THRESH_SET_H_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:3;
      uint64_t b12_8:5;
      uint64_t reservedSpace1:3;
      uint64_t b20_16:5;
      uint64_t reservedSpace2:3;
      uint64_t b28_24:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_TX_D_THRESH_CLR_L_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:3;
      uint64_t b12_8:5;
      uint64_t reservedSpace1:3;
      uint64_t b20_16:5;
      uint64_t reservedSpace2:3;
      uint64_t b28_24:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_TX_D_THRESH_CLR_H_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:3;
      uint64_t b12_8:5;
      uint64_t reservedSpace1:3;
      uint64_t b20_16:5;
      uint64_t reservedSpace2:3;
      uint64_t b28_24:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_TX_G_BUF_THRESH_SET_L_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:3;
      uint64_t b12_8:5;
      uint64_t reservedSpace1:3;
      uint64_t b20_16:5;
      uint64_t reservedSpace2:3;
      uint64_t b28_24:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_TX_G_BUF_THRESH_SET_H_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:3;
      uint64_t b12_8:5;
      uint64_t reservedSpace1:3;
      uint64_t b20_16:5;
      uint64_t reservedSpace2:3;
      uint64_t b28_24:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_TX_G_BUF_THRESH_CLR_L_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:3;
      uint64_t b12_8:5;
      uint64_t reservedSpace1:3;
      uint64_t b20_16:5;
      uint64_t reservedSpace2:3;
      uint64_t b28_24:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_TX_G_BUF_THRESH_CLR_H_REG;

