iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res23[352];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:3;
      uint64_t b12_8:5;
      uint64_t reservedSpace1:3;
      uint64_t b20_16:5;
      uint64_t reservedSpace2:3;
      uint64_t b28_24:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_TX_D_OFLOW_ADDVAL_L_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:3;
      uint64_t b12_8:5;
      uint64_t reservedSpace1:3;
      uint64_t b20_16:5;
      uint64_t reservedSpace2:3;
      uint64_t b28_24:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_TX_D_OFLOW_ADDVAL_H_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b15_8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_SA_L_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b15_8:8;
      uint64_t b23_16:8;
      uint64_t b31_24:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_SA_H_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t reservedSpace0:4;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_TS_CTL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b21_16:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_TS_SEQ_LTYPE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_TS_VLAN_LTYPE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
      uint64_t b20_20:1;
      uint64_t b21_21:1;
      uint64_t b22_22:1;
      uint64_t b23_23:1;
      uint64_t b24_24:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_TS_CTL_LTYPE2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
      uint64_t b21_16:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_TS_CTL2_REG;

  uint8_t res24[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t reservedSpace0:2;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t reservedSpace1:2;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
      uint64_t b20_20:1;
      uint64_t b21_21:1;
      uint64_t b22_22:1;
      uint64_t b23_23:1;
      uint64_t b24_24:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_CONTROL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t reservedSpace0:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t reservedSpace1:1;
      uint64_t b15_8:8;
      uint64_t b23_16:8;
      uint64_t b26_24:3;
      uint64_t b27_27:1;
      uint64_t b28_28:1;
      uint64_t reservedSpace2:1;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_SOFT_RESET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b9_0:10;
      uint64_t reservedSpace0:2;
      uint64_t b15_12:4;
      uint64_t b25_16:10;
      uint64_t b30_26:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_BOFFTEST_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_RX_PAUSETIMER_REG;

  uint8_t res25[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_RXN_PAUSETIMER_REG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_RXN_PAUSETIMER_REG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_RXN_PAUSETIMER_REG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_RXN_PAUSETIMER_REG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_RXN_PAUSETIMER_REG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_RXN_PAUSETIMER_REG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_RXN_PAUSETIMER_REG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_RXN_PAUSETIMER_REG_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_TX_PAUSETIMER_REG;

  uint8_t res26[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_TXN_PAUSETIMER_REG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_TXN_PAUSETIMER_REG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_TXN_PAUSETIMER_REG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_TXN_PAUSETIMER_REG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_TXN_PAUSETIMER_REG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_TXN_PAUSETIMER_REG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_TXN_PAUSETIMER_REG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_TXN_PAUSETIMER_REG_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_EMCONTROL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_MAC_TX_GAP_REG;

  uint8_t res27[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_INTERVLAN_OPX_POINTER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_INTERVLAN_OPX_A_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_INTERVLAN_OPX_B_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_INTERVLAN_OPX_C_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PN_INTERVLAN_OPX_D_REG;

  uint8_t res28[64576];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_103;

