iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_104;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_105;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_106;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_108;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_109;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b21_0:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCH_LOC_127;

  uint8_t res29[7680];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH_IDVER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH_CONTROL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:28;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH_TEARDOWN_REG;

  uint8_t res30[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH_IDVER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH_CONTROL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b2_0:3;
      uint64_t reservedSpace0:28;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH_TEARDOWN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_SOFT_RESET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_CONTROL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t b10_8:3;
      uint64_t reservedSpace1:1;
      uint64_t b15_12:4;
      uint64_t b18_16:3;
      uint64_t reservedSpace2:1;
      uint64_t b23_20:4;
      uint64_t reservedSpace3:7;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b10_0:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH_BUFFER_OFFSET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_EMULATION_CONTROL_REG;

  uint8_t res31[80];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH_INTSTAT_RAW_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH_INTSTAT_MASKED_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH_INTSTAT_MASKED_SET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH_INTSTAT_MASKED_CLR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_IN_VECTOR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_EOI_VECTOR_REG;

