iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res32[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH_INTSTAT_RAW_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH_INTSTAT_MASKED_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH_INTSTAT_SET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH_INTSTAT_CLR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_INTSTAT_RAW_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_INTSTAT_MASKED_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_INTSTAT_SET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_INTSTAT_CLR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH0_PENDTHRESH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH1_PENDTHRESH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH2_PENDTHRESH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH3_PENDTHRESH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH4_PENDTHRESH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH5_PENDTHRESH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH6_PENDTHRESH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH7_PENDTHRESH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b14_0:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH0_FREEBUFFER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b14_0:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH1_FREEBUFFER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b14_0:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH2_FREEBUFFER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b14_0:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH3_FREEBUFFER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b14_0:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH4_FREEBUFFER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b14_0:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH5_FREEBUFFER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b14_0:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH6_FREEBUFFER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b14_0:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH7_FREEBUFFER_REG;

  uint8_t res33[256];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH0_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH1_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH2_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH3_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH4_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH5_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH6_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH7_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH0_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH1_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH2_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH3_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH4_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH5_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH6_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH7_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH0_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH1_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH2_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH3_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH4_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH5_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH6_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_FH7_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH0_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH1_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH2_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH3_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH4_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH5_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH6_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPDMA_TH7_CP_REG;

  uint8_t res34[128];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH0_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH1_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH2_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH3_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH4_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH5_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH6_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH7_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH0_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH1_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH2_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH3_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH4_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH5_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH6_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH7_HDP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH0_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH1_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH2_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH3_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH4_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH5_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH6_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_FH7_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH0_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH1_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH2_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH3_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH4_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH5_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH6_CP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CPDMA_TH7_CP_REG;

