iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res46[260];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP_LOW_REG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP_HIGH_REG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONTROL_REG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LENGTH_REG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPM_LOW_REG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b9_0:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPM_HIGH_REG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NUDGE_REG_1;

  uint8_t res47[3556];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MOD_VER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b15_8:8;
      uint64_t reservedSpace1:14;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t reservedSpace0:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t reservedSpace1:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t reservedSpace2:4;
      uint64_t b23_21:3;
      uint64_t b24_24:1;
      uint64_t reservedSpace3:4;
      uint64_t b29_29:1;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:11;
      uint64_t b18_16:3;
      uint64_t reservedSpace1:1;
      uint64_t b20_20:1;
      uint64_t b21_21:1;
      uint64_t b22_22:1;
      uint64_t b23_23:1;
      uint64_t b24_24:1;
      uint64_t b25_25:1;
      uint64_t reservedSpace2:1;
      uint64_t b27_27:1;
      uint64_t reservedSpace3:1;
      uint64_t b29_29:1;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b19_0:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_PRESCALE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b23_0:24;
      uint64_t reservedSpace0:6;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_AGING_CTRL;

  uint8_t res48[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b15_8:8;
      uint64_t b23_16:8;
      uint64_t b31_24:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_NXT_HDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:26;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_TBLCTL;

  uint8_t res49[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b6_0:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_TBLW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_TBLW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_TBLW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t reservedSpace0:1;
      uint64_t b7_7:1;
      uint64_t b9_8:2;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b23_16:8;
      uint64_t b31_24:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I0_ALE_PORTCTL0_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t reservedSpace0:1;
      uint64_t b7_7:1;
      uint64_t b9_8:2;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b23_16:8;
      uint64_t b31_24:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I0_ALE_PORTCTL0_1;

  uint8_t res50[72];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_UVLAN_MEMBER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_UVLAN_URCAST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_UVLAN_RMCAST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_UVLAN_UNTAG;

  uint8_t res51[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b3_0:4;
      uint64_t reservedSpace0:4;
      uint64_t b8_8:1;
      uint64_t reservedSpace1:6;
      uint64_t b15_15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_STAT_DIAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_OAM_LB_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE_MSK_MUX0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I1_ALE_MSK_MUX1_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I1_ALE_MSK_MUX1_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I1_ALE_MSK_MUX1_2;

  uint8_t res52[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t reservedSpace0:18;
      uint64_t b20_20:1;
      uint64_t b23_21:3;
      uint64_t b31_24:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EGRESSOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:10;
      uint64_t b15_15:1;
      uint64_t b18_16:3;
      uint64_t b19_19:1;
      uint64_t reservedSpace1:5;
      uint64_t b25_25:1;
      uint64_t reservedSpace2:4;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLICECFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:10;
      uint64_t b15_15:1;
      uint64_t b20_16:5;
      uint64_t reservedSpace1:10;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLICECFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:10;
      uint64_t b15_15:1;
      uint64_t b20_16:5;
      uint64_t reservedSpace1:10;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLICECFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b4_0:5;
      uint64_t reservedSpace0:10;
      uint64_t b15_15:1;
      uint64_t b20_16:5;
      uint64_t reservedSpace1:10;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLICECFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t b20_16:5;
      uint64_t reservedSpace1:10;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLICECFG4;

  uint8_t res53[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLICECFG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLICECFG7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t reservedSpace0:29;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLICETBLCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t b20_20:1;
      uint64_t b21_21:1;
      uint64_t b23_22:2;
      uint64_t b26_24:3;
      uint64_t reservedSpace1:1;
      uint64_t b28_28:1;
      uint64_t b29_29:1;
      uint64_t reservedSpace2:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLICECONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t reservedSpace0:26;
      uint64_t b28_28:1;
      uint64_t b29_29:1;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLICETESTCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t b29_29:1;
      uint64_t b30_30:1;
      uint64_t b31_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLICEHSTAT;

  uint8_t res54[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t reservedSpace0:9;
      uint64_t b15_15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THREADMAPDEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THREADMAPCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t reservedSpace0:9;
      uint64_t b15_15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THREADMAPVAL;

  uint8_t res55[3776];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b27_16:12;
      uint64_t b29_28:2;
      uint64_t b31_30:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) rev;

  uint8_t res56[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b10_0:11;
      uint64_t reservedSpace0:4;
      uint64_t b15_15:1;
      uint64_t b23_16:8;
      uint64_t b24_24:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) vector;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b10_0:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) stat;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) reserved_svbus_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) reserved_svbus_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) reserved_svbus_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) reserved_svbus_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) reserved_svbus_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) reserved_svbus_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) reserved_svbus_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) reserved_svbus_7;

