iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res57[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_eoi_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_status_reg0;

  uint8_t res58[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_enable_set_reg0;

  uint8_t res59[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_enable_clr_reg0;

  uint8_t res60[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ded_eoi_reg;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ded_status_reg0;

  uint8_t res61[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ded_enable_set_reg0;

  uint8_t res62[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
      uint64_t b4_4:1;
      uint64_t b5_5:1;
      uint64_t b6_6:1;
      uint64_t b7_7:1;
      uint64_t b8_8:1;
      uint64_t b9_9:1;
      uint64_t b10_10:1;
      uint64_t b11_11:1;
      uint64_t b12_12:1;
      uint64_t b13_13:1;
      uint64_t b14_14:1;
      uint64_t b15_15:1;
      uint64_t b16_16:1;
      uint64_t b17_17:1;
      uint64_t b18_18:1;
      uint64_t b19_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ded_enable_clr_reg0;

  uint8_t res63[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) aggr_enable_set;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) aggr_enable_clr;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) aggr_status_set;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b1_0:2;
      uint64_t b3_2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) aggr_status_clr;

};

#define MSS_CPSW (*(volatile struct MSS_CPSW_tag *) 0x7000000)

struct MPU_MSS_L2_BANKA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t revmin:6;
      uint64_t revcustom:2;
      uint64_t revmaj:3;
      uint64_t revrtl:5;
      uint64_t modID:12;
      uint64_t reserved:2;
      uint64_t scheme:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Revision;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assumed_allowed:1;
      uint64_t reserved:11;
      uint64_t num_fixed_aids:4;
      uint64_t num_prog:4;
      uint64_t num_fixed:4;
      uint64_t address_align:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Configuration;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t prot_err:1;
      uint64_t addr_err:1;
      uint64_t reserved:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Interrupt_Raw_StatusSet;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enabled_prot_err:1;
      uint64_t enabled_addr_err:1;
      uint64_t reserved:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Interrupt_Enabled_StatusClear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t prot_err_en:1;
      uint64_t addr_err_en:1;
      uint64_t reserved:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Interrupt_Enable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t prot_err_en_clr:1;
      uint64_t addr_err_en_clr:1;
      uint64_t reserved:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Interrupt_Enable_Clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t eoi_vector:8;
      uint64_t reserved:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EOI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intr_vec:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Interrupt_Vector;

  uint8_t res1[216];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Fixed_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Fixed_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Fixed_MPPA;

  uint8_t res2[244];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_1_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_1_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_1_MPPA;

