iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_2_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_2_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_2_MPPA;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_3_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_3_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_3_MPPA;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_4_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_4_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_4_MPPA;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_5_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_5_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_5_MPPA;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_6_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_6_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_6_MPPA;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_7_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_7_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_7_MPPA;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_8_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_8_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_8_MPPA;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_9_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_9_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_9_MPPA;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_10_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_10_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_10_MPPA;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_11_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_11_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_11_MPPA;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_12_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_12_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_12_MPPA;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_13_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_13_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_13_MPPA;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_14_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_14_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_14_MPPA;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_15_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_15_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_15_MPPA;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_16_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_16_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_16_MPPA;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fault_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Fault_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fault_type:6;
      uint64_t reserved2:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t privid:4;
      uint64_t reserved:3;
      uint64_t mstid:8;
      uint64_t id:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Fault_Status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t fault_clr:1;
      uint64_t reserved:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Fault_Clear;

