iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MPU_MSS_L2_BANKB (*(volatile struct MPU_MSS_L2_BANKB_tag *) 0x40040000)

struct MPU_MSS_MBOX_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t revmin:6;
      uint64_t revcustom:2;
      uint64_t revmaj:3;
      uint64_t revrtl:5;
      uint64_t modID:12;
      uint64_t reserved:2;
      uint64_t scheme:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Revision;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assumed_allowed:1;
      uint64_t reserved:11;
      uint64_t num_fixed_aids:4;
      uint64_t num_prog:4;
      uint64_t num_fixed:4;
      uint64_t address_align:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Configuration;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t prot_err:1;
      uint64_t addr_err:1;
      uint64_t reserved:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Interrupt_Raw_StatusSet;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t enabled_prot_err:1;
      uint64_t enabled_addr_err:1;
      uint64_t reserved:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Interrupt_Enabled_StatusClear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t prot_err_en:1;
      uint64_t addr_err_en:1;
      uint64_t reserved:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Interrupt_Enable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t prot_err_en_clr:1;
      uint64_t addr_err_en_clr:1;
      uint64_t reserved:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Interrupt_Enable_Clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t eoi_vector:8;
      uint64_t reserved:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EOI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intr_vec:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Interrupt_Vector;

  uint8_t res1[216];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Fixed_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Fixed_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Fixed_MPPA;

  uint8_t res2[244];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_1_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_1_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_1_MPPA;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_2_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_2_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_2_MPPA;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_3_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_3_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_3_MPPA;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_4_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_4_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_4_MPPA;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t start_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_5_Start_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end_addr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_5_End_Address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ux:1;
      uint64_t uw:1;
      uint64_t ur:1;
      uint64_t sx:1;
      uint64_t sw:1;
      uint64_t sr:1;
      uint64_t emu:1;
      uint64_t ns:1;
      uint64_t reserved1:1;
      uint64_t AIDX:1;
      uint64_t AID15_0:16;
      uint64_t reserved:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Programmable_5_MPPA;

