iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MPU_DSS_MBOX (*(volatile struct MPU_DSS_MBOX_tag *) 0x40200000)

struct DSS_CM4_CTRL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b7_6:2;
      uint64_t b10_8:3;
      uint64_t b15_11:5;
      uint64_t b31_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREVIOUS_NAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwreg3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwa_cm4_b0_meminit_start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_B0_MEMINIT_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwa_cm4_b0_meminit_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_B0_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwa_cm4_b0_meminit_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_B0_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwa_cm4_b1_meminit_start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_B1_MEMINIT_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwa_cm4_b1_meminit_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_B1_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwa_cm4_b1_meminit_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_B1_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwa_cm4_b2_meminit_start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_B2_MEMINIT_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwa_cm4_b2_meminit_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_B2_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwa_cm4_b2_meminit_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_B2_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwa_cm4_mbox_meminit_start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_MBOX_MEMINIT_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwa_cm4_mbox_meminit_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_MBOX_MEMINIT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hwa_cm4_mbox_meminit_done:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_MBOX_MEMINIT_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t proc_0:1;
      uint64_t reservedSpace0:3;
      uint64_t proc_1:1;
      uint64_t reservedSpace1:3;
      uint64_t proc_2:1;
      uint64_t reservedSpace2:3;
      uint64_t proc_3:1;
      uint64_t reservedSpace3:3;
      uint64_t proc_4:1;
      uint64_t reservedSpace4:3;
      uint64_t proc_5:1;
      uint64_t reservedSpace5:3;
      uint64_t proc_6:1;
      uint64_t reservedSpace6:3;
      uint64_t proc_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_MBOX_WRITE_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t proc_0:1;
      uint64_t reservedSpace0:3;
      uint64_t proc_1:1;
      uint64_t reservedSpace1:3;
      uint64_t proc_2:1;
      uint64_t reservedSpace2:3;
      uint64_t proc_3:1;
      uint64_t reservedSpace3:3;
      uint64_t proc_4:1;
      uint64_t reservedSpace4:3;
      uint64_t proc_5:1;
      uint64_t reservedSpace5:3;
      uint64_t proc_6:1;
      uint64_t reservedSpace6:3;
      uint64_t proc_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_MBOX_READ_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t proc_0:1;
      uint64_t reservedSpace0:3;
      uint64_t proc_1:1;
      uint64_t reservedSpace1:3;
      uint64_t proc_2:1;
      uint64_t reservedSpace2:3;
      uint64_t proc_3:1;
      uint64_t reservedSpace3:3;
      uint64_t proc_4:1;
      uint64_t reservedSpace4:3;
      uint64_t proc_5:1;
      uint64_t reservedSpace5:3;
      uint64_t proc_6:1;
      uint64_t reservedSpace6:3;
      uint64_t proc_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_MBOX_READ_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t select:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_IRQ_REQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_POR_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t assert:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_SYS_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t force_hclk_active:1;
      uint64_t sleep_hold_reqn:1;
      uint64_t wicenreq:1;
      uint64_t reservedSpace0:5;
      uint64_t cm4_clk_gate:1;
      uint64_t reservedSpace1:3;
      uint64_t cm4_sys_reset_hold:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t clear:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_RST_CAUSE_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t status:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_RST_CAUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t rst2assertdly:8;
      uint64_t rst_assertdly_common:8;
      uint64_t rst_wficheck:3;
      uint64_t reservedSpace1:1;
      uint64_t rst_fsm_trig:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_FSM_RST_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t wfi_override:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_WFI_OVERRIDE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dss_rcm_rd:1;
      uint64_t dss_rcm_wr:1;
      uint64_t dss_ctrl_rd:1;
      uint64_t dss_ctrl_wr:1;
      uint64_t dss_cm4_ctrl_rd:1;
      uint64_t dss_cm4_ctrl_wr:1;
      uint64_t dss_hwa_cfg_rd:1;
      uint64_t dss_hwa_cfg_wr:1;
      uint64_t rcss_rcm_rd:1;
      uint64_t rcss_rcm_wr:1;
      uint64_t rcss_ctrl_rd:1;
      uint64_t rcss_ctrl_wr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_PERIPH_ERRAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dss_rcm_rd:1;
      uint64_t dss_rcm_wr:1;
      uint64_t dss_ctrl_rd:1;
      uint64_t dss_ctrl_wr:1;
      uint64_t dss_cm4_ctrl_rd:1;
      uint64_t dss_cm4_ctrl_wr:1;
      uint64_t dss_hwa_cfg_rd:1;
      uint64_t dss_hwa_cfg_wr:1;
      uint64_t rcss_rcm_rd:1;
      uint64_t rcss_rcm_wr:1;
      uint64_t rcss_ctrl_rd:1;
      uint64_t rcss_ctrl_wr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_PERIPH_ERRAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t dss_rcm_rd:1;
      uint64_t dss_rcm_wr:1;
      uint64_t dss_ctrl_rd:1;
      uint64_t dss_ctrl_wr:1;
      uint64_t dss_cm4_ctrl_rd:1;
      uint64_t dss_cm4_ctrl_wr:1;
      uint64_t dss_hwa_cfg_rd:1;
      uint64_t dss_hwa_cfg_wr:1;
      uint64_t rcss_rcm_rd:1;
      uint64_t rcss_rcm_wr:1;
      uint64_t rcss_ctrl_rd:1;
      uint64_t rcss_ctrl_wr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_PERIPH_ERRAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ibus_write:1;
      uint64_t dbus_write:1;
      uint64_t sbus_write:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_AHB_ERRAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ibus_write:1;
      uint64_t dbus_write:1;
      uint64_t sbus_write:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_AHB_ERRAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ibus_write:1;
      uint64_t dbus_write:1;
      uint64_t sbus_write:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_AHB_ERRAGG_STATUS_RAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bank0_ded:1;
      uint64_t bank1_ded:1;
      uint64_t bank2_ded:1;
      uint64_t mbox_ded:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_ECC_ERRAGG_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bank0_ded:1;
      uint64_t bank1_ded:1;
      uint64_t bank2_ded:1;
      uint64_t mbox_ded:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_ECC_ERRAGG_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t bank0_ded:1;
      uint64_t bank1_ded:1;
      uint64_t bank2_ded:1;
      uint64_t mbox_ded:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWA_CM4_ECC_ERRAGG_STATUS_RAW;

  uint8_t res0[3900];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rw3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_ro3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_RO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_wph:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_WPH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t hw_spare_rec0:1;
      uint64_t hw_spare_rec1:1;
      uint64_t hw_spare_rec2:1;
      uint64_t hw_spare_rec3:1;
      uint64_t hw_spare_rec4:1;
      uint64_t hw_spare_rec5:1;
      uint64_t hw_spare_rec6:1;
      uint64_t hw_spare_rec7:1;
      uint64_t hw_spare_rec8:1;
      uint64_t hw_spare_rec9:1;
      uint64_t hw_spare_rec10:1;
      uint64_t hw_spare_rec11:1;
      uint64_t hw_spare_rec12:1;
      uint64_t hw_spare_rec13:1;
      uint64_t hw_spare_rec14:1;
      uint64_t hw_spare_rec15:1;
      uint64_t hw_spare_rec16:1;
      uint64_t hw_spare_rec17:1;
      uint64_t hw_spare_rec18:1;
      uint64_t hw_spare_rec19:1;
      uint64_t hw_spare_rec20:1;
      uint64_t hw_spare_rec21:1;
      uint64_t hw_spare_rec22:1;
      uint64_t hw_spare_rec23:1;
      uint64_t hw_spare_rec24:1;
      uint64_t hw_spare_rec25:1;
      uint64_t hw_spare_rec26:1;
      uint64_t hw_spare_rec27:1;
      uint64_t hw_spare_rec28:1;
      uint64_t hw_spare_rec29:1;
      uint64_t hw_spare_rec30:1;
      uint64_t hw_spare_rec31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_SPARE_REC;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_KICK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_raw_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enabled_status_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
      uint64_t b1_1:1;
      uint64_t b2_2:1;
      uint64_t b3_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) intr_enable_clear;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eoi;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_address;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b5_0:6;
      uint64_t b6_6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_type_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b7_0:8;
      uint64_t b19_8:12;
      uint64_t b31_20:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_attr_status;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) fault_clear;

