iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define DSS_MCRC (*(volatile struct DSS_MCRC_tag *) 0x83300000)

struct MSS_MCRC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1_PSA_SWREST:1;
      uint64_t CH1_DW_SEL:2;
      uint64_t CH1_CRC_SEL:2;
      uint64_t CH1_BIT_SWAP:1;
      uint64_t CH1_BYTE_SWAP:1;
      uint64_t CH1_CRC_SEL2:1;
      uint64_t CH2_PSA_SWREST:1;
      uint64_t CH2_DW_SEL:2;
      uint64_t CH2_CRC_SEL:2;
      uint64_t CH2_BIT_SWAP:1;
      uint64_t CH2_BYTE_SWAP:1;
      uint64_t CH2_CRC_SEL2:1;
      uint64_t NU1:1;
      uint64_t NU2:2;
      uint64_t NU3:2;
      uint64_t NU4:1;
      uint64_t NU5:1;
      uint64_t NU6:1;
      uint64_t NU7:1;
      uint64_t NU8:2;
      uint64_t NU9:2;
      uint64_t NU10:1;
      uint64_t NU11:1;
      uint64_t NU12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CTRL0;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWDN:1;
      uint64_t Reserved1:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CTRL1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1_MODE:2;
      uint64_t Reserved1:2;
      uint64_t CH1_TRACEEN:1;
      uint64_t Reserved2:3;
      uint64_t CH2_MODE:2;
      uint64_t Reserved3:6;
      uint64_t NU13:2;
      uint64_t Reserved4:6;
      uint64_t NU14:2;
      uint64_t Reserved5:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CTRL2;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved1:1;
      uint64_t CH1_CRCFAILENS:1;
      uint64_t CH1_OVERENS:1;
      uint64_t CH1_UNDERENS:1;
      uint64_t CH1_TIMEOUTENS:1;
      uint64_t Reserved2:4;
      uint64_t CH2_CRCFAILENS:1;
      uint64_t CH2_OVERENS:1;
      uint64_t CH2_UNDERENS:1;
      uint64_t CH2_TIMEOUTENS:1;
      uint64_t Reserved3:4;
      uint64_t NU15:1;
      uint64_t NU16:1;
      uint64_t NU17:1;
      uint64_t NU18:1;
      uint64_t Reserved4:4;
      uint64_t NU19:1;
      uint64_t NU20:1;
      uint64_t NU21:1;
      uint64_t NU22:1;
      uint64_t Reserved5:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_INTS;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved1:1;
      uint64_t CH1_CRCFAILENR:1;
      uint64_t CH1_OVERENR:1;
      uint64_t CH1_UNDERENR:1;
      uint64_t CH1_TIMEOUTENR:1;
      uint64_t Reserved2:4;
      uint64_t CH2_CRCFAILENR:1;
      uint64_t CH2_OVERENR:1;
      uint64_t CH2_UNDERENR:1;
      uint64_t CH2_TIMEOUTENR:1;
      uint64_t Reserved3:4;
      uint64_t NU23:1;
      uint64_t NU24:1;
      uint64_t NU25:1;
      uint64_t NU26:1;
      uint64_t Reserved4:4;
      uint64_t NU27:1;
      uint64_t NU28:1;
      uint64_t NU29:1;
      uint64_t NU30:1;
      uint64_t Reserved5:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_INTR;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved1:1;
      uint64_t CH1_CRCFAIL:1;
      uint64_t CH1_OVER:1;
      uint64_t CH1_UNDER:1;
      uint64_t CH1_TIMEOUT:1;
      uint64_t Reserved2:4;
      uint64_t CH2_CRCFAIL:1;
      uint64_t CH2_OVER:1;
      uint64_t CH2_UNDER:1;
      uint64_t CH2_TIMEOUT:1;
      uint64_t Reserved3:4;
      uint64_t NU31:1;
      uint64_t NU32:1;
      uint64_t NU33:1;
      uint64_t NU34:1;
      uint64_t Reserved4:4;
      uint64_t NU35:1;
      uint64_t NU36:1;
      uint64_t NU37:1;
      uint64_t NU38:1;
      uint64_t Reserved5:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_STATUS_REG;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFSTREG:8;
      uint64_t Reserved1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_INT_OFFSET_REG;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1_BUSY:1;
      uint64_t Reserved1:7;
      uint64_t Ch2_BUSY:1;
      uint64_t Reserved2:7;
      uint64_t NU39:1;
      uint64_t Reserved3:7;
      uint64_t NU40:1;
      uint64_t Reserved4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_BUSY;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_PAT_COUNT1:20;
      uint64_t Reserved1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_PCOUNT_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_SEC_COUNT1:16;
      uint64_t Reserved1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_SCOUNT_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_CURSEC1:16;
      uint64_t Reserved1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CURSEC_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_WDTOPLD1:24;
      uint64_t Reserved1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_WDTOPLD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_BCTOPLD1:24;
      uint64_t Reserved1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_BCTOPLD1;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSASIG1_31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SIGREGL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSA_SIG1_63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SIGREGH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC1_31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_REGL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC1_63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_REGH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSASECSIG1_31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SECSIGREGL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSASECSIG1_63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SECSIGREGH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAW_DATA1_31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_DATAREGL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAW_DATA1_63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_DATAREGH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_PAT_COUNT2:20;
      uint64_t Reserved1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_PCOUNT_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_SEC_COUNT2:16;
      uint64_t Reserved1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_SCOUNT_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_CURSEC2:16;
      uint64_t Reserved1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CURSEC_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_WDTOPLD2:24;
      uint64_t Reserved1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_WDTOPLD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_BCTOPLD2:24;
      uint64_t Reserved1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_BCTOPLD2;

  uint8_t res9[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSASIG2_31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SIGREGL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSA_SIG2_63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SIGREGH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC2_31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_REGL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC2_63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_REGH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSASECSIG2_31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SECSIGREGL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSASECSIG2_63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SECSIGREGH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAW_DATA2_31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_DATAREGL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAW_DATA2_63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_DATAREGH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU41:20;
      uint64_t Reserved1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_PCOUNT_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU42:16;
      uint64_t Reserved1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_SCOUNT_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU43:16;
      uint64_t Reserved1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CURSEC_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU44:24;
      uint64_t Reserved1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_WDTOPLD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU45:24;
      uint64_t Reserved1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_BCTOPLD3;

  uint8_t res10[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU46:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SIGREGL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU47:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SIGREGH3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU48:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_REGL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU49:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_REGH3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU50:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SECSIGREGL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU51:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SECSIGREGH3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU52:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_DATAREGL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU53:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_DATAREGH3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU54:20;
      uint64_t Reserved1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_PCOUNT_REG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU55:16;
      uint64_t Reserved1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_SCOUNT_REG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU56:16;
      uint64_t Reserved1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CURSEC_REG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU57:24;
      uint64_t Reserved1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_WDTOPLD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU58:24;
      uint64_t Reserved1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_BCTOPLD4;

  uint8_t res11[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU59:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SIGREGL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU60:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SIGREGH4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU61:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_REGL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU62:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_REGH4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU63:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SECSIGREGL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU64:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA_SECSIGREGH4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU65:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_DATAREGL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU66:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAW_DATAREGH4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITCMEn:1;
      uint64_t DTCMEn:1;
      uint64_t MEn:1;
      uint64_t NU67:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCRC_BUS_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NU68:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCRC_RESERVED;

