iSYSTEMLabs/winIDEAExampleWorkspaces/TI/AM2434_RAM_GCC/emptyTargetInit/Core_0_R5_1/AM2432_sfr.h
};

#define MSS_MCRC (*(volatile struct MSS_MCRC_tag *) 0xc5020000)

struct MSS_GPADC_DATA_RAM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t start:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) START;

  uint8_t res0[2040];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t end:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) END;

};

#define MSS_GPADC_DATA_RAM (*(volatile struct MSS_GPADC_DATA_RAM_tag *) 0xc5030000)

struct MSS_QSPI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR:6;
      uint64_t CUSTOM:2;
      uint64_t MAJOR:3;
      uint64_t RTL:5;
      uint64_t FUNC:12;
      uint64_t Reserved:2;
      uint64_t SCHEME:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_Reserved1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved_2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_Reserved2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved_3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_Reserved3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved1:2;
      uint64_t IDLEMODE:2;
      uint64_t Reserved2:2;
      uint64_t Reserved3:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved_4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_Reserved4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved_5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_Reserved5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved_6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_Reserved6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIRQ_RAW:1;
      uint64_t WIRQ_RAW:1;
      uint64_t Reserved:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_STATUS_RAW_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIRQ_ENA:1;
      uint64_t WIRQ_ENA:1;
      uint64_t Reserved:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_STATUS_ENABLED_CLEAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIRQ_ENA_SET:1;
      uint64_t WIRQ_ENA_SET:1;
      uint64_t Reserved:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_ENABLE_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIRQ_ENA_CLR:1;
      uint64_t WIRQ_ENA_CLR:1;
      uint64_t Reserved:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_ENABLE_CLEAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOI_VECTOR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC_EOI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved_7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_Reserved7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved_8:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_Reserved8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Reserved_9:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSS_QSPI_Reserved9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCLK_DIV:16;
      uint64_t Reserved:15;
      uint64_t CLKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CLOCK_CNTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKP0:1;
      uint64_t CSP0:1;
      uint64_t CKPH0:1;
      uint64_t DD0:2;
      uint64_t Reserved1:3;
      uint64_t CKP1:1;
      uint64_t CSP1:1;
      uint64_t CKPH1:1;
      uint64_t DD1:2;
      uint64_t Reserved2:3;
      uint64_t CKP2:1;
      uint64_t CSP2:1;
      uint64_t CKPH2:1;
      uint64_t DD2:2;
      uint64_t Reserved3:3;
      uint64_t CKP3:1;
      uint64_t CSP3:1;
      uint64_t CKPH3:1;
      uint64_t DD3:2;
      uint64_t Reserved4:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_DC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLEN:12;
      uint64_t Reserved1:2;
      uint64_t WIRQ:1;
      uint64_t FIRQ:1;
      uint64_t CMD:3;
      uint64_t WLEN:7;
      uint64_t Reserved2:2;
      uint64_t CSNUM:2;
      uint64_t Reserved3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t WC:1;
      uint64_t FC:1;
      uint64_t Reserved1:13;
      uint64_t WDCNT:12;
      uint64_t Reserved2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCMD:8;
      uint64_t NUM_A_BYTES:2;
      uint64_t NUM_D_BYTES:2;
      uint64_t READ_TYPE:2;
      uint64_t Reserved1:2;
      uint64_t WCMD:8;
      uint64_t NUM_D_BITS:5;
      uint64_t Reserved2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_SETUP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCMD:8;
      uint64_t NUM_A_BYTES:2;
      uint64_t NUM_D_BYTES:2;
      uint64_t READ_TYPE:2;
      uint64_t Reserved1:2;
      uint64_t WCMD:8;
      uint64_t NUM_D_BITS:5;
      uint64_t Reserved2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_SETUP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCMD:8;
      uint64_t NUM_A_BYTES:2;
      uint64_t NUM_D_BYTES:2;
      uint64_t READ_TYPE:2;
      uint64_t Reserved1:2;
      uint64_t WCMD:8;
      uint64_t NUM_D_BITS:5;
      uint64_t Reserved2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_SETUP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCMD:8;
      uint64_t NUM_A_BYTES:2;
      uint64_t NUM_D_BYTES:2;
      uint64_t READ_TYPE:2;
      uint64_t Reserved1:2;
      uint64_t WCMD:8;
      uint64_t NUM_D_BITS:5;
      uint64_t Reserved2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_SETUP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MMPT_S:1;
      uint64_t MM_INT_EN:1;
      uint64_t Reserved:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_SWITCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_DATA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_DATA3;

};

#define MSS_QSPI (*(volatile struct MSS_QSPI_tag *) 0xc8000000)

